StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
    struct {
      __IOM uint32_t Value      : 32;           /*!< [31..0] Reg value                                                         */
    } KEY_b;
  } ;
  
  union {
    __IOM uint32_t MAX_CLK;                     /*!< (@ 0x00000004) MAX_CLK Select Register                                    */
    
    struct {
      __IOM uint32_t Select     : 4;            /*!< [3..0] Select MAX_CLOCK source                                            */
    } MAX_CLK_b;
  } ;
  
  union {
    __IOM uint32_t CPU_CLK;                     /*!< (@ 0x00000008) CPU_CLK Register                                           */
    
    struct {
      __IOM uint32_t DIV        : 16;           /*!< [15..0] CPU_CLock div from MAX_CLOCK                                      */
      __IOM uint32_t EN_CHK_EVENT0 : 1;         /*!< [16..16] Go to HSI on lose active clock                                   */
      __IOM uint32_t EN_CHK_EVENT1 : 1;         /*!< [17..17] Go to HSI if active clock is low                                 */
      __IOM uint32_t EN_CHK_EVENT2 : 1;         /*!< [18..18] Go to HSI if active clock is High                                */
      __IOM uint32_t EN_CHK_EVENT3 : 1;         /*!< [19..19] Go to HSI if active clock is Highest                             */
      __IOM uint32_t EN_CHK     : 1;            /*!< [20..20] Clock Checker enable                                             */
      __IOM uint32_t CLR_CHK_SHIFT_REG0 : 1;    /*!< [21..21] Clear Min Freq level                                             */
      __IOM uint32_t CLR_CHK_SHIFT_REG1 : 1;    /*!< [22..22] Clear Max Freq level                                             */
      __IOM uint32_t CLR_CHK_EVENT0 : 1;        /*!< [23..23] Clear no freq event                                              */
      __IOM uint32_t CLR_CHK_EVENT1 : 1;        /*!< [24..24] Clear low freq event                                             */
      __IOM uint32_t CLR_CHK_EVENT2 : 1;        /*!< [25..25] Clear high freq event                                            */
      __IOM uint32_t CLR_CHK_EVENT3 : 1;        /*!< [26..26] Clear highest freq event                                         */
    } CPU_CLK_b;
  } ;
  
  union {
    __IOM uint32_t PER0_CLK;                    /*!< (@ 0x0000000C) Periph0 Clock Enable Register                              */
    
    struct {
      __IM  uint32_t            : 13;
      __IOM uint32_t PortA_CLK_EN : 1;          /*!< [13..13] GPIO Port Clock Enable                                           */
      __IOM uint32_t PortB_CLK_EN : 1;          /*!< [14..14] GPIO Port Clock Enable                                           */
      __IOM uint32_t PortC_CLK_EN : 1;          /*!< [15..15] GPIO Port Clock Enable                                           */
      __IOM uint32_t PortD_CLK_EN : 1;          /*!< [16..16] GPIO Port Clock Enable                                           */
      __IOM uint32_t PortE_CLK_EN : 1;          /*!< [17..17] GPIO Port Clock Enable                                           */
      __IM  uint32_t            : 3;
      __IOM uint32_t SPW1_CLK_EN : 1;           /*!< [21..21] SPW1 Clock Enable                                                */
      __IM  uint32_t            : 1;
      __IOM uint32_t TIM1_CLK_EN : 1;           /*!< [23..23] TIM1 Clock Enable                                                */
      __IOM uint32_t TIM2_CLK_EN : 1;           /*!< [24..24] TIM2 Clock Enable                                                */
      __IOM uint32_t TIM3_CLK_EN : 1;           /*!< [25..25] TIM3 Clock Enable                                                */
      __IOM uint32_t TIM4_CLK_EN : 1;           /*!< [26..26] TIM4 Clock Enable                                                */
      __IM  uint32_t            : 2;
      __IOM uint32_t CAN1_CLK_EN : 1;           /*!< [29..29] CAN1 Clock Enable                                                */
    } PER0_CLK_b;
  } ;
  
  union {
    __IOM uint32_t PER1_CLK;                    /*!< (@ 0x00000010) Periph1 Clock Enable Register                              */
    
    struct {
      __IM  uint32_t            : 2;
      __IOM uint32_t SSP1_CLK_EN : 1;           /*!< [2..2] SSP1 Clock Enable                                                  */
      __IM  uint32_t            : 3;
      __IOM uint32_t UART1_CLK_EN : 1;          /*!< [6..6] UART1 Clock Enable                                                 */
      __IOM uint32_t UART2_CLK_EN : 1;          /*!< [7..7] UART2 Clock Enable                                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t ARINK_RX_CLK_EN : 1;       /*!< [11..11] ARINK_RX Clock Enable                                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t ARINK_TX_CLK_EN : 1;       /*!< [13..13] ARINK_TX Clock Enable                                            */
      __IM  uint32_t            : 5;
      __IOM uint32_t MIL1_CLK_EN : 1;           /*!< [19..19] MIL1 Clock Enable                                                */
      __IM  uint32_t            : 1;
      __IOM uint32_t MIL2_CLK_EN : 1;           /*!< [21..21] MIL2 Clock Enable                                                */
      __IM  uint32_t            : 1;
      __IOM uint32_t ADC1_CLK_EN : 1;           /*!< [23..23] ADC1 Clock Enable                                                */
      __IOM uint32_t ADC2_CLK_EN : 1;           /*!< [24..24] ADC2 Clock Enable                                                */
      __IOM uint32_t DAC1_CLK_EN : 1;           /*!< [25..25] DAC1 Clock Enable                                                */
      __IOM uint32_t DAC2_CLK_EN : 1;           /*!< [26..26] DAC2 Clock Enable                                                */
    } PER1_CLK_b;
  } ;
  
  union {
    __IOM uint32_t CPU_CHK0;                    /*!< (@ 0x00000014) Clock Checker Register                                     */
    
