StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
    struct {
      __IOM uint32_t PLL_Q      : 4;            /*!< [3..0] PLL Freq divider                                                   */
      __IOM uint32_t DV         : 1;            /*!< [4..4] PLL Output Divider                                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t PLL_N      : 7;            /*!< [14..8] PLL Freq multiplier                                               */
      __IM  uint32_t            : 1;
      __IOM uint32_t EN_CHK_EVENT0 : 1;         /*!< [16..16] Go to HSI on lose active clock                                   */
      __IOM uint32_t EN_CHK_EVENT1 : 1;         /*!< [17..17] Go to HSI if active clock is low                                 */
      __IOM uint32_t EN_CHK_EVENT2 : 1;         /*!< [18..18] Go to HSI if active clock is High                                */
      __IOM uint32_t EN_CHK_EVENT3 : 1;         /*!< [19..19] Go to HSI if active clock is Highest                             */
      __IOM uint32_t EN_CHK     : 1;            /*!< [20..20] Clock Checker enable                                             */
      __IOM uint32_t CLR_CHK_SHIFT_REG0 : 1;    /*!< [21..21] Clear Min Freq level                                             */
      __IOM uint32_t CLR_CHK_SHIFT_REG1 : 1;    /*!< [22..22] Clear Max Freq level                                             */
      __IOM uint32_t CLR_CHK_EVENT0 : 1;        /*!< [23..23] Clear no freq event                                              */
      __IOM uint32_t CLR_CHK_EVENT1 : 1;        /*!< [24..24] Clear low freq event                                             */
      __IOM uint32_t CLR_CHK_EVENT2 : 1;        /*!< [25..25] Clear high freq event                                            */
      __IOM uint32_t CLR_CHK_EVENT3 : 1;        /*!< [26..26] Clear highest freq event                                         */
      __IOM uint32_t PLL_ON     : 1;            /*!< [27..27] PLL Enable                                                       */
      __IOM uint32_t PLL_RLD    : 1;            /*!< [28..28] PLL Reload                                                       */
      __IOM uint32_t SELECT     : 3;            /*!< [31..29] Select PLL Input                                                 */
    } PLL1_CLK_b;
  } ;
  
  union {
    __IOM uint32_t PLL1_CHK0;                   /*!< (@ 0x00000090) Clock Checker Register                                     */
    
    struct {
      __IOM uint32_t PRES_REG2  : 16;           /*!< [15..0] FreqRef Prescaller for Slow                                       */
      __IOM uint32_t PRES_REG0  : 16;           /*!< [31..16] FreqRef Prescaller for Fast                                      */
    } PLL1_CHK0_b;
  } ;
  
  union {
    __IOM uint32_t PLL1_CHK1;                   /*!< (@ 0x00000094) Clock Checker Register                                     */
    
    struct {
      __IOM uint32_t PRES_REG1  : 16;           /*!< [15..0] Clock Prescaller for Fast                                         */
      __IOM uint32_t PRES_REG3  : 16;           /*!< [31..16] Clock Prescaller for Slow                                        */
    } PLL1_CHK1_b;
  } ;
  
  union {
    __IOM uint32_t PLL1_CHK2;                   /*!< (@ 0x00000098) Clock Checker Register                                     */
    
    struct {
      __IOM uint32_t BASE_REG0  : 8;            /*!< [7..0] Min factor for SLOWEST                                             */
      __IOM uint32_t BASE_REG1  : 8;            /*!< [15..8] Min factor for SLOW                                               */
      __IOM uint32_t BASE_REG2  : 8;            /*!< [23..16] Max factor for FAST                                              */
      __IOM uint32_t BASE_REG3  : 8;            /*!< [31..24] Max factor for FASTEST                                           */
    } PLL1_CHK2_b;
  } ;
  
  union {
    __IOM uint32_t PLL1_STAT;                   /*!< (@ 0x0000009C) Clock Status Register                                      */
    
    struct {
      __IOM uint32_t MAX_CLK_SHIFT_REG0 : 8;    /*!< [7..0] Max factor detected for SLOW                                       */
      __IOM uint32_t MAX_CLK_SHIFT_REG1 : 8;    /*!< [15..8] Max factor detected for FAST                                      */
      __IOM uint32_t EVENT0     : 1;            /*!< [16..16] Event SLOWEST                                                    */
      __IOM uint32_t EVENT1     : 1;            /*!< [17..17] Event SLOW                                                       */
      __IOM uint32_t EVENT2     : 1;            /*!< [18..18] Event FAST                                                       */
      __IOM uint32_t EVENT3     : 1;            /*!< [19..19] Event FASTEST                                                    */
      __IOM uint32_t READY      : 1;            /*!< [20..20] Clock Ready                                                      */
    } PLL1_STAT_b;
  } ;
  
  union {
    __IOM uint32_t PLL2_CLK;                    /*!< (@ 0x000000A0) PLL0 Control                                               */
    
    struct {
      __IOM uint32_t PLL_Q      : 4;            /*!< [3..0] PLL Freq divider                                                   */
      __IOM uint32_t DV         : 1;            /*!< [4..4] PLL Output Divider                                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t PLL_N      : 7;            /*!< [14..8] PLL Freq multiplier                                               */
      __IM  uint32_t            : 1;
      __IOM uint32_t EN_CHK_EVENT0 : 1;         /*!< [16..16] Go to HSI on lose active clock                                   */
      __IOM uint32_t EN_CHK_EVENT1 : 1;         /*!< [17..17] Go to HSI if active clock is low                                 */
      __IOM uint32_t EN_CHK_EVENT2 : 1;         /*!< [18..18] Go to HSI if active clock is High                                */
      __IOM uint32_t EN_CHK_EVENT3 : 1;         /*!< [19..19] Go to HSI if active clock is Highest                             */
      __IOM uint32_t EN_CHK     : 1;            /*!< [20..20] Clock Checker enable                                             */
      __IOM uint32_t CLR_CHK_SHIFT_REG0 : 1;    /*!< [21..21] Clear Min Freq level                                             */
      __IOM uint32_t CLR_CHK_SHIFT_REG1 : 1;    /*!< [22..22] Clear Max Freq level                                             */
      __IOM uint32_t CLR_CHK_EVENT0 : 1;        /*!< [23..23] Clear no freq event                                              */
      __IOM uint32_t CLR_CHK_EVENT1 : 1;        /*!< [24..24] Clear low freq event                                             */
      __IOM uint32_t CLR_CHK_EVENT2 : 1;        /*!< [25..25] Clear high freq event                                            */
      __IOM uint32_t CLR_CHK_EVENT3 : 1;        /*!< [26..26] Clear highest freq event                                         */
      __IOM uint32_t PLL_ON     : 1;            /*!< [27..27] PLL Enable                                                       */
      __IOM uint32_t PLL_RLD    : 1;            /*!< [28..28] PLL Reload                                                       */
      __IOM uint32_t SELECT     : 3;            /*!< [31..29] Select PLL Input                                                 */
    } PLL2_CLK_b;
  } ;
  
  union {
    __IOM uint32_t PLL2_CHK0;                   /*!< (@ 0x000000A4) Clock Checker Register                                     */
    
