StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
    struct {
      __IOM uint32_t PRES_REG2  : 16;           /*!< [15..0] FreqRef Prescaller for Slow                                       */
      __IOM uint32_t PRES_REG0  : 16;           /*!< [31..16] FreqRef Prescaller for Fast                                      */
    } PLL2_CHK0_b;
  } ;
  
  union {
    __IOM uint32_t PLL2_CHK1;                   /*!< (@ 0x000000A8) Clock Checker Register                                     */
    
    struct {
      __IOM uint32_t PRES_REG1  : 16;           /*!< [15..0] Clock Prescaller for Fast                                         */
      __IOM uint32_t PRES_REG3  : 16;           /*!< [31..16] Clock Prescaller for Slow                                        */
    } PLL2_CHK1_b;
  } ;
  
  union {
    __IOM uint32_t PLL2_CHK2;                   /*!< (@ 0x000000AC) Clock Checker Register                                     */
    
    struct {
      __IOM uint32_t BASE_REG0  : 8;            /*!< [7..0] Min factor for SLOWEST                                             */
      __IOM uint32_t BASE_REG1  : 8;            /*!< [15..8] Min factor for SLOW                                               */
      __IOM uint32_t BASE_REG2  : 8;            /*!< [23..16] Max factor for FAST                                              */
      __IOM uint32_t BASE_REG3  : 8;            /*!< [31..24] Max factor for FASTEST                                           */
    } PLL2_CHK2_b;
  } ;
  
  union {
    __IOM uint32_t PLL2_STAT;                   /*!< (@ 0x000000B0) Clock Status Register                                      */
    
    struct {
      __IOM uint32_t MAX_CLK_SHIFT_REG0 : 8;    /*!< [7..0] Max factor detected for SLOW                                       */
      __IOM uint32_t MAX_CLK_SHIFT_REG1 : 8;    /*!< [15..8] Max factor detected for FAST                                      */
      __IOM uint32_t EVENT0     : 1;            /*!< [16..16] Event SLOWEST                                                    */
      __IOM uint32_t EVENT1     : 1;            /*!< [17..17] Event SLOW                                                       */
      __IOM uint32_t EVENT2     : 1;            /*!< [18..18] Event FAST                                                       */
      __IOM uint32_t EVENT3     : 1;            /*!< [19..19] Event FASTEST                                                    */
      __IOM uint32_t READY      : 1;            /*!< [20..20] Clock Ready                                                      */
    } PLL2_STAT_b;
  } ;
  __IM  uint32_t  RESERVED[25];
  
  union {
    __IOM uint32_t CAN1_CLK;                    /*!< (@ 0x00000118) Sync Clock Control                                         */
    
    struct {
      __IOM uint32_t DIV        : 16;           /*!< [15..0] MAX_Clock Div to PeriphClock                                      */
      __IOM uint32_t CLK_EN     : 1;            /*!< [16..16] PeriphClock Enable                                               */
    } CAN1_CLK_b;
  } ;
  __IM  uint32_t  RESERVED1[5];
  
  union {
    __IOM uint32_t TIM1_CLK;                    /*!< (@ 0x00000130) Sync Clock Control                                         */
    
    struct {
      __IOM uint32_t DIV        : 16;           /*!< [15..0] MAX_Clock Div to PeriphClock                                      */
      __IOM uint32_t CLK_EN     : 1;            /*!< [16..16] PeriphClock Enable                                               */
    } TIM1_CLK_b;
  } ;
  
  union {
    __IOM uint32_t TIM2_CLK;                    /*!< (@ 0x00000134) Sync Clock Control                                         */
    
    struct {
      __IOM uint32_t DIV        : 16;           /*!< [15..0] MAX_Clock Div to PeriphClock                                      */
      __IOM uint32_t CLK_EN     : 1;            /*!< [16..16] PeriphClock Enable                                               */
    } TIM2_CLK_b;
  } ;
  
  union {
    __IOM uint32_t TIM3_CLK;                    /*!< (@ 0x00000138) Sync Clock Control                                         */
    
    struct {
      __IOM uint32_t DIV        : 16;           /*!< [15..0] MAX_Clock Div to PeriphClock                                      */
      __IOM uint32_t CLK_EN     : 1;            /*!< [16..16] PeriphClock Enable                                               */
    } TIM3_CLK_b;
  } ;
  
  union {
    __IOM uint32_t TIM4_CLK;                    /*!< (@ 0x0000013C) Sync Clock Control                                         */
    
    struct {
      __IOM uint32_t DIV        : 16;           /*!< [15..0] MAX_Clock Div to PeriphClock                                      */
      __IOM uint32_t CLK_EN     : 1;            /*!< [16..16] PeriphClock Enable                                               */
    } TIM4_CLK_b;
  } ;
  __IM  uint32_t  RESERVED2[12];
  
  union {
    __IOM uint32_t ETH_CLK;                     /*!< (@ 0x00000170) Async Clock Control                                        */
    
    struct {
      __IOM uint32_t DIV        : 16;           /*!< [15..0] Div to PeriphClock                                                */
      __IOM uint32_t CLK_EN     : 1;            /*!< [16..16] PeriphClock Enable                                               */
      __IM  uint32_t            : 11;
      __IOM uint32_t SELECT     : 4;            /*!< [31..28] PeriphClock Enable                                               */
    } ETH_CLK_b;
  } ;
  __IM  uint32_t  RESERVED3;
  
  union {
    __IOM uint32_t SPW1_CLK;                    /*!< (@ 0x00000178) Sync Clock Control                                         */
    
    struct {
      __IOM uint32_t DIV        : 16;           /*!< [15..0] MAX_Clock Div to PeriphClock                                      */
      __IOM uint32_t CLK_EN     : 1;            /*!< [16..16] PeriphClock Enable                                               */
    } SPW1_CLK_b;
  } ;
  __IM  uint32_t  RESERVED4[3];
  
  union {
    __IOM uint32_t UART1_CLK;                   /*!< (@ 0x00000188) Async Clock Control                                        */
    
