StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
    struct {
      __IOM uint32_t DIV        : 16;           /*!< [15..0] Div to PeriphClock                                                */
      __IOM uint32_t CLK_EN     : 1;            /*!< [16..16] PeriphClock Enable                                               */
      __IM  uint32_t            : 11;
      __IOM uint32_t SELECT     : 4;            /*!< [31..28] PeriphClock Enable                                               */
    } UART1_CLK_b;
  } ;
  
  union {
    __IOM uint32_t UART2_CLK;                   /*!< (@ 0x0000018C) Async Clock Control                                        */
    
    struct {
      __IOM uint32_t DIV        : 16;           /*!< [15..0] Div to PeriphClock                                                */
      __IOM uint32_t CLK_EN     : 1;            /*!< [16..16] PeriphClock Enable                                               */
      __IM  uint32_t            : 11;
      __IOM uint32_t SELECT     : 4;            /*!< [31..28] PeriphClock Enable                                               */
    } UART2_CLK_b;
  } ;
  __IM  uint32_t  RESERVED5[4];
  
  union {
    __IOM uint32_t SSP1_CLK;                    /*!< (@ 0x000001A0) Async Clock Control                                        */
    
    struct {
      __IOM uint32_t DIV        : 16;           /*!< [15..0] Div to PeriphClock                                                */
      __IOM uint32_t CLK_EN     : 1;            /*!< [16..16] PeriphClock Enable                                               */
      __IM  uint32_t            : 11;
      __IOM uint32_t SELECT     : 4;            /*!< [31..28] PeriphClock Enable                                               */
    } SSP1_CLK_b;
  } ;
  __IM  uint32_t  RESERVED6[6];
  
  union {
    __IOM uint32_t ADC1_CLK;                    /*!< (@ 0x000001BC) Async Clock Control                                        */
    
    struct {
      __IOM uint32_t DIV        : 16;           /*!< [15..0] Div to PeriphClock                                                */
      __IOM uint32_t CLK_EN     : 1;            /*!< [16..16] PeriphClock Enable                                               */
      __IM  uint32_t            : 11;
      __IOM uint32_t SELECT     : 4;            /*!< [31..28] PeriphClock Enable                                               */
    } ADC1_CLK_b;
  } ;
  
  union {
    __IOM uint32_t ADC2_CLK;                    /*!< (@ 0x000001C0) Async Clock Control                                        */
    
    struct {
      __IOM uint32_t DIV        : 16;           /*!< [15..0] Div to PeriphClock                                                */
      __IOM uint32_t CLK_EN     : 1;            /*!< [16..16] PeriphClock Enable                                               */
      __IM  uint32_t            : 11;
      __IOM uint32_t SELECT     : 4;            /*!< [31..28] PeriphClock Enable                                               */
    } ADC2_CLK_b;
  } ;
  
  union {
    __IOM uint32_t DAC1_CLK;                    /*!< (@ 0x000001C4) Async Clock Control                                        */
    
    struct {
      __IOM uint32_t DIV        : 16;           /*!< [15..0] Div to PeriphClock                                                */
      __IOM uint32_t CLK_EN     : 1;            /*!< [16..16] PeriphClock Enable                                               */
      __IM  uint32_t            : 11;
      __IOM uint32_t SELECT     : 4;            /*!< [31..28] PeriphClock Enable                                               */
    } DAC1_CLK_b;
  } ;
  
  union {
    __IOM uint32_t DAC2_CLK;                    /*!< (@ 0x000001C8) Async Clock Control                                        */
    
    struct {
      __IOM uint32_t DIV        : 16;           /*!< [15..0] Div to PeriphClock                                                */
      __IOM uint32_t CLK_EN     : 1;            /*!< [16..16] PeriphClock Enable                                               */
      __IM  uint32_t            : 11;
      __IOM uint32_t SELECT     : 4;            /*!< [31..28] PeriphClock Enable                                               */
    } DAC2_CLK_b;
  } ;
  
  union {
    __IOM uint32_t RTC_CLK;                     /*!< (@ 0x000001CC) Async Clock Control                                        */
    
    struct {
      __IOM uint32_t DIV        : 16;           /*!< [15..0] Div to PeriphClock                                                */
      __IOM uint32_t CLK_EN     : 1;            /*!< [16..16] PeriphClock Enable                                               */
      __IM  uint32_t            : 11;
      __IOM uint32_t SELECT     : 4;            /*!< [31..28] PeriphClock Enable                                               */
    } RTC_CLK_b;
  } ;
} MDR_RST_CLOCK_Type;                           /*!< Size = 464 (0x1d0)                                                        */



/* =========================================================================================================================== */
/* ================                                          MDR_BKP                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Backup and RTC Control (MDR_BKP)
  */

typedef struct {                                /*!< (@ 0x40001000) MDR_BKP Structure                                          */
  __IOM uint32_t  REG[60];                      /*!< (@ 0x00000000) User backup registers                                      */
  __IOM uint32_t  KEY;                          /*!< (@ 0x000000F0) Unlock BKP and RTC Registers                               */
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t REG_60_TMR0;                 /*!< (@ 0x00000100) REG60 Control register                                     */
    
    struct {
      __IOM uint32_t MODE       : 7;            /*!< [6..0] Boot Mode                                                          */
      __IOM uint32_t FPOR       : 1;            /*!< [7..7] Bootloader completed                                               */
      __IOM uint32_t S_UccReset : 1;            /*!< [8..8] Reset by Ucc                                                       */
      __IOM uint32_t S_RSTn0    : 1;            /*!< [9..9] Reset by RSTn0 signal                                              */
      __IOM uint32_t S_FT_Reset : 1;            /*!< [10..10] Reset from FT_CNTR                                               */
      __IOM uint32_t S_WDT_Reset : 1;           /*!< [11..11] Reset from WDT                                                   */
      __IOM uint32_t S_RSTn1    : 1;            /*!< [12..12] Reset by RSTn1 signal                                            */
      __IOM uint32_t S_OVRSTn   : 1;            /*!< [13..13] Reset by Ucc > U_over (5.75V)                                    */
      __IOM uint32_t S_SYSRSTn  : 1;            /*!< [14..14] Reset by software                                                */
      __IOM uint32_t JTAG_Enable : 1;           /*!< [15..15] Disable JTAG                                                     */
      __IOM uint32_t LimEn_LDO_DUcc0 : 1;       /*!< [16..16] Enable limit for DUcc0 (~300mA)                                  */
      __IOM uint32_t LimEn_LDO_DUcc1 : 1;       /*!< [17..17] Enable limit for DUcc1 (~300mA)                                  */
      __IOM uint32_t LimEn_LDO_DUcc2 : 1;       /*!< [18..18] Enable limit for DUcc2 (~300mA)                                  */
      __IOM uint32_t LimEn_LDO_DUcc3 : 1;       /*!< [19..19] Enable limit for DUcc3 (~300mA)                                  */
      __IOM uint32_t LimEn_LDO_BUcc : 1;        /*!< [20..20] Enable limit for DUcc_Bat (~50mA)                                */
      __IOM uint32_t LimEn_LDO_PLL : 1;         /*!< [21..21] Enable limit for DUcc_PLL (~50mA)                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t ERR_REG60x : 1;            /*!< [25..25] Fault in REG_60x                                                 */
      __IOM uint32_t ERR_REG61x_62x : 1;        /*!< [26..26] Fault in REG_61x or REG_62x                                      */
      __IOM uint32_t ERR_REG63x : 1;            /*!< [27..27] Fault in REG_63x                                                 */
      __IOM uint32_t PORSTn_En  : 1;            /*!< [28..28] Enable reset by Ucc > U_POR (2.5V)                               */
      __IOM uint32_t OVRSTn_En  : 1;            /*!< [29..29] Enable reset by Ucc > U_over (5.75V)                             */
      __IOM uint32_t CLR_ERR    : 1;            /*!< [30..30] Clear Errors of REG_60x - 63x                                    */
      __IOM uint32_t ERR_IRQ_EN : 1;            /*!< [31..31] Enable BKP_IRQn on Errors                                        */
    } REG_60_TMR0_b;
  } ;
  
  union {
    __IOM uint32_t REG_61_TMR0;                 /*!< (@ 0x00000104) REG61 Control register                                     */
    
