StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
    struct {
      __IOM uint32_t LDO0_SRILow : 3;           /*!< [2..0] LDO Power adjustment                                               */
      __IOM uint32_t LDO0_Trim  : 3;            /*!< [5..3] LDO voltage tuning                                                 */
      __IOM uint32_t LDO0_En    : 1;            /*!< [6..6] LDO Enable                                                         */
      __IOM uint32_t LDO0_RDY   : 1;            /*!< [7..7] LDO Ready                                                          */
      __IOM uint32_t LDO1_SRILow : 3;           /*!< [10..8] LDO Power adjustment                                              */
      __IOM uint32_t LDO1_Trim  : 3;            /*!< [13..11] LDO voltage tuning                                               */
      __IOM uint32_t LDO1_En    : 1;            /*!< [14..14] LDO Enable                                                       */
      __IOM uint32_t LDO1_RDY   : 1;            /*!< [15..15] LDO Ready                                                        */
      __IOM uint32_t LDO2_SRILow : 3;           /*!< [18..16] LDO Power adjustment                                             */
      __IOM uint32_t LDO2_Trim  : 3;            /*!< [21..19] LDO voltage tuning                                               */
      __IOM uint32_t LDO2_En    : 1;            /*!< [22..22] LDO Enable                                                       */
      __IOM uint32_t LDO2_RDY   : 1;            /*!< [23..23] LDO Ready                                                        */
      __IOM uint32_t LDO3_SRILow : 3;           /*!< [26..24] LDO Power adjustment                                             */
      __IOM uint32_t LDO3_Trim  : 3;            /*!< [29..27] LDO voltage tuning                                               */
      __IOM uint32_t LDO3_En    : 1;            /*!< [30..30] LDO Enable                                                       */
      __IOM uint32_t LDO3_RDY   : 1;            /*!< [31..31] LDO Ready                                                        */
    } REG_61_TMR1_b;
  } ;
  
  union {
    __IOM uint32_t REG_62_TMR1;                 /*!< (@ 0x00000118) REG62 Control register                                     */
    
    struct {
      __IOM uint32_t LDO_BUcc_SRILow : 3;       /*!< [2..0] LDO Power adjustment                                               */
      __IOM uint32_t LDO_BUcc_Trim : 3;         /*!< [5..3] LDO voltage tuning                                                 */
      __IOM uint32_t LDO_BUcc_En : 1;           /*!< [6..6] LDO Enable                                                         */
      __IOM uint32_t LDO_BUcc_RDY : 1;          /*!< [7..7] LDO Ready                                                          */
      __IOM uint32_t LDO_PLL_SRILow : 3;        /*!< [10..8] LDO Power adjustment                                              */
      __IOM uint32_t LDO_PLL_Trim : 3;          /*!< [13..11] LDO voltage tuning                                               */
      __IOM uint32_t LDO_PLL_En : 1;            /*!< [14..14] LDO Enable                                                       */
      __IOM uint32_t LDO_PLL_RDY : 1;           /*!< [15..15] LDO Ready                                                        */
      __IM  uint32_t TrimR      : 9;            /*!< [24..16] Do not change                                                    */
      __IM  uint32_t            : 3;
      __IM  uint32_t Trim_Ref   : 3;            /*!< [30..28] Do not change                                                    */
    } REG_62_TMR1_b;
  } ;
  
  union {
    __IOM uint32_t REG_63_TMR1;                 /*!< (@ 0x0000011C) REG63 Control register                                     */
    
    struct {
      __IOM uint32_t LSE_On     : 1;            /*!< [0..0] LSE Enable                                                         */
      __IOM uint32_t LSE_BYP    : 1;            /*!< [1..1] LSE Bypass                                                         */
      __IOM uint32_t RTC_Sel    : 2;            /*!< [3..2] Select Clock for RTC                                               */
      __IOM uint32_t RTC_En     : 1;            /*!< [4..4] RTC Enable                                                         */
      __IOM uint32_t RTC_Cal    : 8;            /*!< [12..5] RTC pass counts                                                   */
      __IOM uint32_t LSE_RDY    : 1;            /*!< [13..13] LSE Ready                                                        */
      __IOM uint32_t LSE_FilterEn : 1;          /*!< [14..14] LSE Filter Enable                                                */
      __IOM uint32_t LSI_On     : 1;            /*!< [15..15] LSI Enable                                                       */
      __IOM uint32_t LSI_Trim   : 5;            /*!< [20..16] LSI Trim freq                                                    */
      __IOM uint32_t LSI_RDY    : 1;            /*!< [21..21] LSI Ready                                                        */
      __IOM uint32_t HSI_On     : 1;            /*!< [22..22] HSI Enable                                                       */
      __IOM uint32_t HSI_RDY    : 1;            /*!< [23..23] HSI Ready                                                        */
      __IOM uint32_t HSI_Trim   : 6;            /*!< [29..24] HSI trim freq                                                    */
      __IOM uint32_t STANDBY    : 1;            /*!< [30..30] Go Standby mode                                                  */
      __IOM uint32_t RTC_RST    : 1;            /*!< [31..31] RTC Reset                                                        */
    } REG_63_TMR1_b;
  } ;
  
  union {
    __IOM uint32_t REG_60_TMR2;                 /*!< (@ 0x00000120) REG60 Control register                                     */
    
    struct {
      __IOM uint32_t MODE       : 7;            /*!< [6..0] Boot Mode                                                          */
      __IOM uint32_t FPOR       : 1;            /*!< [7..7] Bootloader completed                                               */
      __IOM uint32_t S_UccReset : 1;            /*!< [8..8] Reset by Ucc                                                       */
      __IOM uint32_t S_RSTn0    : 1;            /*!< [9..9] Reset by RSTn0 signal                                              */
      __IOM uint32_t S_FT_Reset : 1;            /*!< [10..10] Reset from FT_CNTR                                               */
      __IOM uint32_t S_WDT_Reset : 1;           /*!< [11..11] Reset from WDT                                                   */
      __IOM uint32_t S_RSTn1    : 1;            /*!< [12..12] Reset by RSTn1 signal                                            */
      __IOM uint32_t S_OVRSTn   : 1;            /*!< [13..13] Reset by Ucc > U_over (5.75V)                                    */
      __IOM uint32_t S_SYSRSTn  : 1;            /*!< [14..14] Reset by software                                                */
      __IOM uint32_t JTAG_Enable : 1;           /*!< [15..15] Disable JTAG                                                     */
      __IOM uint32_t LimEn_LDO_DUcc0 : 1;       /*!< [16..16] Enable limit for DUcc0 (~300mA)                                  */
      __IOM uint32_t LimEn_LDO_DUcc1 : 1;       /*!< [17..17] Enable limit for DUcc1 (~300mA)                                  */
      __IOM uint32_t LimEn_LDO_DUcc2 : 1;       /*!< [18..18] Enable limit for DUcc2 (~300mA)                                  */
      __IOM uint32_t LimEn_LDO_DUcc3 : 1;       /*!< [19..19] Enable limit for DUcc3 (~300mA)                                  */
      __IOM uint32_t LimEn_LDO_BUcc : 1;        /*!< [20..20] Enable limit for DUcc_Bat (~50mA)                                */
      __IOM uint32_t LimEn_LDO_PLL : 1;         /*!< [21..21] Enable limit for DUcc_PLL (~50mA)                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t ERR_REG60x : 1;            /*!< [25..25] Fault in REG_60x                                                 */
      __IOM uint32_t ERR_REG61x_62x : 1;        /*!< [26..26] Fault in REG_61x or REG_62x                                      */
      __IOM uint32_t ERR_REG63x : 1;            /*!< [27..27] Fault in REG_63x                                                 */
      __IOM uint32_t PORSTn_En  : 1;            /*!< [28..28] Enable reset by Ucc > U_POR (2.5V)                               */
      __IOM uint32_t OVRSTn_En  : 1;            /*!< [29..29] Enable reset by Ucc > U_over (5.75V)                             */
      __IOM uint32_t CLR_ERR    : 1;            /*!< [30..30] Clear Errors of REG_60x - 63x                                    */
      __IOM uint32_t ERR_IRQ_EN : 1;            /*!< [31..31] Enable BKP_IRQn on Errors                                        */
    } REG_60_TMR2_b;
  } ;
  
  union {
    __IOM uint32_t REG_61_TMR2;                 /*!< (@ 0x00000124) REG61 Control register                                     */
    
