StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
    struct {
      __IOM uint32_t LDO0_SRILow : 3;           /*!< [2..0] LDO Power adjustment                                               */
      __IOM uint32_t LDO0_Trim  : 3;            /*!< [5..3] LDO voltage tuning                                                 */
      __IOM uint32_t LDO0_En    : 1;            /*!< [6..6] LDO Enable                                                         */
      __IOM uint32_t LDO0_RDY   : 1;            /*!< [7..7] LDO Ready                                                          */
      __IOM uint32_t LDO1_SRILow : 3;           /*!< [10..8] LDO Power adjustment                                              */
      __IOM uint32_t LDO1_Trim  : 3;            /*!< [13..11] LDO voltage tuning                                               */
      __IOM uint32_t LDO1_En    : 1;            /*!< [14..14] LDO Enable                                                       */
      __IOM uint32_t LDO1_RDY   : 1;            /*!< [15..15] LDO Ready                                                        */
      __IOM uint32_t LDO2_SRILow : 3;           /*!< [18..16] LDO Power adjustment                                             */
      __IOM uint32_t LDO2_Trim  : 3;            /*!< [21..19] LDO voltage tuning                                               */
      __IOM uint32_t LDO2_En    : 1;            /*!< [22..22] LDO Enable                                                       */
      __IOM uint32_t LDO2_RDY   : 1;            /*!< [23..23] LDO Ready                                                        */
      __IOM uint32_t LDO3_SRILow : 3;           /*!< [26..24] LDO Power adjustment                                             */
      __IOM uint32_t LDO3_Trim  : 3;            /*!< [29..27] LDO voltage tuning                                               */
      __IOM uint32_t LDO3_En    : 1;            /*!< [30..30] LDO Enable                                                       */
      __IOM uint32_t LDO3_RDY   : 1;            /*!< [31..31] LDO Ready                                                        */
    } REG_61_TMR2_b;
  } ;
  
  union {
    __IOM uint32_t REG_62_TMR2;                 /*!< (@ 0x00000128) REG62 Control register                                     */
    
    struct {
      __IOM uint32_t LDO_BUcc_SRILow : 3;       /*!< [2..0] LDO Power adjustment                                               */
      __IOM uint32_t LDO_BUcc_Trim : 3;         /*!< [5..3] LDO voltage tuning                                                 */
      __IOM uint32_t LDO_BUcc_En : 1;           /*!< [6..6] LDO Enable                                                         */
      __IOM uint32_t LDO_BUcc_RDY : 1;          /*!< [7..7] LDO Ready                                                          */
      __IOM uint32_t LDO_PLL_SRILow : 3;        /*!< [10..8] LDO Power adjustment                                              */
      __IOM uint32_t LDO_PLL_Trim : 3;          /*!< [13..11] LDO voltage tuning                                               */
      __IOM uint32_t LDO_PLL_En : 1;            /*!< [14..14] LDO Enable                                                       */
      __IOM uint32_t LDO_PLL_RDY : 1;           /*!< [15..15] LDO Ready                                                        */
      __IM  uint32_t TrimR      : 9;            /*!< [24..16] Do not change                                                    */
      __IM  uint32_t            : 3;
      __IM  uint32_t Trim_Ref   : 3;            /*!< [30..28] Do not change                                                    */
    } REG_62_TMR2_b;
  } ;
  
  union {
    __IOM uint32_t REG_63_TMR2;                 /*!< (@ 0x0000012C) REG63 Control register                                     */
    
    struct {
      __IOM uint32_t LSE_On     : 1;            /*!< [0..0] LSE Enable                                                         */
      __IOM uint32_t LSE_BYP    : 1;            /*!< [1..1] LSE Bypass                                                         */
      __IOM uint32_t RTC_Sel    : 2;            /*!< [3..2] Select Clock for RTC                                               */
      __IOM uint32_t RTC_En     : 1;            /*!< [4..4] RTC Enable                                                         */
      __IOM uint32_t RTC_Cal    : 8;            /*!< [12..5] RTC pass counts                                                   */
      __IOM uint32_t LSE_RDY    : 1;            /*!< [13..13] LSE Ready                                                        */
      __IOM uint32_t LSE_FilterEn : 1;          /*!< [14..14] LSE Filter Enable                                                */
      __IOM uint32_t LSI_On     : 1;            /*!< [15..15] LSI Enable                                                       */
      __IOM uint32_t LSI_Trim   : 5;            /*!< [20..16] LSI Trim freq                                                    */
      __IOM uint32_t LSI_RDY    : 1;            /*!< [21..21] LSI Ready                                                        */
      __IOM uint32_t HSI_On     : 1;            /*!< [22..22] HSI Enable                                                       */
      __IOM uint32_t HSI_RDY    : 1;            /*!< [23..23] HSI Ready                                                        */
      __IOM uint32_t HSI_Trim   : 6;            /*!< [29..24] HSI trim freq                                                    */
      __IOM uint32_t STANDBY    : 1;            /*!< [30..30] Go Standby mode                                                  */
      __IOM uint32_t RTC_RST    : 1;            /*!< [31..31] RTC Reset                                                        */
    } REG_63_TMR2_b;
  } ;
  __IOM uint32_t  RTC_CNT_TMR0;                 /*!< (@ 0x00000130) Count periods of PRL                                       */
  
  union {
    __IOM uint32_t RTC_DIV_TMR0;                /*!< (@ 0x00000134) Counts RTC Clock to get PRL value                          */
    
