StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
    struct {
      __IOM uint32_t Value      : 20;           /*!< [19..0] RTC DIV value                                                     */
    } RTC_DIV_TMR0_b;
  } ;
  
  union {
    __IOM uint32_t RTC_PRL_TMR0;                /*!< (@ 0x00000138) Period value for DIV counter                               */
    
    struct {
      __IOM uint32_t Value      : 20;           /*!< [19..0] RTC PRL value                                                     */
    } RTC_PRL_TMR0_b;
  } ;
  
  union {
    __IOM uint32_t RTC_ALRM_TMR0;               /*!< (@ 0x0000013C) Event value for CNT counter                                */
    
    struct {
      __IOM uint32_t Value      : 32;           /*!< [31..0] Alarm value of CNT                                                */
    } RTC_ALRM_TMR0_b;
  } ;
  
  union {
    __IOM uint32_t RTC_CS_TMR0;                 /*!< (@ 0x00000140) RTC Control and Status                                     */
    
    struct {
      __IOM uint32_t OWF        : 1;            /*!< [0..0] CNT Overflow flag, clear by set 1                                  */
      __IOM uint32_t SECF       : 1;            /*!< [1..1] DIV == PRL Event, clear by set 1                                   */
      __IOM uint32_t ALRF       : 1;            /*!< [2..2] CNT == ALRM Event, clear by set 1                                  */
      __IOM uint32_t OWF_IE     : 1;            /*!< [3..3] Enable IRQ by OWF                                                  */
      __IOM uint32_t SECF_IE    : 1;            /*!< [4..4] Enable IRQ by SECF                                                 */
      __IOM uint32_t ALRF_IE    : 1;            /*!< [5..5] Enable IRQ by ALRF                                                 */
      __IOM uint32_t WEC        : 1;            /*!< [6..6] RTC Busy flag                                                      */
      __IOM uint32_t CLR_ERRx   : 1;            /*!< [7..7] Clear Errors                                                       */
      __IOM uint32_t ERR_CNT    : 1;            /*!< [8..8] CNTx mistmatches                                                   */
      __IOM uint32_t ERR_DIV    : 1;            /*!< [9..9] DIVx mistmatches                                                   */
      __IOM uint32_t ERR_CM     : 1;            /*!< [10..10] Clock RTC too high                                               */
      __IOM uint32_t ERR_CC     : 1;            /*!< [11..11] Clock RTC too low                                                */
      __IOM uint32_t ERR_CNTx   : 1;            /*!< [12..12] Self channel CNT fault                                           */
      __IOM uint32_t ERR_DIVx   : 1;            /*!< [13..13] Self channel DIV fault                                           */
      __IOM uint32_t ERR_CMx    : 1;            /*!< [14..14] Self channel clock fault                                         */
      __IOM uint32_t ERR_IE     : 1;            /*!< [15..15] Enable IRQ on RTC faults                                         */
    } RTC_CS_TMR0_b;
  } ;
  __IM  uint32_t  RESERVED1[3];
  __IOM uint32_t  RTC_CNT_TMR1;                 /*!< (@ 0x00000150) Count periods of PRL                                       */
  
  union {
    __IOM uint32_t RTC_DIV_TMR1;                /*!< (@ 0x00000154) Counts RTC Clock to get PRL value                          */
    
    struct {
      __IOM uint32_t Value      : 20;           /*!< [19..0] RTC DIV value                                                     */
    } RTC_DIV_TMR1_b;
  } ;
  
  union {
    __IOM uint32_t RTC_PRL_TMR1;                /*!< (@ 0x00000158) Period value for DIV counter                               */
    
    struct {
      __IOM uint32_t Value      : 20;           /*!< [19..0] RTC PRL value                                                     */
    } RTC_PRL_TMR1_b;
  } ;
  
  union {
    __IOM uint32_t RTC_ALRM_TMR1;               /*!< (@ 0x0000015C) Event value for CNT counter                                */
    
    struct {
      __IOM uint32_t Value      : 32;           /*!< [31..0] Alarm value of CNT                                                */
    } RTC_ALRM_TMR1_b;
  } ;
  
  union {
    __IOM uint32_t RTC_CS_TMR1;                 /*!< (@ 0x00000160) RTC Control and Status                                     */
    
    struct {
      __IOM uint32_t OWF        : 1;            /*!< [0..0] CNT Overflow flag, clear by set 1                                  */
      __IOM uint32_t SECF       : 1;            /*!< [1..1] DIV == PRL Event, clear by set 1                                   */
      __IOM uint32_t ALRF       : 1;            /*!< [2..2] CNT == ALRM Event, clear by set 1                                  */
      __IOM uint32_t OWF_IE     : 1;            /*!< [3..3] Enable IRQ by OWF                                                  */
      __IOM uint32_t SECF_IE    : 1;            /*!< [4..4] Enable IRQ by SECF                                                 */
      __IOM uint32_t ALRF_IE    : 1;            /*!< [5..5] Enable IRQ by ALRF                                                 */
      __IOM uint32_t WEC        : 1;            /*!< [6..6] RTC Busy flag                                                      */
      __IOM uint32_t CLR_ERRx   : 1;            /*!< [7..7] Clear Errors                                                       */
      __IOM uint32_t ERR_CNT    : 1;            /*!< [8..8] CNTx mistmatches                                                   */
      __IOM uint32_t ERR_DIV    : 1;            /*!< [9..9] DIVx mistmatches                                                   */
      __IOM uint32_t ERR_CM     : 1;            /*!< [10..10] Clock RTC too high                                               */
      __IOM uint32_t ERR_CC     : 1;            /*!< [11..11] Clock RTC too low                                                */
      __IOM uint32_t ERR_CNTx   : 1;            /*!< [12..12] Self channel CNT fault                                           */
      __IOM uint32_t ERR_DIVx   : 1;            /*!< [13..13] Self channel DIV fault                                           */
      __IOM uint32_t ERR_CMx    : 1;            /*!< [14..14] Self channel clock fault                                         */
      __IOM uint32_t ERR_IE     : 1;            /*!< [15..15] Enable IRQ on RTC faults                                         */
    } RTC_CS_TMR1_b;
  } ;
  __IM  uint32_t  RESERVED2[3];
  __IOM uint32_t  RTC_CNT_TMR2;                 /*!< (@ 0x00000170) Count periods of PRL                                       */
  
  union {
    __IOM uint32_t RTC_DIV_TMR2;                /*!< (@ 0x00000174) Counts RTC Clock to get PRL value                          */
    
