StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
    struct {
      __IOM uint32_t Value      : 20;           /*!< [19..0] RTC DIV value                                                     */
    } RTC_DIV_TMR2_b;
  } ;
  
  union {
    __IOM uint32_t RTC_PRL_TMR2;                /*!< (@ 0x00000178) Period value for DIV counter                               */
    
    struct {
      __IOM uint32_t Value      : 20;           /*!< [19..0] RTC PRL value                                                     */
    } RTC_PRL_TMR2_b;
  } ;
  
  union {
    __IOM uint32_t RTC_ALRM_TMR2;               /*!< (@ 0x0000017C) Event value for CNT counter                                */
    
    struct {
      __IOM uint32_t Value      : 32;           /*!< [31..0] Alarm value of CNT                                                */
    } RTC_ALRM_TMR2_b;
  } ;
  
  union {
    __IOM uint32_t RTC_CS_TMR2;                 /*!< (@ 0x00000180) RTC Control and Status                                     */
    
    struct {
      __IOM uint32_t OWF        : 1;            /*!< [0..0] CNT Overflow flag, clear by set 1                                  */
      __IOM uint32_t SECF       : 1;            /*!< [1..1] DIV == PRL Event, clear by set 1                                   */
      __IOM uint32_t ALRF       : 1;            /*!< [2..2] CNT == ALRM Event, clear by set 1                                  */
      __IOM uint32_t OWF_IE     : 1;            /*!< [3..3] Enable IRQ by OWF                                                  */
      __IOM uint32_t SECF_IE    : 1;            /*!< [4..4] Enable IRQ by SECF                                                 */
      __IOM uint32_t ALRF_IE    : 1;            /*!< [5..5] Enable IRQ by ALRF                                                 */
      __IOM uint32_t WEC        : 1;            /*!< [6..6] RTC Busy flag                                                      */
      __IOM uint32_t CLR_ERRx   : 1;            /*!< [7..7] Clear Errors                                                       */
      __IOM uint32_t ERR_CNT    : 1;            /*!< [8..8] CNTx mistmatches                                                   */
      __IOM uint32_t ERR_DIV    : 1;            /*!< [9..9] DIVx mistmatches                                                   */
      __IOM uint32_t ERR_CM     : 1;            /*!< [10..10] Clock RTC too high                                               */
      __IOM uint32_t ERR_CC     : 1;            /*!< [11..11] Clock RTC too low                                                */
      __IOM uint32_t ERR_CNTx   : 1;            /*!< [12..12] Self channel CNT fault                                           */
      __IOM uint32_t ERR_DIVx   : 1;            /*!< [13..13] Self channel DIV fault                                           */
      __IOM uint32_t ERR_CMx    : 1;            /*!< [14..14] Self channel clock fault                                         */
      __IOM uint32_t ERR_IE     : 1;            /*!< [15..15] Enable IRQ on RTC faults                                         */
    } RTC_CS_TMR2_b;
  } ;
} MDR_BKP_Type;                                 /*!< Size = 388 (0x184)                                                        */



/* =========================================================================================================================== */
/* ================                                         MDR_SRAM                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief OTP_SRAM Memory Control (MDR_SRAM)
  */

typedef struct {                                /*!< (@ 0x40006000) MDR_SRAM Structure                                         */
  __IOM uint32_t  KEY;                          /*!< (@ 0x00000000) Unlock block register                                      */
  
  union {
    __IOM uint32_t CNTR;                        /*!< (@ 0x00000004) Control register                                           */
    
    struct {
      __IOM uint32_t WAITCYCL   : 4;            /*!< [3..0] OTP Access Delay                                                   */
      __IOM uint32_t REG_ACCESS : 1;            /*!< [4..4] OTP Access Delay                                                   */
      __IOM uint32_t CLK        : 1;            /*!< [5..5] Rise front to write or read                                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t OE         : 1;            /*!< [7..7] OE for SRAM                                                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t WE_x00     : 1;            /*!< [9..9] WE for SRAM addr section 0x00                                      */
      __IOM uint32_t WE_x04     : 1;            /*!< [10..10] WE for SRAM addr section 0x04                                    */
      __IOM uint32_t WE_x08     : 1;            /*!< [11..11] WE for SRAM addr section 0x08                                    */
      __IOM uint32_t WE_x0C     : 1;            /*!< [12..12] WE for SRAM addr section 0x0C                                    */
      __IOM uint32_t WE_ECC     : 1;            /*!< [13..13] WE for SRAM addr ECC                                             */
      __IOM uint32_t CEN        : 1;            /*!< [14..14] CE for SRAM                                                      */
      __IM  uint32_t            : 1;
      __IOM uint32_t WECC       : 8;            /*!< [23..16] ECC for write with WDATA                                         */
      __IOM uint32_t RECC       : 8;            /*!< [31..24] ECC after read with RDATA                                        */
    } CNTR_b;
  } ;
  __IOM uint32_t  ADR;                          /*!< (@ 0x00000008) Access address                                             */
  __IOM uint32_t  WDATA;                        /*!< (@ 0x0000000C) Data to write                                              */
  __IOM uint32_t  RDATA;                        /*!< (@ 0x00000010) Read out data                                              */
  
  union {
    __IOM uint32_t ECCCS;                       /*!< (@ 0x00000014) Control-Status Register                                    */
    
