StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
    struct {
      __IOM uint32_t SECC       : 1;            /*!< [0..0] SingleError flag                                                   */
      __IOM uint32_t DECC       : 1;            /*!< [1..1] DoubleError flag                                                   */
      __IOM uint32_t SECC_IE    : 1;            /*!< [2..2] SingleError IRQ Enable                                             */
      __IOM uint32_t DECC_IE    : 1;            /*!< [3..3] DoubleError IRQ Enable                                             */
      __IOM uint32_t FIX_SECC   : 1;            /*!< [4..4] Log SE to ECCADR, ECCDATA, ECCECC                                  */
      __IOM uint32_t FIX_DECC   : 1;            /*!< [5..5] Log DE to ECCADR, ECCDATA, ECCECC                                  */
      __IOM uint32_t CLR_SECNT  : 1;            /*!< [6..6] Clear SE counter                                                   */
      __IOM uint32_t CLR_DECNT  : 1;            /*!< [7..7] Clear DE counter                                                   */
      __IOM uint32_t ECC_DECNT  : 8;            /*!< [15..8] DE Events Counter                                                 */
      __IOM uint32_t ECC_SECNT  : 16;           /*!< [31..16] SE Events Counter                                                */
    } ECCCS_b;
  } ;
  __IOM uint32_t  ECCADR;                       /*!< (@ 0x00000018) Last error address without correction                      */
  __IOM uint32_t  ECCDATA;                      /*!< (@ 0x0000001C) Last error data without correction                         */
  __IOM uint32_t  ECCECC;                       /*!< (@ 0x00000020) Last error ECC without correction                          */
  
  union {
    __IOM uint32_t TEST_TUNING;                 /*!< (@ 0x00000024) Access Memory Tuning register                              */
    
    struct {
      __IOM uint32_t SRAM_TIMEOUT : 3;          /*!< [2..0] Timeouts to read SRAM                                              */
      __IM  uint32_t            : 1;
      __IOM uint32_t TE         : 2;            /*!< [5..4] Select Test Mode                                                   */
      __IM  uint32_t            : 2;
      __IOM uint32_t TIME_TUNING : 3;           /*!< [10..8] Timeouts to read bit                                              */
      __IM  uint32_t            : 5;
      __IOM uint32_t REPL_TUNING : 4;           /*!< [19..16] Bit Hi_Level Read Resistance                                     */
    } TEST_TUNING_b;
  } ;
} MDR_SRAM_Type;                                /*!< Size = 40 (0x28)                                                          */



/* =========================================================================================================================== */
/* ================                                         MDR_PORTA                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief PORTA (MDR_PORTA)
  */

typedef struct {                                /*!< (@ 0x40080000) MDR_PORTA Structure                                        */
  __IOM uint32_t  KEY;                          /*!< (@ 0x00000000) Key lock Register                                          */
  
  union {
    __IOM uint32_t RXTX;                        /*!< (@ 0x00000004) GPIO Pin Data Register                                     */
    
    struct {
      __IOM uint32_t Pin_0      : 1;            /*!< [0..0] Pin data value                                                     */
      __IOM uint32_t Pin_1      : 1;            /*!< [1..1] Pin data value                                                     */
      __IOM uint32_t Pin_2      : 1;            /*!< [2..2] Pin data value                                                     */
      __IOM uint32_t Pin_3      : 1;            /*!< [3..3] Pin data value                                                     */
      __IOM uint32_t Pin_4      : 1;            /*!< [4..4] Pin data value                                                     */
      __IOM uint32_t Pin_5      : 1;            /*!< [5..5] Pin data value                                                     */
      __IOM uint32_t Pin_6      : 1;            /*!< [6..6] Pin data value                                                     */
      __IOM uint32_t Pin_7      : 1;            /*!< [7..7] Pin data value                                                     */
      __IOM uint32_t Pin_8      : 1;            /*!< [8..8] Pin data value                                                     */
      __IOM uint32_t Pin_9      : 1;            /*!< [9..9] Pin data value                                                     */
      __IOM uint32_t Pin_10     : 1;            /*!< [10..10] Pin data value                                                   */
      __IOM uint32_t Pin_11     : 1;            /*!< [11..11] Pin data value                                                   */
      __IOM uint32_t Pin_12     : 1;            /*!< [12..12] Pin data value                                                   */
      __IOM uint32_t Pin_13     : 1;            /*!< [13..13] Pin data value                                                   */
      __IOM uint32_t Pin_14     : 1;            /*!< [14..14] Pin data value                                                   */
      __IOM uint32_t Pin_15     : 1;            /*!< [15..15] Pin data value                                                   */
      __IOM uint32_t Pin_16     : 1;            /*!< [16..16] Pin data value                                                   */
      __IOM uint32_t Pin_17     : 1;            /*!< [17..17] Pin data value                                                   */
      __IOM uint32_t Pin_18     : 1;            /*!< [18..18] Pin data value                                                   */
      __IOM uint32_t Pin_19     : 1;            /*!< [19..19] Pin data value                                                   */
      __IOM uint32_t Pin_20     : 1;            /*!< [20..20] Pin data value                                                   */
      __IOM uint32_t Pin_21     : 1;            /*!< [21..21] Pin data value                                                   */
      __IOM uint32_t Pin_22     : 1;            /*!< [22..22] Pin data value                                                   */
      __IOM uint32_t Pin_23     : 1;            /*!< [23..23] Pin data value                                                   */
      __IOM uint32_t Pin_24     : 1;            /*!< [24..24] Pin data value                                                   */
      __IOM uint32_t Pin_25     : 1;            /*!< [25..25] Pin data value                                                   */
      __IOM uint32_t Pin_26     : 1;            /*!< [26..26] Pin data value                                                   */
      __IOM uint32_t Pin_27     : 1;            /*!< [27..27] Pin data value                                                   */
      __IOM uint32_t Pin_28     : 1;            /*!< [28..28] Pin data value                                                   */
      __IOM uint32_t Pin_29     : 1;            /*!< [29..29] Pin data value                                                   */
      __IOM uint32_t Pin_30     : 1;            /*!< [30..30] Pin data value                                                   */
      __IOM uint32_t Pin_31     : 1;            /*!< [31..31] Pin data value                                                   */
    } RXTX_b;
  } ;
  
  union {
    __OM  uint32_t RXTX_Set;                    /*!< (@ 0x00000008) Set RXTX Bits                                              */
    
