StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
      struct {
        __IM  uint32_t Pin_0    : 1;            /*!< [0..0] Pin Output Enable                                                  */
        __IM  uint32_t Pin_1    : 1;            /*!< [1..1] Pin Output Enable                                                  */
        __IM  uint32_t Pin_2    : 1;            /*!< [2..2] Pin Output Enable                                                  */
        __IM  uint32_t Pin_3    : 1;            /*!< [3..3] Pin Output Enable                                                  */
        __IM  uint32_t Pin_4    : 1;            /*!< [4..4] Pin Output Enable                                                  */
        __IM  uint32_t Pin_5    : 1;            /*!< [5..5] Pin Output Enable                                                  */
        __IM  uint32_t Pin_6    : 1;            /*!< [6..6] Pin Output Enable                                                  */
        __IM  uint32_t Pin_7    : 1;            /*!< [7..7] Pin Output Enable                                                  */
        __IM  uint32_t Pin_8    : 1;            /*!< [8..8] Pin Output Enable                                                  */
        __IM  uint32_t Pin_9    : 1;            /*!< [9..9] Pin Output Enable                                                  */
        __IM  uint32_t Pin_10   : 1;            /*!< [10..10] Pin Output Enable                                                */
        __IM  uint32_t Pin_11   : 1;            /*!< [11..11] Pin Output Enable                                                */
        __IM  uint32_t Pin_12   : 1;            /*!< [12..12] Pin Output Enable                                                */
        __IM  uint32_t Pin_13   : 1;            /*!< [13..13] Pin Output Enable                                                */
        __IM  uint32_t Pin_14   : 1;            /*!< [14..14] Pin Output Enable                                                */
        __IM  uint32_t Pin_15   : 1;            /*!< [15..15] Pin Output Enable                                                */
        __IM  uint32_t Pin_16   : 1;            /*!< [16..16] Pin Output Enable                                                */
        __IM  uint32_t Pin_17   : 1;            /*!< [17..17] Pin Output Enable                                                */
        __IM  uint32_t Pin_18   : 1;            /*!< [18..18] Pin Output Enable                                                */
        __IM  uint32_t Pin_19   : 1;            /*!< [19..19] Pin Output Enable                                                */
        __IM  uint32_t Pin_20   : 1;            /*!< [20..20] Pin Output Enable                                                */
        __IM  uint32_t Pin_21   : 1;            /*!< [21..21] Pin Output Enable                                                */
        __IM  uint32_t Pin_22   : 1;            /*!< [22..22] Pin Output Enable                                                */
        __IM  uint32_t Pin_23   : 1;            /*!< [23..23] Pin Output Enable                                                */
        __IM  uint32_t Pin_24   : 1;            /*!< [24..24] Pin Output Enable                                                */
        __IM  uint32_t Pin_25   : 1;            /*!< [25..25] Pin Output Enable                                                */
        __IM  uint32_t Pin_26   : 1;            /*!< [26..26] Pin Output Enable                                                */
        __IM  uint32_t Pin_27   : 1;            /*!< [27..27] Pin Output Enable                                                */
        __IM  uint32_t Pin_28   : 1;            /*!< [28..28] Pin Output Enable                                                */
        __IM  uint32_t Pin_29   : 1;            /*!< [29..29] Pin Output Enable                                                */
        __IM  uint32_t Pin_30   : 1;            /*!< [30..30] Pin Output Enable                                                */
        __IM  uint32_t Pin_31   : 1;            /*!< [31..31] Pin Output Enable                                                */
      } OE_b;
    } ;
    
    union {
      __OM  uint32_t OE_Set;                    /*!< (@ 0x00000010) Set OE Pins                                                */
      
      struct {
        __OM  uint32_t Pin_0    : 1;            /*!< [0..0] Set 1 to pin                                                       */
        __OM  uint32_t Pin_1    : 1;            /*!< [1..1] Set 1 to pin                                                       */
        __OM  uint32_t Pin_2    : 1;            /*!< [2..2] Set 1 to pin                                                       */
        __OM  uint32_t Pin_3    : 1;            /*!< [3..3] Set 1 to pin                                                       */
        __OM  uint32_t Pin_4    : 1;            /*!< [4..4] Set 1 to pin                                                       */
        __OM  uint32_t Pin_5    : 1;            /*!< [5..5] Set 1 to pin                                                       */
        __OM  uint32_t Pin_6    : 1;            /*!< [6..6] Set 1 to pin                                                       */
        __OM  uint32_t Pin_7    : 1;            /*!< [7..7] Set 1 to pin                                                       */
        __OM  uint32_t Pin_8    : 1;            /*!< [8..8] Set 1 to pin                                                       */
        __OM  uint32_t Pin_9    : 1;            /*!< [9..9] Set 1 to pin                                                       */
        __OM  uint32_t Pin_10   : 1;            /*!< [10..10] Set 1 to pin                                                     */
        __OM  uint32_t Pin_11   : 1;            /*!< [11..11] Set 1 to pin                                                     */
        __OM  uint32_t Pin_12   : 1;            /*!< [12..12] Set 1 to pin                                                     */
        __OM  uint32_t Pin_13   : 1;            /*!< [13..13] Set 1 to pin                                                     */
        __OM  uint32_t Pin_14   : 1;            /*!< [14..14] Set 1 to pin                                                     */
        __OM  uint32_t Pin_15   : 1;            /*!< [15..15] Set 1 to pin                                                     */
        __OM  uint32_t Pin_16   : 1;            /*!< [16..16] Set 1 to pin                                                     */
        __OM  uint32_t Pin_17   : 1;            /*!< [17..17] Set 1 to pin                                                     */
        __OM  uint32_t Pin_18   : 1;            /*!< [18..18] Set 1 to pin                                                     */
        __OM  uint32_t Pin_19   : 1;            /*!< [19..19] Set 1 to pin                                                     */
        __OM  uint32_t Pin_20   : 1;            /*!< [20..20] Set 1 to pin                                                     */
        __OM  uint32_t Pin_21   : 1;            /*!< [21..21] Set 1 to pin                                                     */
        __OM  uint32_t Pin_22   : 1;            /*!< [22..22] Set 1 to pin                                                     */
        __OM  uint32_t Pin_23   : 1;            /*!< [23..23] Set 1 to pin                                                     */
        __OM  uint32_t Pin_24   : 1;            /*!< [24..24] Set 1 to pin                                                     */
        __OM  uint32_t Pin_25   : 1;            /*!< [25..25] Set 1 to pin                                                     */
        __OM  uint32_t Pin_26   : 1;            /*!< [26..26] Set 1 to pin                                                     */
        __OM  uint32_t Pin_27   : 1;            /*!< [27..27] Set 1 to pin                                                     */
        __OM  uint32_t Pin_28   : 1;            /*!< [28..28] Set 1 to pin                                                     */
        __OM  uint32_t Pin_29   : 1;            /*!< [29..29] Set 1 to pin                                                     */
        __OM  uint32_t Pin_30   : 1;            /*!< [30..30] Set 1 to pin                                                     */
        __OM  uint32_t Pin_31   : 1;            /*!< [31..31] Set 1 to pin                                                     */
      } OE_Set_b;
    } ;
  };
  
  union {
    __OM  uint32_t OE_Clear;                    /*!< (@ 0x00000014) Clear OE Pins                                              */
    
