StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
      struct {
        __IM  uint32_t Func_Pin_8 : 4;          /*!< [3..0] Read SFUNC1 Register                                               */
        __IM  uint32_t Func_Pin_9 : 4;          /*!< [7..4] Read SFUNC1 Register                                               */
        __IM  uint32_t Func_Pin_10 : 4;         /*!< [11..8] Read SFUNC1 Register                                              */
        __IM  uint32_t Func_Pin_11 : 4;         /*!< [15..12] Read SFUNC1 Register                                             */
        __IM  uint32_t Func_Pin_12 : 4;         /*!< [19..16] Read SFUNC1 Register                                             */
        __IM  uint32_t Func_Pin_13 : 4;         /*!< [23..20] Read SFUNC1 Register                                             */
        __IM  uint32_t Func_Pin_14 : 4;         /*!< [27..24] Read SFUNC1 Register                                             */
        __IM  uint32_t Func_Pin_15 : 4;         /*!< [31..28] Read SFUNC1 Register                                             */
      } FUNC1_b;
    } ;
    
    union {
      __OM  uint32_t FUNC1_Set;                 /*!< (@ 0x0000001C) Set FUNC1 bits                                             */
      
      struct {
        __OM  uint32_t Func_Pin_8 : 4;          /*!< [3..0] Read SFUNC1 Register                                               */
        __OM  uint32_t Func_Pin_9 : 4;          /*!< [7..4] Read SFUNC1 Register                                               */
        __OM  uint32_t Func_Pin_10 : 4;         /*!< [11..8] Read SFUNC1 Register                                              */
        __OM  uint32_t Func_Pin_11 : 4;         /*!< [15..12] Read SFUNC1 Register                                             */
        __OM  uint32_t Func_Pin_12 : 4;         /*!< [19..16] Read SFUNC1 Register                                             */
        __OM  uint32_t Func_Pin_13 : 4;         /*!< [23..20] Read SFUNC1 Register                                             */
        __OM  uint32_t Func_Pin_14 : 4;         /*!< [27..24] Read SFUNC1 Register                                             */
        __OM  uint32_t Func_Pin_15 : 4;         /*!< [31..28] Read SFUNC1 Register                                             */
      } FUNC1_Set_b;
    } ;
  };
  
  union {
    union {
      __IM  uint32_t FUNC2;                     /*!< (@ 0x00000020) Pin16 - Pin23 Functions                                    */
      
      struct {
        __IM  uint32_t Func_Pin_16 : 4;         /*!< [3..0] Read SFUNC2 Register                                               */
        __IM  uint32_t Func_Pin_17 : 4;         /*!< [7..4] Read SFUNC2 Register                                               */
        __IM  uint32_t Func_Pin_18 : 4;         /*!< [11..8] Read SFUNC2 Register                                              */
        __IM  uint32_t Func_Pin_19 : 4;         /*!< [15..12] Read SFUNC2 Register                                             */
        __IM  uint32_t Func_Pin_20 : 4;         /*!< [19..16] Read SFUNC2 Register                                             */
        __IM  uint32_t Func_Pin_21 : 4;         /*!< [23..20] Read SFUNC2 Register                                             */
        __IM  uint32_t Func_Pin_22 : 4;         /*!< [27..24] Read SFUNC2 Register                                             */
        __IM  uint32_t Func_Pin_23 : 4;         /*!< [31..28] Read SFUNC2 Register                                             */
      } FUNC2_b;
    } ;
    
    union {
      __OM  uint32_t FUNC2_Set;                 /*!< (@ 0x00000020) Set FUNC2 bits                                             */
      
      struct {
        __OM  uint32_t Func_Pin_16 : 4;         /*!< [3..0] Read SFUNC2 Register                                               */
        __OM  uint32_t Func_Pin_17 : 4;         /*!< [7..4] Read SFUNC2 Register                                               */
        __OM  uint32_t Func_Pin_18 : 4;         /*!< [11..8] Read SFUNC2 Register                                              */
        __OM  uint32_t Func_Pin_19 : 4;         /*!< [15..12] Read SFUNC2 Register                                             */
        __OM  uint32_t Func_Pin_20 : 4;         /*!< [19..16] Read SFUNC2 Register                                             */
        __OM  uint32_t Func_Pin_21 : 4;         /*!< [23..20] Read SFUNC2 Register                                             */
        __OM  uint32_t Func_Pin_22 : 4;         /*!< [27..24] Read SFUNC2 Register                                             */
        __OM  uint32_t Func_Pin_23 : 4;         /*!< [31..28] Read SFUNC2 Register                                             */
      } FUNC2_Set_b;
    } ;
  };
  
  union {
    union {
      __IM  uint32_t FUNC3;                     /*!< (@ 0x00000024) Pin24 - Pin31 Functions                                    */
      
      struct {
        __IM  uint32_t Func_Pin_24 : 4;         /*!< [3..0] Read SFUNC3 Register                                               */
        __IM  uint32_t Func_Pin_25 : 4;         /*!< [7..4] Read SFUNC3 Register                                               */
        __IM  uint32_t Func_Pin_26 : 4;         /*!< [11..8] Read SFUNC3 Register                                              */
        __IM  uint32_t Func_Pin_27 : 4;         /*!< [15..12] Read SFUNC3 Register                                             */
        __IM  uint32_t Func_Pin_28 : 4;         /*!< [19..16] Read SFUNC3 Register                                             */
        __IM  uint32_t Func_Pin_29 : 4;         /*!< [23..20] Read SFUNC3 Register                                             */
        __IM  uint32_t Func_Pin_30 : 4;         /*!< [27..24] Read SFUNC3 Register                                             */
        __IM  uint32_t Func_Pin_31 : 4;         /*!< [31..28] Read SFUNC3 Register                                             */
      } FUNC3_b;
    } ;
    
    union {
      __OM  uint32_t FUNC3_Set;                 /*!< (@ 0x00000024) Set FUNC3 bits                                             */
      
