StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
      struct {
        __OM  uint32_t Func_Pin_24 : 4;         /*!< [3..0] Read SFUNC3 Register                                               */
        __OM  uint32_t Func_Pin_25 : 4;         /*!< [7..4] Read SFUNC3 Register                                               */
        __OM  uint32_t Func_Pin_26 : 4;         /*!< [11..8] Read SFUNC3 Register                                              */
        __OM  uint32_t Func_Pin_27 : 4;         /*!< [15..12] Read SFUNC3 Register                                             */
        __OM  uint32_t Func_Pin_28 : 4;         /*!< [19..16] Read SFUNC3 Register                                             */
        __OM  uint32_t Func_Pin_29 : 4;         /*!< [23..20] Read SFUNC3 Register                                             */
        __OM  uint32_t Func_Pin_30 : 4;         /*!< [27..24] Read SFUNC3 Register                                             */
        __OM  uint32_t Func_Pin_31 : 4;         /*!< [31..28] Read SFUNC3 Register                                             */
      } FUNC3_Set_b;
    } ;
  };
  
  union {
    __OM  uint32_t FUNC0_Clear;                 /*!< (@ 0x00000028) Clear FUNC0 bits                                           */
    
    struct {
      __OM  uint32_t Func_Pin_0 : 4;            /*!< [3..0] Clear FUNC0 bits                                                   */
      __OM  uint32_t Func_Pin_1 : 4;            /*!< [7..4] Clear FUNC0 bits                                                   */
      __OM  uint32_t Func_Pin_2 : 4;            /*!< [11..8] Clear FUNC0 bits                                                  */
      __OM  uint32_t Func_Pin_3 : 4;            /*!< [15..12] Clear FUNC0 bits                                                 */
      __OM  uint32_t Func_Pin_4 : 4;            /*!< [19..16] Clear FUNC0 bits                                                 */
      __OM  uint32_t Func_Pin_5 : 4;            /*!< [23..20] Clear FUNC0 bits                                                 */
      __OM  uint32_t Func_Pin_6 : 4;            /*!< [27..24] Clear FUNC0 bits                                                 */
      __OM  uint32_t Func_Pin_7 : 4;            /*!< [31..28] Clear FUNC0 bits                                                 */
    } FUNC0_Clear_b;
  } ;
  
  union {
    __OM  uint32_t FUNC1_Clear;                 /*!< (@ 0x0000002C) Clear FUNC1 bits                                           */
    
    struct {
      __OM  uint32_t Func_Pin_8 : 4;            /*!< [3..0] Clear FUNC1 bits                                                   */
      __OM  uint32_t Func_Pin_9 : 4;            /*!< [7..4] Clear FUNC1 bits                                                   */
      __OM  uint32_t Func_Pin_10 : 4;           /*!< [11..8] Clear FUNC1 bits                                                  */
      __OM  uint32_t Func_Pin_11 : 4;           /*!< [15..12] Clear FUNC1 bits                                                 */
      __OM  uint32_t Func_Pin_12 : 4;           /*!< [19..16] Clear FUNC1 bits                                                 */
      __OM  uint32_t Func_Pin_13 : 4;           /*!< [23..20] Clear FUNC1 bits                                                 */
      __OM  uint32_t Func_Pin_14 : 4;           /*!< [27..24] Clear FUNC1 bits                                                 */
      __OM  uint32_t Func_Pin_15 : 4;           /*!< [31..28] Clear FUNC1 bits                                                 */
    } FUNC1_Clear_b;
  } ;
  
  union {
    __OM  uint32_t FUNC2_Clear;                 /*!< (@ 0x00000030) Clear FUNC2 bits                                           */
    
    struct {
      __OM  uint32_t Func_Pin_16 : 4;           /*!< [3..0] Clear FUNC2 bits                                                   */
      __OM  uint32_t Func_Pin_17 : 4;           /*!< [7..4] Clear FUNC2 bits                                                   */
      __OM  uint32_t Func_Pin_18 : 4;           /*!< [11..8] Clear FUNC2 bits                                                  */
      __OM  uint32_t Func_Pin_19 : 4;           /*!< [15..12] Clear FUNC2 bits                                                 */
      __OM  uint32_t Func_Pin_20 : 4;           /*!< [19..16] Clear FUNC2 bits                                                 */
      __OM  uint32_t Func_Pin_21 : 4;           /*!< [23..20] Clear FUNC2 bits                                                 */
      __OM  uint32_t Func_Pin_22 : 4;           /*!< [27..24] Clear FUNC2 bits                                                 */
      __OM  uint32_t Func_Pin_23 : 4;           /*!< [31..28] Clear FUNC2 bits                                                 */
    } FUNC2_Clear_b;
  } ;
  
  union {
    __OM  uint32_t FUNC3_Clear;                 /*!< (@ 0x00000034) Clear FUNC3 bits                                           */
    
    struct {
      __OM  uint32_t Func_Pin_24 : 4;           /*!< [3..0] Clear FUNC3 bits                                                   */
      __OM  uint32_t Func_Pin_25 : 4;           /*!< [7..4] Clear FUNC3 bits                                                   */
      __OM  uint32_t Func_Pin_26 : 4;           /*!< [11..8] Clear FUNC3 bits                                                  */
      __OM  uint32_t Func_Pin_27 : 4;           /*!< [15..12] Clear FUNC3 bits                                                 */
      __OM  uint32_t Func_Pin_28 : 4;           /*!< [19..16] Clear FUNC3 bits                                                 */
      __OM  uint32_t Func_Pin_29 : 4;           /*!< [23..20] Clear FUNC3 bits                                                 */
      __OM  uint32_t Func_Pin_30 : 4;           /*!< [27..24] Clear FUNC3 bits                                                 */
      __OM  uint32_t Func_Pin_31 : 4;           /*!< [31..28] Clear FUNC3 bits                                                 */
    } FUNC3_Clear_b;
  } ;
  
  union {
    union {
      __IM  uint32_t ANALOG;                    /*!< (@ 0x00000038) Pins Digital Mode                                          */
      
