StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
      struct {
        __OM  uint32_t Pin_16   : 2;            /*!< [1..0] Read SPWR1 Register                                                */
        __OM  uint32_t Pin_17   : 2;            /*!< [3..2] Read SPWR1 Register                                                */
        __OM  uint32_t Pin_18   : 2;            /*!< [5..4] Read SPWR1 Register                                                */
        __OM  uint32_t Pin_19   : 2;            /*!< [7..6] Read SPWR1 Register                                                */
        __OM  uint32_t Pin_20   : 2;            /*!< [9..8] Read SPWR1 Register                                                */
        __OM  uint32_t Pin_21   : 2;            /*!< [11..10] Read SPWR1 Register                                              */
        __OM  uint32_t Pin_22   : 2;            /*!< [13..12] Read SPWR1 Register                                              */
        __OM  uint32_t Pin_23   : 2;            /*!< [15..14] Read SPWR1 Register                                              */
        __OM  uint32_t Pin_24   : 2;            /*!< [17..16] Read SPWR1 Register                                              */
        __OM  uint32_t Pin_25   : 2;            /*!< [19..18] Read SPWR1 Register                                              */
        __OM  uint32_t Pin_26   : 2;            /*!< [21..20] Read SPWR1 Register                                              */
        __OM  uint32_t Pin_27   : 2;            /*!< [23..22] Read SPWR1 Register                                              */
        __OM  uint32_t Pin_28   : 2;            /*!< [25..24] Read SPWR1 Register                                              */
        __OM  uint32_t Pin_29   : 2;            /*!< [27..26] Read SPWR1 Register                                              */
        __OM  uint32_t Pin_30   : 2;            /*!< [29..28] Read SPWR1 Register                                              */
        __OM  uint32_t Pin_31   : 2;            /*!< [31..30] Read SPWR1 Register                                              */
      } PWR1_Set_b;
    } ;
  };
  
  union {
    __OM  uint32_t PWR0_Clear;                  /*!< (@ 0x00000060) Clear PWR0 bits                                            */
    
    struct {
      __OM  uint32_t Pin_0      : 2;            /*!< [1..0] Clear PWR0 bits                                                    */
      __OM  uint32_t Pin_1      : 2;            /*!< [3..2] Clear PWR0 bits                                                    */
      __OM  uint32_t Pin_2      : 2;            /*!< [5..4] Clear PWR0 bits                                                    */
      __OM  uint32_t Pin_3      : 2;            /*!< [7..6] Clear PWR0 bits                                                    */
      __OM  uint32_t Pin_4      : 2;            /*!< [9..8] Clear PWR0 bits                                                    */
      __OM  uint32_t Pin_5      : 2;            /*!< [11..10] Clear PWR0 bits                                                  */
      __OM  uint32_t Pin_6      : 2;            /*!< [13..12] Clear PWR0 bits                                                  */
      __OM  uint32_t Pin_7      : 2;            /*!< [15..14] Clear PWR0 bits                                                  */
      __OM  uint32_t Pin_8      : 2;            /*!< [17..16] Clear PWR0 bits                                                  */
      __OM  uint32_t Pin_9      : 2;            /*!< [19..18] Clear PWR0 bits                                                  */
      __OM  uint32_t Pin_10     : 2;            /*!< [21..20] Clear PWR0 bits                                                  */
      __OM  uint32_t Pin_11     : 2;            /*!< [23..22] Clear PWR0 bits                                                  */
      __OM  uint32_t Pin_12     : 2;            /*!< [25..24] Clear PWR0 bits                                                  */
      __OM  uint32_t Pin_13     : 2;            /*!< [27..26] Clear PWR0 bits                                                  */
      __OM  uint32_t Pin_14     : 2;            /*!< [29..28] Clear PWR0 bits                                                  */
      __OM  uint32_t Pin_15     : 2;            /*!< [31..30] Clear PWR0 bits                                                  */
    } PWR0_Clear_b;
  } ;
  
  union {
    __OM  uint32_t PWR1_Clear;                  /*!< (@ 0x00000064) Clear PWR1 bits                                            */
    
    struct {
      __OM  uint32_t Pin_16     : 2;            /*!< [1..0] Clear PWR1 bits                                                    */
      __OM  uint32_t Pin_17     : 2;            /*!< [3..2] Clear PWR1 bits                                                    */
      __OM  uint32_t Pin_18     : 2;            /*!< [5..4] Clear PWR1 bits                                                    */
      __OM  uint32_t Pin_19     : 2;            /*!< [7..6] Clear PWR1 bits                                                    */
      __OM  uint32_t Pin_20     : 2;            /*!< [9..8] Clear PWR1 bits                                                    */
      __OM  uint32_t Pin_21     : 2;            /*!< [11..10] Clear PWR1 bits                                                  */
      __OM  uint32_t Pin_22     : 2;            /*!< [13..12] Clear PWR1 bits                                                  */
      __OM  uint32_t Pin_23     : 2;            /*!< [15..14] Clear PWR1 bits                                                  */
      __OM  uint32_t Pin_24     : 2;            /*!< [17..16] Clear PWR1 bits                                                  */
      __OM  uint32_t Pin_25     : 2;            /*!< [19..18] Clear PWR1 bits                                                  */
      __OM  uint32_t Pin_26     : 2;            /*!< [21..20] Clear PWR1 bits                                                  */
      __OM  uint32_t Pin_27     : 2;            /*!< [23..22] Clear PWR1 bits                                                  */
      __OM  uint32_t Pin_28     : 2;            /*!< [25..24] Clear PWR1 bits                                                  */
      __OM  uint32_t Pin_29     : 2;            /*!< [27..26] Clear PWR1 bits                                                  */
      __OM  uint32_t Pin_30     : 2;            /*!< [29..28] Clear PWR1 bits                                                  */
      __OM  uint32_t Pin_31     : 2;            /*!< [31..30] Clear PWR1 bits                                                  */
    } PWR1_Clear_b;
  } ;
  
  union {
    union {
      __IM  uint32_t CL;                        /*!< (@ 0x00000068) Pins Current Control enabled                               */
      
