StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
      struct {
        __IM  uint32_t Pin_0    : 1;            /*!< [0..0] Read register SCL                                                  */
        __IM  uint32_t Pin_1    : 1;            /*!< [1..1] Read register SCL                                                  */
        __IM  uint32_t Pin_2    : 1;            /*!< [2..2] Read register SCL                                                  */
        __IM  uint32_t Pin_3    : 1;            /*!< [3..3] Read register SCL                                                  */
        __IM  uint32_t Pin_4    : 1;            /*!< [4..4] Read register SCL                                                  */
        __IM  uint32_t Pin_5    : 1;            /*!< [5..5] Read register SCL                                                  */
        __IM  uint32_t Pin_6    : 1;            /*!< [6..6] Read register SCL                                                  */
        __IM  uint32_t Pin_7    : 1;            /*!< [7..7] Read register SCL                                                  */
        __IM  uint32_t Pin_8    : 1;            /*!< [8..8] Read register SCL                                                  */
        __IM  uint32_t Pin_9    : 1;            /*!< [9..9] Read register SCL                                                  */
        __IM  uint32_t Pin_10   : 1;            /*!< [10..10] Read register SCL                                                */
        __IM  uint32_t Pin_11   : 1;            /*!< [11..11] Read register SCL                                                */
        __IM  uint32_t Pin_12   : 1;            /*!< [12..12] Read register SCL                                                */
        __IM  uint32_t Pin_13   : 1;            /*!< [13..13] Read register SCL                                                */
        __IM  uint32_t Pin_14   : 1;            /*!< [14..14] Read register SCL                                                */
        __IM  uint32_t Pin_15   : 1;            /*!< [15..15] Read register SCL                                                */
        __IM  uint32_t Pin_16   : 1;            /*!< [16..16] Read register SCL                                                */
        __IM  uint32_t Pin_17   : 1;            /*!< [17..17] Read register SCL                                                */
        __IM  uint32_t Pin_18   : 1;            /*!< [18..18] Read register SCL                                                */
        __IM  uint32_t Pin_19   : 1;            /*!< [19..19] Read register SCL                                                */
        __IM  uint32_t Pin_20   : 1;            /*!< [20..20] Read register SCL                                                */
        __IM  uint32_t Pin_21   : 1;            /*!< [21..21] Read register SCL                                                */
        __IM  uint32_t Pin_22   : 1;            /*!< [22..22] Read register SCL                                                */
        __IM  uint32_t Pin_23   : 1;            /*!< [23..23] Read register SCL                                                */
        __IM  uint32_t Pin_24   : 1;            /*!< [24..24] Read register SCL                                                */
        __IM  uint32_t Pin_25   : 1;            /*!< [25..25] Read register SCL                                                */
        __IM  uint32_t Pin_26   : 1;            /*!< [26..26] Read register SCL                                                */
        __IM  uint32_t Pin_27   : 1;            /*!< [27..27] Read register SCL                                                */
        __IM  uint32_t Pin_28   : 1;            /*!< [28..28] Read register SCL                                                */
        __IM  uint32_t Pin_29   : 1;            /*!< [29..29] Read register SCL                                                */
        __IM  uint32_t Pin_30   : 1;            /*!< [30..30] Read register SCL                                                */
        __IM  uint32_t Pin_31   : 1;            /*!< [31..31] Read register SCL                                                */
      } CL_b;
    } ;
    
    union {
      __OM  uint32_t CL_Set;                    /*!< (@ 0x00000068) Set CL bits                                                */
      
      struct {
        __OM  uint32_t Pin_0    : 1;            /*!< [0..0] Set 1 to pin                                                       */
        __OM  uint32_t Pin_1    : 1;            /*!< [1..1] Set 1 to pin                                                       */
        __OM  uint32_t Pin_2    : 1;            /*!< [2..2] Set 1 to pin                                                       */
        __OM  uint32_t Pin_3    : 1;            /*!< [3..3] Set 1 to pin                                                       */
        __OM  uint32_t Pin_4    : 1;            /*!< [4..4] Set 1 to pin                                                       */
        __OM  uint32_t Pin_5    : 1;            /*!< [5..5] Set 1 to pin                                                       */
        __OM  uint32_t Pin_6    : 1;            /*!< [6..6] Set 1 to pin                                                       */
        __OM  uint32_t Pin_7    : 1;            /*!< [7..7] Set 1 to pin                                                       */
        __OM  uint32_t Pin_8    : 1;            /*!< [8..8] Set 1 to pin                                                       */
        __OM  uint32_t Pin_9    : 1;            /*!< [9..9] Set 1 to pin                                                       */
        __OM  uint32_t Pin_10   : 1;            /*!< [10..10] Set 1 to pin                                                     */
        __OM  uint32_t Pin_11   : 1;            /*!< [11..11] Set 1 to pin                                                     */
        __OM  uint32_t Pin_12   : 1;            /*!< [12..12] Set 1 to pin                                                     */
        __OM  uint32_t Pin_13   : 1;            /*!< [13..13] Set 1 to pin                                                     */
        __OM  uint32_t Pin_14   : 1;            /*!< [14..14] Set 1 to pin                                                     */
        __OM  uint32_t Pin_15   : 1;            /*!< [15..15] Set 1 to pin                                                     */
        __OM  uint32_t Pin_16   : 1;            /*!< [16..16] Set 1 to pin                                                     */
        __OM  uint32_t Pin_17   : 1;            /*!< [17..17] Set 1 to pin                                                     */
        __OM  uint32_t Pin_18   : 1;            /*!< [18..18] Set 1 to pin                                                     */
        __OM  uint32_t Pin_19   : 1;            /*!< [19..19] Set 1 to pin                                                     */
        __OM  uint32_t Pin_20   : 1;            /*!< [20..20] Set 1 to pin                                                     */
        __OM  uint32_t Pin_21   : 1;            /*!< [21..21] Set 1 to pin                                                     */
        __OM  uint32_t Pin_22   : 1;            /*!< [22..22] Set 1 to pin                                                     */
        __OM  uint32_t Pin_23   : 1;            /*!< [23..23] Set 1 to pin                                                     */
        __OM  uint32_t Pin_24   : 1;            /*!< [24..24] Set 1 to pin                                                     */
        __OM  uint32_t Pin_25   : 1;            /*!< [25..25] Set 1 to pin                                                     */
        __OM  uint32_t Pin_26   : 1;            /*!< [26..26] Set 1 to pin                                                     */
        __OM  uint32_t Pin_27   : 1;            /*!< [27..27] Set 1 to pin                                                     */
        __OM  uint32_t Pin_28   : 1;            /*!< [28..28] Set 1 to pin                                                     */
        __OM  uint32_t Pin_29   : 1;            /*!< [29..29] Set 1 to pin                                                     */
        __OM  uint32_t Pin_30   : 1;            /*!< [30..30] Set 1 to pin                                                     */
        __OM  uint32_t Pin_31   : 1;            /*!< [31..31] Set 1 to pin                                                     */
      } CL_Set_b;
    } ;
  };
  
  union {
    __OM  uint32_t CL_Clear;                    /*!< (@ 0x0000006C) Clear CL bits                                              */
    
