StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
    struct {
      __IOM uint32_t Pin_0      : 1;            /*!< [0..0] Register HCUR                                                      */
      __IOM uint32_t Pin_1      : 1;            /*!< [1..1] Register HCUR                                                      */
      __IOM uint32_t Pin_2      : 1;            /*!< [2..2] Register HCUR                                                      */
      __IOM uint32_t Pin_3      : 1;            /*!< [3..3] Register HCUR                                                      */
      __IOM uint32_t Pin_4      : 1;            /*!< [4..4] Register HCUR                                                      */
      __IOM uint32_t Pin_5      : 1;            /*!< [5..5] Register HCUR                                                      */
      __IOM uint32_t Pin_6      : 1;            /*!< [6..6] Register HCUR                                                      */
      __IOM uint32_t Pin_7      : 1;            /*!< [7..7] Register HCUR                                                      */
      __IOM uint32_t Pin_8      : 1;            /*!< [8..8] Register HCUR                                                      */
      __IOM uint32_t Pin_9      : 1;            /*!< [9..9] Register HCUR                                                      */
      __IOM uint32_t Pin_10     : 1;            /*!< [10..10] Register HCUR                                                    */
      __IOM uint32_t Pin_11     : 1;            /*!< [11..11] Register HCUR                                                    */
      __IOM uint32_t Pin_12     : 1;            /*!< [12..12] Register HCUR                                                    */
      __IOM uint32_t Pin_13     : 1;            /*!< [13..13] Register HCUR                                                    */
      __IOM uint32_t Pin_14     : 1;            /*!< [14..14] Register HCUR                                                    */
      __IOM uint32_t Pin_15     : 1;            /*!< [15..15] Register HCUR                                                    */
      __IOM uint32_t Pin_16     : 1;            /*!< [16..16] Register HCUR                                                    */
      __IOM uint32_t Pin_17     : 1;            /*!< [17..17] Register HCUR                                                    */
      __IOM uint32_t Pin_18     : 1;            /*!< [18..18] Register HCUR                                                    */
      __IOM uint32_t Pin_19     : 1;            /*!< [19..19] Register HCUR                                                    */
      __IOM uint32_t Pin_20     : 1;            /*!< [20..20] Register HCUR                                                    */
      __IOM uint32_t Pin_21     : 1;            /*!< [21..21] Register HCUR                                                    */
      __IOM uint32_t Pin_22     : 1;            /*!< [22..22] Register HCUR                                                    */
      __IOM uint32_t Pin_23     : 1;            /*!< [23..23] Register HCUR                                                    */
      __IOM uint32_t Pin_24     : 1;            /*!< [24..24] Register HCUR                                                    */
      __IOM uint32_t Pin_25     : 1;            /*!< [25..25] Register HCUR                                                    */
      __IOM uint32_t Pin_26     : 1;            /*!< [26..26] Register HCUR                                                    */
      __IOM uint32_t Pin_27     : 1;            /*!< [27..27] Register HCUR                                                    */
      __IOM uint32_t Pin_28     : 1;            /*!< [28..28] Register HCUR                                                    */
      __IOM uint32_t Pin_29     : 1;            /*!< [29..29] Register HCUR                                                    */
      __IOM uint32_t Pin_30     : 1;            /*!< [30..30] Register HCUR                                                    */
      __IOM uint32_t Pin_31     : 1;            /*!< [31..31] Register HCUR                                                    */
    } HCUR_b;
  } ;
} MDR_PORTA_Type;                               /*!< Size = 140 (0x8c)                                                         */



/* =========================================================================================================================== */
/* ================                                        MDR_TIMER1                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief TIMER Control (MDR_TIMER1)
  */

typedef struct {                                /*!< (@ 0x4008A000) MDR_TIMER1 Structure                                       */
  
  union {
    __IOM uint32_t CNT;                         /*!< (@ 0x00000000) Counter register                                           */
    
    struct {
      __IOM uint32_t Value      : 32;           /*!< [31..0] Counter Value                                                     */
    } CNT_b;
  } ;
  
  union {
    __IOM uint32_t PSG;                         /*!< (@ 0x00000004) Presample Gain                                             */
    
    struct {
      __IOM uint32_t Value      : 16;           /*!< [15..0] Inc CNT by PSG clocks of TIM_CLOCK                                */
    } PSG_b;
  } ;
  
  union {
    __IOM uint32_t ARR;                         /*!< (@ 0x00000008) Counter Period                                             */
    
    struct {
      __IOM uint32_t Value      : 32;           /*!< [31..0] Counter Value                                                     */
    } ARR_b;
  } ;
  
  union {
    __IOM uint32_t CNTRL;                       /*!< (@ 0x0000000C) Timer Control                                              */
    
    struct {
      __IOM uint32_t CNT_EN     : 1;            /*!< [0..0] Timer Enable                                                       */
      __IOM uint32_t ARRB_EN    : 1;            /*!< [1..1] ARR update mode                                                    */
      __IOM uint32_t WR_CMPL    : 1;            /*!< [2..2] Can write to CNT, ARR, PSG                                         */
      __IOM uint32_t DIR        : 1;            /*!< [3..3] Count Direction                                                    */
      __IOM uint32_t FDTS       : 2;            /*!< [5..4] Select Data Sampling frequency                                     */
      __IOM uint32_t CNT_MODE   : 2;            /*!< [7..6] Counting mode                                                      */
      __IOM uint32_t EVENT_SEL  : 4;            /*!< [11..8] Events for counting                                               */
    } CNTRL_b;
  } ;
  
  union {
    __IOM uint32_t CCR1;                        /*!< (@ 0x00000010) CNT Compare Register                                       */
    
