StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
    struct {
      __IOM uint32_t SelOE      : 2;            /*!< [1..0] Select Pin Output Enable                                           */
      __IOM uint32_t SelO       : 2;            /*!< [3..2] Select Output Signal                                               */
      __IOM uint32_t Inv        : 1;            /*!< [4..4] Invert Output Signal                                               */
      __IM  uint32_t            : 3;
      __IOM uint32_t NSelOE     : 2;            /*!< [9..8] Select Pin Output Enable                                           */
      __IOM uint32_t NSelO      : 2;            /*!< [11..10] Select Output Signal                                             */
      __IOM uint32_t NInv       : 1;            /*!< [12..12] Invert Output Signal                                             */
    } CH1_CNTRL1_b;
  } ;
  
  union {
    __IOM uint32_t CH2_CNTRL1;                  /*!< (@ 0x00000034) PWM Driver Control                                         */
    
    struct {
      __IOM uint32_t SelOE      : 2;            /*!< [1..0] Select Pin Output Enable                                           */
      __IOM uint32_t SelO       : 2;            /*!< [3..2] Select Output Signal                                               */
      __IOM uint32_t Inv        : 1;            /*!< [4..4] Invert Output Signal                                               */
      __IM  uint32_t            : 3;
      __IOM uint32_t NSelOE     : 2;            /*!< [9..8] Select Pin Output Enable                                           */
      __IOM uint32_t NSelO      : 2;            /*!< [11..10] Select Output Signal                                             */
      __IOM uint32_t NInv       : 1;            /*!< [12..12] Invert Output Signal                                             */
    } CH2_CNTRL1_b;
  } ;
  
  union {
    __IOM uint32_t CH3_CNTRL1;                  /*!< (@ 0x00000038) PWM Driver Control                                         */
    
    struct {
      __IOM uint32_t SelOE      : 2;            /*!< [1..0] Select Pin Output Enable                                           */
      __IOM uint32_t SelO       : 2;            /*!< [3..2] Select Output Signal                                               */
      __IOM uint32_t Inv        : 1;            /*!< [4..4] Invert Output Signal                                               */
      __IM  uint32_t            : 3;
      __IOM uint32_t NSelOE     : 2;            /*!< [9..8] Select Pin Output Enable                                           */
      __IOM uint32_t NSelO      : 2;            /*!< [11..10] Select Output Signal                                             */
      __IOM uint32_t NInv       : 1;            /*!< [12..12] Invert Output Signal                                             */
    } CH3_CNTRL1_b;
  } ;
  
  union {
    __IOM uint32_t CH4_CNTRL1;                  /*!< (@ 0x0000003C) PWM Driver Control                                         */
    
    struct {
      __IOM uint32_t SelOE      : 2;            /*!< [1..0] Select Pin Output Enable                                           */
      __IOM uint32_t SelO       : 2;            /*!< [3..2] Select Output Signal                                               */
      __IOM uint32_t Inv        : 1;            /*!< [4..4] Invert Output Signal                                               */
      __IM  uint32_t            : 3;
      __IOM uint32_t NSelOE     : 2;            /*!< [9..8] Select Pin Output Enable                                           */
      __IOM uint32_t NSelO      : 2;            /*!< [11..10] Select Output Signal                                             */
      __IOM uint32_t NInv       : 1;            /*!< [12..12] Invert Output Signal                                             */
    } CH4_CNTRL1_b;
  } ;
  
  union {
    __IOM uint32_t CH1_DTG;                     /*!< (@ 0x00000040) Dead Time Generator                                        */
    
    struct {
      __IOM uint32_t DTG        : 4;            /*!< [3..0] DTG Prescaller                                                     */
      __IOM uint32_t EDTS       : 1;            /*!< [4..4] DTG Clock Select                                                   */
      __IM  uint32_t            : 3;
      __IOM uint32_t DTGx       : 8;            /*!< [15..8] DTGx scale, Delay = DTGx*(DTG + 1)                                */
    } CH1_DTG_b;
  } ;
  
  union {
    __IOM uint32_t CH2_DTG;                     /*!< (@ 0x00000044) Dead Time Generator                                        */
    
    struct {
      __IOM uint32_t DTG        : 4;            /*!< [3..0] DTG Prescaller                                                     */
      __IOM uint32_t EDTS       : 1;            /*!< [4..4] DTG Clock Select                                                   */
      __IM  uint32_t            : 3;
      __IOM uint32_t DTGx       : 8;            /*!< [15..8] DTGx scale, Delay = DTGx*(DTG + 1)                                */
    } CH2_DTG_b;
  } ;
  
  union {
    __IOM uint32_t CH3_DTG;                     /*!< (@ 0x00000048) Dead Time Generator                                        */
    
    struct {
      __IOM uint32_t DTG        : 4;            /*!< [3..0] DTG Prescaller                                                     */
      __IOM uint32_t EDTS       : 1;            /*!< [4..4] DTG Clock Select                                                   */
      __IM  uint32_t            : 3;
      __IOM uint32_t DTGx       : 8;            /*!< [15..8] DTGx scale, Delay = DTGx*(DTG + 1)                                */
    } CH3_DTG_b;
  } ;
  
  union {
    __IOM uint32_t CH4_DTG;                     /*!< (@ 0x0000004C) Dead Time Generator                                        */
    
    struct {
      __IOM uint32_t DTG        : 4;            /*!< [3..0] DTG Prescaller                                                     */
      __IOM uint32_t EDTS       : 1;            /*!< [4..4] DTG Clock Select                                                   */
      __IM  uint32_t            : 3;
      __IOM uint32_t DTGx       : 8;            /*!< [15..8] DTGx scale, Delay = DTGx*(DTG + 1)                                */
    } CH4_DTG_b;
  } ;
  
  union {
    __IOM uint32_t BRKETR_CNTRL;                /*!< (@ 0x00000050) Break and External Count Control                           */
    
