StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
    struct {
      __IOM uint32_t RXDMAE     : 1;            /*!< [0..0] RX DMA Enable                                                      */
      __IOM uint32_t TXDMAE     : 1;            /*!< [1..1] TX DMA Enable                                                      */
      __IOM uint32_t DMAonErr   : 1;            /*!< [2..2] Disable DMA req on Error                                           */
    } DMACR_b;
  } ;
  __IM  uint32_t  RESERVED2[13];
  
  union {
    __IOM uint32_t TCR;                         /*!< (@ 0x00000080) Test Control Register                                      */
    
    struct {
      __IOM uint32_t ITEN       : 1;            /*!< [0..0] Test Mode Enable                                                   */
      __IOM uint32_t TestFIFO   : 1;            /*!< [1..1] FIFO test mode                                                     */
      __IOM uint32_t SIRTest    : 1;            /*!< [2..2] IrDA test mode                                                     */
    } TCR_b;
  } ;
} MDR_UART1_Type;                               /*!< Size = 132 (0x84)                                                         */



/* =========================================================================================================================== */
/* ================                                          MDR_DMA                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief DMA Controler (MDR_DMA)
  */

typedef struct {                                /*!< (@ 0xE0042000) MDR_DMA Structure                                          */
  
  union {
    __IM  uint32_t STATUS;                      /*!< (@ 0x00000000) Status register                                            */
    
    struct {
      __IM  uint32_t Enable     : 1;            /*!< [0..0] Enable block                                                       */
      __IM  uint32_t            : 3;
      __IM  uint32_t State      : 4;            /*!< [7..4] Active Operation                                                   */
      __IM  uint32_t            : 8;
      __IM  uint32_t Chnls_minus1 : 5;          /*!< [20..16] Channels count                                                   */
      __IM  uint32_t            : 7;
      __IM  uint32_t test_status : 1;           /*!< [28..28] Test logic availability                                          */
    } STATUS_b;
  } ;
  
  union {
    __OM  uint32_t CFG;                         /*!< (@ 0x00000004) Config register                                            */
    
    struct {
      __OM  uint32_t Enable     : 1;            /*!< [0..0] Enable block                                                       */
      __IM  uint32_t            : 4;
      __OM  uint32_t Privileged : 1;            /*!< [5..5] Privileged AHB bus priority                                        */
      __OM  uint32_t Bufferable : 1;            /*!< [6..6] Bufferable AHB bus priority                                        */
      __OM  uint32_t Cachable   : 1;            /*!< [7..7] Cachable AHB bus priority                                          */
    } CFG_b;
  } ;
  
  union {
    __IOM uint32_t CTRL_BASE_PTR;               /*!< (@ 0x00000008) Channel control data base pointer                          */
    
    struct {
      __IM  uint32_t            : 10;
      __IOM uint32_t Addr_Hi    : 22;           /*!< [31..10] Pointer                                                          */
    } CTRL_BASE_PTR_b;
  } ;
  
  union {
    __IM  uint32_t ALT_CTRL_BASE_PTR;           /*!< (@ 0x0000000C) Channel alternate control data base pointer                */
    
    struct {
      __IM  uint32_t Addr       : 32;           /*!< [31..0] Pointer                                                           */
    } ALT_CTRL_BASE_PTR_b;
  } ;
  
  union {
    __IM  uint32_t WAITONREQ_STATUS;            /*!< (@ 0x00000010) Channel wait on request status                             */
    
    struct {
      __IM  uint32_t Ch_0       : 1;            /*!< [0..0] Channel Select                                                     */
      __IM  uint32_t Ch_1       : 1;            /*!< [1..1] Channel Select                                                     */
      __IM  uint32_t Ch_2       : 1;            /*!< [2..2] Channel Select                                                     */
      __IM  uint32_t Ch_3       : 1;            /*!< [3..3] Channel Select                                                     */
      __IM  uint32_t Ch_4       : 1;            /*!< [4..4] Channel Select                                                     */
      __IM  uint32_t Ch_5       : 1;            /*!< [5..5] Channel Select                                                     */
      __IM  uint32_t Ch_6       : 1;            /*!< [6..6] Channel Select                                                     */
      __IM  uint32_t Ch_7       : 1;            /*!< [7..7] Channel Select                                                     */
      __IM  uint32_t Ch_8       : 1;            /*!< [8..8] Channel Select                                                     */
      __IM  uint32_t Ch_9       : 1;            /*!< [9..9] Channel Select                                                     */
      __IM  uint32_t Ch_10      : 1;            /*!< [10..10] Channel Select                                                   */
      __IM  uint32_t Ch_11      : 1;            /*!< [11..11] Channel Select                                                   */
      __IM  uint32_t Ch_12      : 1;            /*!< [12..12] Channel Select                                                   */
      __IM  uint32_t Ch_13      : 1;            /*!< [13..13] Channel Select                                                   */
      __IM  uint32_t Ch_14      : 1;            /*!< [14..14] Channel Select                                                   */
      __IM  uint32_t Ch_15      : 1;            /*!< [15..15] Channel Select                                                   */
      __IM  uint32_t Ch_16      : 1;            /*!< [16..16] Channel Select                                                   */
      __IM  uint32_t Ch_17      : 1;            /*!< [17..17] Channel Select                                                   */
      __IM  uint32_t Ch_18      : 1;            /*!< [18..18] Channel Select                                                   */
      __IM  uint32_t Ch_19      : 1;            /*!< [19..19] Channel Select                                                   */
      __IM  uint32_t Ch_20      : 1;            /*!< [20..20] Channel Select                                                   */
      __IM  uint32_t Ch_21      : 1;            /*!< [21..21] Channel Select                                                   */
      __IM  uint32_t Ch_22      : 1;            /*!< [22..22] Channel Select                                                   */
      __IM  uint32_t Ch_23      : 1;            /*!< [23..23] Channel Select                                                   */
      __IM  uint32_t Ch_24      : 1;            /*!< [24..24] Channel Select                                                   */
      __IM  uint32_t Ch_25      : 1;            /*!< [25..25] Channel Select                                                   */
      __IM  uint32_t Ch_26      : 1;            /*!< [26..26] Channel Select                                                   */
      __IM  uint32_t Ch_27      : 1;            /*!< [27..27] Channel Select                                                   */
      __IM  uint32_t Ch_28      : 1;            /*!< [28..28] Channel Select                                                   */
      __IM  uint32_t Ch_29      : 1;            /*!< [29..29] Channel Select                                                   */
      __IM  uint32_t Ch_30      : 1;            /*!< [30..30] Channel Select                                                   */
      __IM  uint32_t Ch_31      : 1;            /*!< [31..31] Channel Select                                                   */
    } WAITONREQ_STATUS_b;
  } ;
  
  union {
    __OM  uint32_t CHNL_SW_REQUEST;             /*!< (@ 0x00000014) Channel Software Request                                   */
    
