StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
    struct {
      __OM  uint32_t Ch_0       : 1;            /*!< [0..0] Channel Select                                                     */
      __OM  uint32_t Ch_1       : 1;            /*!< [1..1] Channel Select                                                     */
      __OM  uint32_t Ch_2       : 1;            /*!< [2..2] Channel Select                                                     */
      __OM  uint32_t Ch_3       : 1;            /*!< [3..3] Channel Select                                                     */
      __OM  uint32_t Ch_4       : 1;            /*!< [4..4] Channel Select                                                     */
      __OM  uint32_t Ch_5       : 1;            /*!< [5..5] Channel Select                                                     */
      __OM  uint32_t Ch_6       : 1;            /*!< [6..6] Channel Select                                                     */
      __OM  uint32_t Ch_7       : 1;            /*!< [7..7] Channel Select                                                     */
      __OM  uint32_t Ch_8       : 1;            /*!< [8..8] Channel Select                                                     */
      __OM  uint32_t Ch_9       : 1;            /*!< [9..9] Channel Select                                                     */
      __OM  uint32_t Ch_10      : 1;            /*!< [10..10] Channel Select                                                   */
      __OM  uint32_t Ch_11      : 1;            /*!< [11..11] Channel Select                                                   */
      __OM  uint32_t Ch_12      : 1;            /*!< [12..12] Channel Select                                                   */
      __OM  uint32_t Ch_13      : 1;            /*!< [13..13] Channel Select                                                   */
      __OM  uint32_t Ch_14      : 1;            /*!< [14..14] Channel Select                                                   */
      __OM  uint32_t Ch_15      : 1;            /*!< [15..15] Channel Select                                                   */
      __OM  uint32_t Ch_16      : 1;            /*!< [16..16] Channel Select                                                   */
      __OM  uint32_t Ch_17      : 1;            /*!< [17..17] Channel Select                                                   */
      __OM  uint32_t Ch_18      : 1;            /*!< [18..18] Channel Select                                                   */
      __OM  uint32_t Ch_19      : 1;            /*!< [19..19] Channel Select                                                   */
      __OM  uint32_t Ch_20      : 1;            /*!< [20..20] Channel Select                                                   */
      __OM  uint32_t Ch_21      : 1;            /*!< [21..21] Channel Select                                                   */
      __OM  uint32_t Ch_22      : 1;            /*!< [22..22] Channel Select                                                   */
      __OM  uint32_t Ch_23      : 1;            /*!< [23..23] Channel Select                                                   */
      __OM  uint32_t Ch_24      : 1;            /*!< [24..24] Channel Select                                                   */
      __OM  uint32_t Ch_25      : 1;            /*!< [25..25] Channel Select                                                   */
      __OM  uint32_t Ch_26      : 1;            /*!< [26..26] Channel Select                                                   */
      __OM  uint32_t Ch_27      : 1;            /*!< [27..27] Channel Select                                                   */
      __OM  uint32_t Ch_28      : 1;            /*!< [28..28] Channel Select                                                   */
      __OM  uint32_t Ch_29      : 1;            /*!< [29..29] Channel Select                                                   */
      __OM  uint32_t Ch_30      : 1;            /*!< [30..30] Channel Select                                                   */
      __OM  uint32_t Ch_31      : 1;            /*!< [31..31] Channel Select                                                   */
    } CHNL_REQ_MASK_CLR_b;
  } ;
  
  union {
    __IOM uint32_t CHNL_ENABLE_SET;             /*!< (@ 0x00000028) Start Channel                                              */
    
    struct {
      __IOM uint32_t Ch_0       : 1;            /*!< [0..0] Channel Select                                                     */
      __IOM uint32_t Ch_1       : 1;            /*!< [1..1] Channel Select                                                     */
      __IOM uint32_t Ch_2       : 1;            /*!< [2..2] Channel Select                                                     */
      __IOM uint32_t Ch_3       : 1;            /*!< [3..3] Channel Select                                                     */
      __IOM uint32_t Ch_4       : 1;            /*!< [4..4] Channel Select                                                     */
      __IOM uint32_t Ch_5       : 1;            /*!< [5..5] Channel Select                                                     */
      __IOM uint32_t Ch_6       : 1;            /*!< [6..6] Channel Select                                                     */
      __IOM uint32_t Ch_7       : 1;            /*!< [7..7] Channel Select                                                     */
      __IOM uint32_t Ch_8       : 1;            /*!< [8..8] Channel Select                                                     */
      __IOM uint32_t Ch_9       : 1;            /*!< [9..9] Channel Select                                                     */
      __IOM uint32_t Ch_10      : 1;            /*!< [10..10] Channel Select                                                   */
      __IOM uint32_t Ch_11      : 1;            /*!< [11..11] Channel Select                                                   */
      __IOM uint32_t Ch_12      : 1;            /*!< [12..12] Channel Select                                                   */
      __IOM uint32_t Ch_13      : 1;            /*!< [13..13] Channel Select                                                   */
      __IOM uint32_t Ch_14      : 1;            /*!< [14..14] Channel Select                                                   */
      __IOM uint32_t Ch_15      : 1;            /*!< [15..15] Channel Select                                                   */
      __IOM uint32_t Ch_16      : 1;            /*!< [16..16] Channel Select                                                   */
      __IOM uint32_t Ch_17      : 1;            /*!< [17..17] Channel Select                                                   */
      __IOM uint32_t Ch_18      : 1;            /*!< [18..18] Channel Select                                                   */
      __IOM uint32_t Ch_19      : 1;            /*!< [19..19] Channel Select                                                   */
      __IOM uint32_t Ch_20      : 1;            /*!< [20..20] Channel Select                                                   */
      __IOM uint32_t Ch_21      : 1;            /*!< [21..21] Channel Select                                                   */
      __IOM uint32_t Ch_22      : 1;            /*!< [22..22] Channel Select                                                   */
      __IOM uint32_t Ch_23      : 1;            /*!< [23..23] Channel Select                                                   */
      __IOM uint32_t Ch_24      : 1;            /*!< [24..24] Channel Select                                                   */
      __IOM uint32_t Ch_25      : 1;            /*!< [25..25] Channel Select                                                   */
      __IOM uint32_t Ch_26      : 1;            /*!< [26..26] Channel Select                                                   */
      __IOM uint32_t Ch_27      : 1;            /*!< [27..27] Channel Select                                                   */
      __IOM uint32_t Ch_28      : 1;            /*!< [28..28] Channel Select                                                   */
      __IOM uint32_t Ch_29      : 1;            /*!< [29..29] Channel Select                                                   */
      __IOM uint32_t Ch_30      : 1;            /*!< [30..30] Channel Select                                                   */
      __IOM uint32_t Ch_31      : 1;            /*!< [31..31] Channel Select                                                   */
    } CHNL_ENABLE_SET_b;
  } ;
  
  union {
    __OM  uint32_t CHNL_ENABLE_CLR;             /*!< (@ 0x0000002C) Stop Channel                                               */
    
