StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
    struct {
      __IOM uint32_t CH0_Sel    : 8;            /*!< [7..0] Periph Event for DMA_Channel                                       */
      __IOM uint32_t CH1_Sel    : 8;            /*!< [15..8] Periph Event for DMA_Channel                                      */
      __IOM uint32_t CH2_Sel    : 8;            /*!< [23..16] Periph Event for DMA_Channel                                     */
      __IOM uint32_t CH3_Sel    : 8;            /*!< [31..24] Periph Event for DMA_Channel                                     */
    } CHMUX0_b;
  } ;
  
  union {
    __IOM uint32_t CHMUX1;                      /*!< (@ 0x00000054) Periph select for DMA channels 4..7                        */
    
    struct {
      __IOM uint32_t CH4_Sel    : 8;            /*!< [7..0] Periph Event for DMA_Channel                                       */
      __IOM uint32_t CH5_Sel    : 8;            /*!< [15..8] Periph Event for DMA_Channel                                      */
      __IOM uint32_t CH6_Sel    : 8;            /*!< [23..16] Periph Event for DMA_Channel                                     */
      __IOM uint32_t CH7_Sel    : 8;            /*!< [31..24] Periph Event for DMA_Channel                                     */
    } CHMUX1_b;
  } ;
  
  union {
    __IOM uint32_t CHMUX2;                      /*!< (@ 0x00000058) Periph select for DMA channels 8..11                       */
    
    struct {
      __IOM uint32_t CH8_Sel    : 8;            /*!< [7..0] Periph Event for DMA_Channel                                       */
      __IOM uint32_t CH9_Sel    : 8;            /*!< [15..8] Periph Event for DMA_Channel                                      */
      __IOM uint32_t CH10_Sel   : 8;            /*!< [23..16] Periph Event for DMA_Channel                                     */
      __IOM uint32_t CH11_Sel   : 8;            /*!< [31..24] Periph Event for DMA_Channel                                     */
    } CHMUX2_b;
  } ;
  
  union {
    __IOM uint32_t CHMUX3;                      /*!< (@ 0x0000005C) Periph select for DMA channels 12..15                      */
    
    struct {
      __IOM uint32_t CH12_Sel   : 8;            /*!< [7..0] Periph Event for DMA_Channel                                       */
      __IOM uint32_t CH13_Sel   : 8;            /*!< [15..8] Periph Event for DMA_Channel                                      */
      __IOM uint32_t CH14_Sel   : 8;            /*!< [23..16] Periph Event for DMA_Channel                                     */
      __IOM uint32_t CH15_Sel   : 8;            /*!< [31..24] Periph Event for DMA_Channel                                     */
    } CHMUX3_b;
  } ;
  
  union {
    __IOM uint32_t CHMUX4;                      /*!< (@ 0x00000060) Periph select for DMA channels 16..19                      */
    
    struct {
      __IOM uint32_t CH16_Sel   : 8;            /*!< [7..0] Periph Event for DMA_Channel                                       */
      __IOM uint32_t CH17_Sel   : 8;            /*!< [15..8] Periph Event for DMA_Channel                                      */
      __IOM uint32_t CH18_Sel   : 8;            /*!< [23..16] Periph Event for DMA_Channel                                     */
      __IOM uint32_t CH19_Sel   : 8;            /*!< [31..24] Periph Event for DMA_Channel                                     */
    } CHMUX4_b;
  } ;
  
  union {
    __IOM uint32_t CHMUX5;                      /*!< (@ 0x00000064) Periph select for DMA channels 20..23                      */
    
    struct {
      __IOM uint32_t CH20_Sel   : 8;            /*!< [7..0] Periph Event for DMA_Channel                                       */
      __IOM uint32_t CH21_Sel   : 8;            /*!< [15..8] Periph Event for DMA_Channel                                      */
      __IOM uint32_t CH22_Sel   : 8;            /*!< [23..16] Periph Event for DMA_Channel                                     */
      __IOM uint32_t CH23_Sel   : 8;            /*!< [31..24] Periph Event for DMA_Channel                                     */
    } CHMUX5_b;
  } ;
  
  union {
    __IOM uint32_t CHMUX6;                      /*!< (@ 0x00000068) Periph select for DMA channels 24..27                      */
    
    struct {
      __IOM uint32_t CH24_Sel   : 8;            /*!< [7..0] Periph Event for DMA_Channel                                       */
      __IOM uint32_t CH25_Sel   : 8;            /*!< [15..8] Periph Event for DMA_Channel                                      */
      __IOM uint32_t CH26_Sel   : 8;            /*!< [23..16] Periph Event for DMA_Channel                                     */
      __IOM uint32_t CH27_Sel   : 8;            /*!< [31..24] Periph Event for DMA_Channel                                     */
    } CHMUX6_b;
  } ;
  
  union {
    __IOM uint32_t CHMUX7;                      /*!< (@ 0x0000006C) Periph select for DMA channels 28..31                      */
    
    struct {
      __IOM uint32_t CH28_Sel   : 8;            /*!< [7..0] Periph Event for DMA_Channel                                       */
      __IOM uint32_t CH29_Sel   : 8;            /*!< [15..8] Periph Event for DMA_Channel                                      */
      __IOM uint32_t CH30_Sel   : 8;            /*!< [23..16] Periph Event for DMA_Channel                                     */
      __IOM uint32_t CH31_Sel   : 8;            /*!< [31..24] Periph Event for DMA_Channel                                     */
    } CHMUX7_b;
  } ;
} MDR_DMA_Type;                                 /*!< Size = 112 (0x70)                                                         */


/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


