StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

#define MDR_RST_CLOCK_BASE          0x40000000UL
#define MDR_BKP_BASE                0x40001000UL
#define MDR_SRAM_BASE               0x40006000UL
#define MDR_PORTA_BASE              0x40080000UL
#define MDR_PORTB_BASE              0x40081000UL
#define MDR_PORTC_BASE              0x40082000UL
#define MDR_PORTD_BASE              0x40083000UL
#define MDR_PORTE_BASE              0x40084000UL
#define MDR_TIMER1_BASE             0x4008A000UL
#define MDR_TIMER2_BASE             0x4008B000UL
#define MDR_TIMER3_BASE             0x4008C000UL
#define MDR_TIMER4_BASE             0x4008D000UL
#define MDR_SSP1_BASE               0x40095000UL
#define MDR_UART1_BASE              0x40099000UL
#define MDR_UART2_BASE              0x4009A000UL
#define MDR_DMA_BASE                0xE0042000UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

#define MDR_RST_CLOCK               ((MDR_RST_CLOCK_Type*)     MDR_RST_CLOCK_BASE)
#define MDR_BKP                     ((MDR_BKP_Type*)           MDR_BKP_BASE)
#define MDR_SRAM                    ((MDR_SRAM_Type*)          MDR_SRAM_BASE)
#define MDR_PORTA                   ((MDR_PORTA_Type*)         MDR_PORTA_BASE)
#define MDR_PORTB                   ((MDR_PORTA_Type*)         MDR_PORTB_BASE)
#define MDR_PORTC                   ((MDR_PORTA_Type*)         MDR_PORTC_BASE)
#define MDR_PORTD                   ((MDR_PORTA_Type*)         MDR_PORTD_BASE)
#define MDR_PORTE                   ((MDR_PORTA_Type*)         MDR_PORTE_BASE)
#define MDR_TIMER1                  ((MDR_TIMER1_Type*)        MDR_TIMER1_BASE)
#define MDR_TIMER2                  ((MDR_TIMER1_Type*)        MDR_TIMER2_BASE)
#define MDR_TIMER3                  ((MDR_TIMER1_Type*)        MDR_TIMER3_BASE)
#define MDR_TIMER4                  ((MDR_TIMER1_Type*)        MDR_TIMER4_BASE)
#define MDR_SSP1                    ((MDR_SSP1_Type*)          MDR_SSP1_BASE)
#define MDR_UART1                   ((MDR_UART1_Type*)         MDR_UART1_BASE)
#define MDR_UART2                   ((MDR_UART1_Type*)         MDR_UART2_BASE)
#define MDR_DMA                     ((MDR_DMA_Type*)           MDR_DMA_BASE)

/** @} */ /* End of group Device_Peripheral_declaration */


/* =========================================  End of section using anonymous unions  ========================================= */
#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif


/* =========================================================================================================================== */
/* ================                                Pos/Mask Peripheral Section                                ================ */
/* =========================================================================================================================== */


/** @addtogroup PosMask_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                       MDR_RST_CLOCK                                       ================ */
/* =========================================================================================================================== */

/* ==========================================================  KEY  ========================================================== */
#define MDR_RST_CLOCK_KEY_Value_Pos       (0UL)                     /*!< MDR_RST_CLOCK KEY: Value (Bit 0)                      */
#define MDR_RST_CLOCK_KEY_Value_Msk       (0xffffffffUL)            /*!< MDR_RST_CLOCK KEY: Value (Bitfield-Mask: 0xffffffff)  */
/* ========================================================  MAX_CLK  ======================================================== */
#define MDR_RST_CLOCK_MAX_CLK_Select_Pos  (0UL)                     /*!< MDR_RST_CLOCK MAX_CLK: Select (Bit 0)                 */
#define MDR_RST_CLOCK_MAX_CLK_Select_Msk  (0xfUL)                   /*!< MDR_RST_CLOCK MAX_CLK: Select (Bitfield-Mask: 0x0f)   */
/* ========================================================  CPU_CLK  ======================================================== */
#define MDR_RST_CLOCK_CPU_CLK_DIV_Pos     (0UL)                     /*!< MDR_RST_CLOCK CPU_CLK: DIV (Bit 0)                    */
#define MDR_RST_CLOCK_CPU_CLK_DIV_Msk     (0xffffUL)                /*!< MDR_RST_CLOCK CPU_CLK: DIV (Bitfield-Mask: 0xffff)    */
#define MDR_RST_CLOCK_CPU_CLK_EN_CHK_EVENT0_Pos (16UL)              /*!< MDR_RST_CLOCK CPU_CLK: EN_CHK_EVENT0 (Bit 16)         */
#define MDR_RST_CLOCK_CPU_CLK_EN_CHK_EVENT0_Msk (0x10000UL)         /*!< MDR_RST_CLOCK CPU_CLK: EN_CHK_EVENT0 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_CPU_CLK_EN_CHK_EVENT1_Pos (17UL)              /*!< MDR_RST_CLOCK CPU_CLK: EN_CHK_EVENT1 (Bit 17)         */
#define MDR_RST_CLOCK_CPU_CLK_EN_CHK_EVENT1_Msk (0x20000UL)         /*!< MDR_RST_CLOCK CPU_CLK: EN_CHK_EVENT1 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_CPU_CLK_EN_CHK_EVENT2_Pos (18UL)              /*!< MDR_RST_CLOCK CPU_CLK: EN_CHK_EVENT2 (Bit 18)         */
#define MDR_RST_CLOCK_CPU_CLK_EN_CHK_EVENT2_Msk (0x40000UL)         /*!< MDR_RST_CLOCK CPU_CLK: EN_CHK_EVENT2 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_CPU_CLK_EN_CHK_EVENT3_Pos (19UL)              /*!< MDR_RST_CLOCK CPU_CLK: EN_CHK_EVENT3 (Bit 19)         */
#define MDR_RST_CLOCK_CPU_CLK_EN_CHK_EVENT3_Msk (0x80000UL)         /*!< MDR_RST_CLOCK CPU_CLK: EN_CHK_EVENT3 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_CPU_CLK_EN_CHK_Pos  (20UL)                    /*!< MDR_RST_CLOCK CPU_CLK: EN_CHK (Bit 20)                */
#define MDR_RST_CLOCK_CPU_CLK_EN_CHK_Msk  (0x100000UL)              /*!< MDR_RST_CLOCK CPU_CLK: EN_CHK (Bitfield-Mask: 0x01)   */
#define MDR_RST_CLOCK_CPU_CLK_CLR_CHK_SHIFT_REG0_Pos (21UL)         /*!< MDR_RST_CLOCK CPU_CLK: CLR_CHK_SHIFT_REG0 (Bit 21)    */
#define MDR_RST_CLOCK_CPU_CLK_CLR_CHK_SHIFT_REG0_Msk (0x200000UL)   /*!< MDR_RST_CLOCK CPU_CLK: CLR_CHK_SHIFT_REG0 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_CPU_CLK_CLR_CHK_SHIFT_REG1_Pos (22UL)         /*!< MDR_RST_CLOCK CPU_CLK: CLR_CHK_SHIFT_REG1 (Bit 22)    */
#define MDR_RST_CLOCK_CPU_CLK_CLR_CHK_SHIFT_REG1_Msk (0x400000UL)   /*!< MDR_RST_CLOCK CPU_CLK: CLR_CHK_SHIFT_REG1 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_CPU_CLK_CLR_CHK_EVENT0_Pos (23UL)             /*!< MDR_RST_CLOCK CPU_CLK: CLR_CHK_EVENT0 (Bit 23)        */
#define MDR_RST_CLOCK_CPU_CLK_CLR_CHK_EVENT0_Msk (0x800000UL)       /*!< MDR_RST_CLOCK CPU_CLK: CLR_CHK_EVENT0 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_CPU_CLK_CLR_CHK_EVENT1_Pos (24UL)             /*!< MDR_RST_CLOCK CPU_CLK: CLR_CHK_EVENT1 (Bit 24)        */
#define MDR_RST_CLOCK_CPU_CLK_CLR_CHK_EVENT1_Msk (0x1000000UL)      /*!< MDR_RST_CLOCK CPU_CLK: CLR_CHK_EVENT1 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_CPU_CLK_CLR_CHK_EVENT2_Pos (25UL)             /*!< MDR_RST_CLOCK CPU_CLK: CLR_CHK_EVENT2 (Bit 25)        */
#define MDR_RST_CLOCK_CPU_CLK_CLR_CHK_EVENT2_Msk (0x2000000UL)      /*!< MDR_RST_CLOCK CPU_CLK: CLR_CHK_EVENT2 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_CPU_CLK_CLR_CHK_EVENT3_Pos (26UL)             /*!< MDR_RST_CLOCK CPU_CLK: CLR_CHK_EVENT3 (Bit 26)        */
#define MDR_RST_CLOCK_CPU_CLK_CLR_CHK_EVENT3_Msk (0x4000000UL)      /*!< MDR_RST_CLOCK CPU_CLK: CLR_CHK_EVENT3 (Bitfield-Mask: 0x01) */
/* =======================================================  PER0_CLK  ======================================================== */
#define MDR_RST_CLOCK_PER0_CLK_PortA_CLK_EN_Pos (13UL)              /*!< MDR_RST_CLOCK PER0_CLK: PortA_CLK_EN (Bit 13)         */
#define MDR_RST_CLOCK_PER0_CLK_PortA_CLK_EN_Msk (0x2000UL)          /*!< MDR_RST_CLOCK PER0_CLK: PortA_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER0_CLK_PortB_CLK_EN_Pos (14UL)              /*!< MDR_RST_CLOCK PER0_CLK: PortB_CLK_EN (Bit 14)         */
#define MDR_RST_CLOCK_PER0_CLK_PortB_CLK_EN_Msk (0x4000UL)          /*!< MDR_RST_CLOCK PER0_CLK: PortB_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER0_CLK_PortC_CLK_EN_Pos (15UL)              /*!< MDR_RST_CLOCK PER0_CLK: PortC_CLK_EN (Bit 15)         */
#define MDR_RST_CLOCK_PER0_CLK_PortC_CLK_EN_Msk (0x8000UL)          /*!< MDR_RST_CLOCK PER0_CLK: PortC_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER0_CLK_PortD_CLK_EN_Pos (16UL)              /*!< MDR_RST_CLOCK PER0_CLK: PortD_CLK_EN (Bit 16)         */
#define MDR_RST_CLOCK_PER0_CLK_PortD_CLK_EN_Msk (0x10000UL)         /*!< MDR_RST_CLOCK PER0_CLK: PortD_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER0_CLK_PortE_CLK_EN_Pos (17UL)              /*!< MDR_RST_CLOCK PER0_CLK: PortE_CLK_EN (Bit 17)         */
#define MDR_RST_CLOCK_PER0_CLK_PortE_CLK_EN_Msk (0x20000UL)         /*!< MDR_RST_CLOCK PER0_CLK: PortE_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER0_CLK_SPW1_CLK_EN_Pos (21UL)               /*!< MDR_RST_CLOCK PER0_CLK: SPW1_CLK_EN (Bit 21)          */
#define MDR_RST_CLOCK_PER0_CLK_SPW1_CLK_EN_Msk (0x200000UL)         /*!< MDR_RST_CLOCK PER0_CLK: SPW1_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER0_CLK_TIM1_CLK_EN_Pos (23UL)               /*!< MDR_RST_CLOCK PER0_CLK: TIM1_CLK_EN (Bit 23)          */
#define MDR_RST_CLOCK_PER0_CLK_TIM1_CLK_EN_Msk (0x800000UL)         /*!< MDR_RST_CLOCK PER0_CLK: TIM1_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER0_CLK_TIM2_CLK_EN_Pos (24UL)               /*!< MDR_RST_CLOCK PER0_CLK: TIM2_CLK_EN (Bit 24)          */
#define MDR_RST_CLOCK_PER0_CLK_TIM2_CLK_EN_Msk (0x1000000UL)        /*!< MDR_RST_CLOCK PER0_CLK: TIM2_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER0_CLK_TIM3_CLK_EN_Pos (25UL)               /*!< MDR_RST_CLOCK PER0_CLK: TIM3_CLK_EN (Bit 25)          */
#define MDR_RST_CLOCK_PER0_CLK_TIM3_CLK_EN_Msk (0x2000000UL)        /*!< MDR_RST_CLOCK PER0_CLK: TIM3_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER0_CLK_TIM4_CLK_EN_Pos (26UL)               /*!< MDR_RST_CLOCK PER0_CLK: TIM4_CLK_EN (Bit 26)          */
#define MDR_RST_CLOCK_PER0_CLK_TIM4_CLK_EN_Msk (0x4000000UL)        /*!< MDR_RST_CLOCK PER0_CLK: TIM4_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER0_CLK_CAN1_CLK_EN_Pos (29UL)               /*!< MDR_RST_CLOCK PER0_CLK: CAN1_CLK_EN (Bit 29)          */
#define MDR_RST_CLOCK_PER0_CLK_CAN1_CLK_EN_Msk (0x20000000UL)       /*!< MDR_RST_CLOCK PER0_CLK: CAN1_CLK_EN (Bitfield-Mask: 0x01) */
/* =======================================================  PER1_CLK  ======================================================== */
#define MDR_RST_CLOCK_PER1_CLK_SSP1_CLK_EN_Pos (2UL)                /*!< MDR_RST_CLOCK PER1_CLK: SSP1_CLK_EN (Bit 2)           */
#define MDR_RST_CLOCK_PER1_CLK_SSP1_CLK_EN_Msk (0x4UL)              /*!< MDR_RST_CLOCK PER1_CLK: SSP1_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER1_CLK_UART1_CLK_EN_Pos (6UL)               /*!< MDR_RST_CLOCK PER1_CLK: UART1_CLK_EN (Bit 6)          */
#define MDR_RST_CLOCK_PER1_CLK_UART1_CLK_EN_Msk (0x40UL)            /*!< MDR_RST_CLOCK PER1_CLK: UART1_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER1_CLK_UART2_CLK_EN_Pos (7UL)               /*!< MDR_RST_CLOCK PER1_CLK: UART2_CLK_EN (Bit 7)          */
#define MDR_RST_CLOCK_PER1_CLK_UART2_CLK_EN_Msk (0x80UL)            /*!< MDR_RST_CLOCK PER1_CLK: UART2_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER1_CLK_ARINK_RX_CLK_EN_Pos (11UL)           /*!< MDR_RST_CLOCK PER1_CLK: ARINK_RX_CLK_EN (Bit 11)      */
#define MDR_RST_CLOCK_PER1_CLK_ARINK_RX_CLK_EN_Msk (0x800UL)        /*!< MDR_RST_CLOCK PER1_CLK: ARINK_RX_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER1_CLK_ARINK_TX_CLK_EN_Pos (13UL)           /*!< MDR_RST_CLOCK PER1_CLK: ARINK_TX_CLK_EN (Bit 13)      */
#define MDR_RST_CLOCK_PER1_CLK_ARINK_TX_CLK_EN_Msk (0x2000UL)       /*!< MDR_RST_CLOCK PER1_CLK: ARINK_TX_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER1_CLK_MIL1_CLK_EN_Pos (19UL)               /*!< MDR_RST_CLOCK PER1_CLK: MIL1_CLK_EN (Bit 19)          */
#define MDR_RST_CLOCK_PER1_CLK_MIL1_CLK_EN_Msk (0x80000UL)          /*!< MDR_RST_CLOCK PER1_CLK: MIL1_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER1_CLK_MIL2_CLK_EN_Pos (21UL)               /*!< MDR_RST_CLOCK PER1_CLK: MIL2_CLK_EN (Bit 21)          */
#define MDR_RST_CLOCK_PER1_CLK_MIL2_CLK_EN_Msk (0x200000UL)         /*!< MDR_RST_CLOCK PER1_CLK: MIL2_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER1_CLK_ADC1_CLK_EN_Pos (23UL)               /*!< MDR_RST_CLOCK PER1_CLK: ADC1_CLK_EN (Bit 23)          */
#define MDR_RST_CLOCK_PER1_CLK_ADC1_CLK_EN_Msk (0x800000UL)         /*!< MDR_RST_CLOCK PER1_CLK: ADC1_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER1_CLK_ADC2_CLK_EN_Pos (24UL)               /*!< MDR_RST_CLOCK PER1_CLK: ADC2_CLK_EN (Bit 24)          */
#define MDR_RST_CLOCK_PER1_CLK_ADC2_CLK_EN_Msk (0x1000000UL)        /*!< MDR_RST_CLOCK PER1_CLK: ADC2_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER1_CLK_DAC1_CLK_EN_Pos (25UL)               /*!< MDR_RST_CLOCK PER1_CLK: DAC1_CLK_EN (Bit 25)          */
#define MDR_RST_CLOCK_PER1_CLK_DAC1_CLK_EN_Msk (0x2000000UL)        /*!< MDR_RST_CLOCK PER1_CLK: DAC1_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PER1_CLK_DAC2_CLK_EN_Pos (26UL)               /*!< MDR_RST_CLOCK PER1_CLK: DAC2_CLK_EN (Bit 26)          */
#define MDR_RST_CLOCK_PER1_CLK_DAC2_CLK_EN_Msk (0x4000000UL)        /*!< MDR_RST_CLOCK PER1_CLK: DAC2_CLK_EN (Bitfield-Mask: 0x01) */
/* =======================================================  CPU_CHK0  ======================================================== */
#define MDR_RST_CLOCK_CPU_CHK0_PRES_REG2_Pos (0UL)                  /*!< MDR_RST_CLOCK CPU_CHK0: PRES_REG2 (Bit 0)             */
#define MDR_RST_CLOCK_CPU_CHK0_PRES_REG2_Msk (0xffffUL)             /*!< MDR_RST_CLOCK CPU_CHK0: PRES_REG2 (Bitfield-Mask: 0xffff) */
#define MDR_RST_CLOCK_CPU_CHK0_PRES_REG0_Pos (16UL)                 /*!< MDR_RST_CLOCK CPU_CHK0: PRES_REG0 (Bit 16)            */
#define MDR_RST_CLOCK_CPU_CHK0_PRES_REG0_Msk (0xffff0000UL)         /*!< MDR_RST_CLOCK CPU_CHK0: PRES_REG0 (Bitfield-Mask: 0xffff) */
/* =======================================================  CPU_CHK1  ======================================================== */
#define MDR_RST_CLOCK_CPU_CHK1_PRES_REG1_Pos (0UL)                  /*!< MDR_RST_CLOCK CPU_CHK1: PRES_REG1 (Bit 0)             */
#define MDR_RST_CLOCK_CPU_CHK1_PRES_REG1_Msk (0xffffUL)             /*!< MDR_RST_CLOCK CPU_CHK1: PRES_REG1 (Bitfield-Mask: 0xffff) */
#define MDR_RST_CLOCK_CPU_CHK1_PRES_REG3_Pos (16UL)                 /*!< MDR_RST_CLOCK CPU_CHK1: PRES_REG3 (Bit 16)            */
#define MDR_RST_CLOCK_CPU_CHK1_PRES_REG3_Msk (0xffff0000UL)         /*!< MDR_RST_CLOCK CPU_CHK1: PRES_REG3 (Bitfield-Mask: 0xffff) */
/* =======================================================  CPU_CHK2  ======================================================== */
#define MDR_RST_CLOCK_CPU_CHK2_BASE_REG0_Pos (0UL)                  /*!< MDR_RST_CLOCK CPU_CHK2: BASE_REG0 (Bit 0)             */
#define MDR_RST_CLOCK_CPU_CHK2_BASE_REG0_Msk (0xffUL)               /*!< MDR_RST_CLOCK CPU_CHK2: BASE_REG0 (Bitfield-Mask: 0xff) */
#define MDR_RST_CLOCK_CPU_CHK2_BASE_REG1_Pos (8UL)                  /*!< MDR_RST_CLOCK CPU_CHK2: BASE_REG1 (Bit 8)             */
#define MDR_RST_CLOCK_CPU_CHK2_BASE_REG1_Msk (0xff00UL)             /*!< MDR_RST_CLOCK CPU_CHK2: BASE_REG1 (Bitfield-Mask: 0xff) */
#define MDR_RST_CLOCK_CPU_CHK2_BASE_REG2_Pos (16UL)                 /*!< MDR_RST_CLOCK CPU_CHK2: BASE_REG2 (Bit 16)            */
#define MDR_RST_CLOCK_CPU_CHK2_BASE_REG2_Msk (0xff0000UL)           /*!< MDR_RST_CLOCK CPU_CHK2: BASE_REG2 (Bitfield-Mask: 0xff) */
#define MDR_RST_CLOCK_CPU_CHK2_BASE_REG3_Pos (24UL)                 /*!< MDR_RST_CLOCK CPU_CHK2: BASE_REG3 (Bit 24)            */
#define MDR_RST_CLOCK_CPU_CHK2_BASE_REG3_Msk (0xff000000UL)         /*!< MDR_RST_CLOCK CPU_CHK2: BASE_REG3 (Bitfield-Mask: 0xff) */
/* =======================================================  CPU_STAT  ======================================================== */
#define MDR_RST_CLOCK_CPU_STAT_MAX_CLK_SHIFT_REG0_Pos (0UL)         /*!< MDR_RST_CLOCK CPU_STAT: MAX_CLK_SHIFT_REG0 (Bit 0)    */
#define MDR_RST_CLOCK_CPU_STAT_MAX_CLK_SHIFT_REG0_Msk (0xffUL)      /*!< MDR_RST_CLOCK CPU_STAT: MAX_CLK_SHIFT_REG0 (Bitfield-Mask: 0xff) */
#define MDR_RST_CLOCK_CPU_STAT_MAX_CLK_SHIFT_REG1_Pos (8UL)         /*!< MDR_RST_CLOCK CPU_STAT: MAX_CLK_SHIFT_REG1 (Bit 8)    */
#define MDR_RST_CLOCK_CPU_STAT_MAX_CLK_SHIFT_REG1_Msk (0xff00UL)    /*!< MDR_RST_CLOCK CPU_STAT: MAX_CLK_SHIFT_REG1 (Bitfield-Mask: 0xff) */
#define MDR_RST_CLOCK_CPU_STAT_EVENT0_Pos (16UL)                    /*!< MDR_RST_CLOCK CPU_STAT: EVENT0 (Bit 16)               */
#define MDR_RST_CLOCK_CPU_STAT_EVENT0_Msk (0x10000UL)               /*!< MDR_RST_CLOCK CPU_STAT: EVENT0 (Bitfield-Mask: 0x01)  */
#define MDR_RST_CLOCK_CPU_STAT_EVENT1_Pos (17UL)                    /*!< MDR_RST_CLOCK CPU_STAT: EVENT1 (Bit 17)               */
#define MDR_RST_CLOCK_CPU_STAT_EVENT1_Msk (0x20000UL)               /*!< MDR_RST_CLOCK CPU_STAT: EVENT1 (Bitfield-Mask: 0x01)  */
#define MDR_RST_CLOCK_CPU_STAT_EVENT2_Pos (18UL)                    /*!< MDR_RST_CLOCK CPU_STAT: EVENT2 (Bit 18)               */
#define MDR_RST_CLOCK_CPU_STAT_EVENT2_Msk (0x40000UL)               /*!< MDR_RST_CLOCK CPU_STAT: EVENT2 (Bitfield-Mask: 0x01)  */
#define MDR_RST_CLOCK_CPU_STAT_EVENT3_Pos (19UL)                    /*!< MDR_RST_CLOCK CPU_STAT: EVENT3 (Bit 19)               */
#define MDR_RST_CLOCK_CPU_STAT_EVENT3_Msk (0x80000UL)               /*!< MDR_RST_CLOCK CPU_STAT: EVENT3 (Bitfield-Mask: 0x01)  */
/* ========================================================  LSI_CLK  ======================================================== */
#define MDR_RST_CLOCK_LSI_CLK_EN_CHK_EVENT0_Pos (16UL)              /*!< MDR_RST_CLOCK LSI_CLK: EN_CHK_EVENT0 (Bit 16)         */
#define MDR_RST_CLOCK_LSI_CLK_EN_CHK_EVENT0_Msk (0x10000UL)         /*!< MDR_RST_CLOCK LSI_CLK: EN_CHK_EVENT0 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_LSI_CLK_EN_CHK_EVENT1_Pos (17UL)              /*!< MDR_RST_CLOCK LSI_CLK: EN_CHK_EVENT1 (Bit 17)         */
#define MDR_RST_CLOCK_LSI_CLK_EN_CHK_EVENT1_Msk (0x20000UL)         /*!< MDR_RST_CLOCK LSI_CLK: EN_CHK_EVENT1 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_LSI_CLK_EN_CHK_EVENT2_Pos (18UL)              /*!< MDR_RST_CLOCK LSI_CLK: EN_CHK_EVENT2 (Bit 18)         */
#define MDR_RST_CLOCK_LSI_CLK_EN_CHK_EVENT2_Msk (0x40000UL)         /*!< MDR_RST_CLOCK LSI_CLK: EN_CHK_EVENT2 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_LSI_CLK_EN_CHK_EVENT3_Pos (19UL)              /*!< MDR_RST_CLOCK LSI_CLK: EN_CHK_EVENT3 (Bit 19)         */
#define MDR_RST_CLOCK_LSI_CLK_EN_CHK_EVENT3_Msk (0x80000UL)         /*!< MDR_RST_CLOCK LSI_CLK: EN_CHK_EVENT3 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_LSI_CLK_EN_CHK_Pos  (20UL)                    /*!< MDR_RST_CLOCK LSI_CLK: EN_CHK (Bit 20)                */
#define MDR_RST_CLOCK_LSI_CLK_EN_CHK_Msk  (0x100000UL)              /*!< MDR_RST_CLOCK LSI_CLK: EN_CHK (Bitfield-Mask: 0x01)   */
#define MDR_RST_CLOCK_LSI_CLK_CLR_CHK_SHIFT_REG0_Pos (21UL)         /*!< MDR_RST_CLOCK LSI_CLK: CLR_CHK_SHIFT_REG0 (Bit 21)    */
#define MDR_RST_CLOCK_LSI_CLK_CLR_CHK_SHIFT_REG0_Msk (0x200000UL)   /*!< MDR_RST_CLOCK LSI_CLK: CLR_CHK_SHIFT_REG0 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_LSI_CLK_CLR_CHK_SHIFT_REG1_Pos (22UL)         /*!< MDR_RST_CLOCK LSI_CLK: CLR_CHK_SHIFT_REG1 (Bit 22)    */
#define MDR_RST_CLOCK_LSI_CLK_CLR_CHK_SHIFT_REG1_Msk (0x400000UL)   /*!< MDR_RST_CLOCK LSI_CLK: CLR_CHK_SHIFT_REG1 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_LSI_CLK_CLR_CHK_EVENT0_Pos (23UL)             /*!< MDR_RST_CLOCK LSI_CLK: CLR_CHK_EVENT0 (Bit 23)        */
#define MDR_RST_CLOCK_LSI_CLK_CLR_CHK_EVENT0_Msk (0x800000UL)       /*!< MDR_RST_CLOCK LSI_CLK: CLR_CHK_EVENT0 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_LSI_CLK_CLR_CHK_EVENT1_Pos (24UL)             /*!< MDR_RST_CLOCK LSI_CLK: CLR_CHK_EVENT1 (Bit 24)        */
#define MDR_RST_CLOCK_LSI_CLK_CLR_CHK_EVENT1_Msk (0x1000000UL)      /*!< MDR_RST_CLOCK LSI_CLK: CLR_CHK_EVENT1 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_LSI_CLK_CLR_CHK_EVENT2_Pos (25UL)             /*!< MDR_RST_CLOCK LSI_CLK: CLR_CHK_EVENT2 (Bit 25)        */
#define MDR_RST_CLOCK_LSI_CLK_CLR_CHK_EVENT2_Msk (0x2000000UL)      /*!< MDR_RST_CLOCK LSI_CLK: CLR_CHK_EVENT2 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_LSI_CLK_CLR_CHK_EVENT3_Pos (26UL)             /*!< MDR_RST_CLOCK LSI_CLK: CLR_CHK_EVENT3 (Bit 26)        */
#define MDR_RST_CLOCK_LSI_CLK_CLR_CHK_EVENT3_Msk (0x4000000UL)      /*!< MDR_RST_CLOCK LSI_CLK: CLR_CHK_EVENT3 (Bitfield-Mask: 0x01) */
/* =======================================================  LSI_CHK0  ======================================================== */
#define MDR_RST_CLOCK_LSI_CHK0_PRES_REG2_Pos (0UL)                  /*!< MDR_RST_CLOCK LSI_CHK0: PRES_REG2 (Bit 0)             */
#define MDR_RST_CLOCK_LSI_CHK0_PRES_REG2_Msk (0xffffUL)             /*!< MDR_RST_CLOCK LSI_CHK0: PRES_REG2 (Bitfield-Mask: 0xffff) */
#define MDR_RST_CLOCK_LSI_CHK0_PRES_REG0_Pos (16UL)                 /*!< MDR_RST_CLOCK LSI_CHK0: PRES_REG0 (Bit 16)            */
#define MDR_RST_CLOCK_LSI_CHK0_PRES_REG0_Msk (0xffff0000UL)         /*!< MDR_RST_CLOCK LSI_CHK0: PRES_REG0 (Bitfield-Mask: 0xffff) */
/* =======================================================  LSI_CHK1  ======================================================== */
#define MDR_RST_CLOCK_LSI_CHK1_PRES_REG1_Pos (0UL)                  /*!< MDR_RST_CLOCK LSI_CHK1: PRES_REG1 (Bit 0)             */
#define MDR_RST_CLOCK_LSI_CHK1_PRES_REG1_Msk (0xffffUL)             /*!< MDR_RST_CLOCK LSI_CHK1: PRES_REG1 (Bitfield-Mask: 0xffff) */
#define MDR_RST_CLOCK_LSI_CHK1_PRES_REG3_Pos (16UL)                 /*!< MDR_RST_CLOCK LSI_CHK1: PRES_REG3 (Bit 16)            */
#define MDR_RST_CLOCK_LSI_CHK1_PRES_REG3_Msk (0xffff0000UL)         /*!< MDR_RST_CLOCK LSI_CHK1: PRES_REG3 (Bitfield-Mask: 0xffff) */
/* =======================================================  LSI_CHK2  ======================================================== */
#define MDR_RST_CLOCK_LSI_CHK2_BASE_REG0_Pos (0UL)                  /*!< MDR_RST_CLOCK LSI_CHK2: BASE_REG0 (Bit 0)             */
#define MDR_RST_CLOCK_LSI_CHK2_BASE_REG0_Msk (0xffUL)               /*!< MDR_RST_CLOCK LSI_CHK2: BASE_REG0 (Bitfield-Mask: 0xff) */
#define MDR_RST_CLOCK_LSI_CHK2_BASE_REG1_Pos (8UL)                  /*!< MDR_RST_CLOCK LSI_CHK2: BASE_REG1 (Bit 8)             */
#define MDR_RST_CLOCK_LSI_CHK2_BASE_REG1_Msk (0xff00UL)             /*!< MDR_RST_CLOCK LSI_CHK2: BASE_REG1 (Bitfield-Mask: 0xff) */
#define MDR_RST_CLOCK_LSI_CHK2_BASE_REG2_Pos (16UL)                 /*!< MDR_RST_CLOCK LSI_CHK2: BASE_REG2 (Bit 16)            */
#define MDR_RST_CLOCK_LSI_CHK2_BASE_REG2_Msk (0xff0000UL)           /*!< MDR_RST_CLOCK LSI_CHK2: BASE_REG2 (Bitfield-Mask: 0xff) */
#define MDR_RST_CLOCK_LSI_CHK2_BASE_REG3_Pos (24UL)                 /*!< MDR_RST_CLOCK LSI_CHK2: BASE_REG3 (Bit 24)            */
