StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
#define MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_EVENT0_Msk (0x800000UL)      /*!< MDR_RST_CLOCK PLL2_CLK: CLR_CHK_EVENT0 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_EVENT1_Pos (24UL)            /*!< MDR_RST_CLOCK PLL2_CLK: CLR_CHK_EVENT1 (Bit 24)       */
#define MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_EVENT1_Msk (0x1000000UL)     /*!< MDR_RST_CLOCK PLL2_CLK: CLR_CHK_EVENT1 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_EVENT2_Pos (25UL)            /*!< MDR_RST_CLOCK PLL2_CLK: CLR_CHK_EVENT2 (Bit 25)       */
#define MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_EVENT2_Msk (0x2000000UL)     /*!< MDR_RST_CLOCK PLL2_CLK: CLR_CHK_EVENT2 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_EVENT3_Pos (26UL)            /*!< MDR_RST_CLOCK PLL2_CLK: CLR_CHK_EVENT3 (Bit 26)       */
#define MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_EVENT3_Msk (0x4000000UL)     /*!< MDR_RST_CLOCK PLL2_CLK: CLR_CHK_EVENT3 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL2_CLK_PLL_ON_Pos (27UL)                    /*!< MDR_RST_CLOCK PLL2_CLK: PLL_ON (Bit 27)               */
#define MDR_RST_CLOCK_PLL2_CLK_PLL_ON_Msk (0x8000000UL)             /*!< MDR_RST_CLOCK PLL2_CLK: PLL_ON (Bitfield-Mask: 0x01)  */
#define MDR_RST_CLOCK_PLL2_CLK_PLL_RLD_Pos (28UL)                   /*!< MDR_RST_CLOCK PLL2_CLK: PLL_RLD (Bit 28)              */
#define MDR_RST_CLOCK_PLL2_CLK_PLL_RLD_Msk (0x10000000UL)           /*!< MDR_RST_CLOCK PLL2_CLK: PLL_RLD (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL2_CLK_SELECT_Pos (29UL)                    /*!< MDR_RST_CLOCK PLL2_CLK: SELECT (Bit 29)               */
#define MDR_RST_CLOCK_PLL2_CLK_SELECT_Msk (0xe0000000UL)            /*!< MDR_RST_CLOCK PLL2_CLK: SELECT (Bitfield-Mask: 0x07)  */
/* =======================================================  PLL2_CHK0  ======================================================= */
#define MDR_RST_CLOCK_PLL2_CHK0_PRES_REG2_Pos (0UL)                 /*!< MDR_RST_CLOCK PLL2_CHK0: PRES_REG2 (Bit 0)            */
#define MDR_RST_CLOCK_PLL2_CHK0_PRES_REG2_Msk (0xffffUL)            /*!< MDR_RST_CLOCK PLL2_CHK0: PRES_REG2 (Bitfield-Mask: 0xffff) */
#define MDR_RST_CLOCK_PLL2_CHK0_PRES_REG0_Pos (16UL)                /*!< MDR_RST_CLOCK PLL2_CHK0: PRES_REG0 (Bit 16)           */
#define MDR_RST_CLOCK_PLL2_CHK0_PRES_REG0_Msk (0xffff0000UL)        /*!< MDR_RST_CLOCK PLL2_CHK0: PRES_REG0 (Bitfield-Mask: 0xffff) */
/* =======================================================  PLL2_CHK1  ======================================================= */
#define MDR_RST_CLOCK_PLL2_CHK1_PRES_REG1_Pos (0UL)                 /*!< MDR_RST_CLOCK PLL2_CHK1: PRES_REG1 (Bit 0)            */
#define MDR_RST_CLOCK_PLL2_CHK1_PRES_REG1_Msk (0xffffUL)            /*!< MDR_RST_CLOCK PLL2_CHK1: PRES_REG1 (Bitfield-Mask: 0xffff) */
#define MDR_RST_CLOCK_PLL2_CHK1_PRES_REG3_Pos (16UL)                /*!< MDR_RST_CLOCK PLL2_CHK1: PRES_REG3 (Bit 16)           */
#define MDR_RST_CLOCK_PLL2_CHK1_PRES_REG3_Msk (0xffff0000UL)        /*!< MDR_RST_CLOCK PLL2_CHK1: PRES_REG3 (Bitfield-Mask: 0xffff) */
/* =======================================================  PLL2_CHK2  ======================================================= */
#define MDR_RST_CLOCK_PLL2_CHK2_BASE_REG0_Pos (0UL)                 /*!< MDR_RST_CLOCK PLL2_CHK2: BASE_REG0 (Bit 0)            */
#define MDR_RST_CLOCK_PLL2_CHK2_BASE_REG0_Msk (0xffUL)              /*!< MDR_RST_CLOCK PLL2_CHK2: BASE_REG0 (Bitfield-Mask: 0xff) */
#define MDR_RST_CLOCK_PLL2_CHK2_BASE_REG1_Pos (8UL)                 /*!< MDR_RST_CLOCK PLL2_CHK2: BASE_REG1 (Bit 8)            */
#define MDR_RST_CLOCK_PLL2_CHK2_BASE_REG1_Msk (0xff00UL)            /*!< MDR_RST_CLOCK PLL2_CHK2: BASE_REG1 (Bitfield-Mask: 0xff) */
#define MDR_RST_CLOCK_PLL2_CHK2_BASE_REG2_Pos (16UL)                /*!< MDR_RST_CLOCK PLL2_CHK2: BASE_REG2 (Bit 16)           */
#define MDR_RST_CLOCK_PLL2_CHK2_BASE_REG2_Msk (0xff0000UL)          /*!< MDR_RST_CLOCK PLL2_CHK2: BASE_REG2 (Bitfield-Mask: 0xff) */
#define MDR_RST_CLOCK_PLL2_CHK2_BASE_REG3_Pos (24UL)                /*!< MDR_RST_CLOCK PLL2_CHK2: BASE_REG3 (Bit 24)           */
#define MDR_RST_CLOCK_PLL2_CHK2_BASE_REG3_Msk (0xff000000UL)        /*!< MDR_RST_CLOCK PLL2_CHK2: BASE_REG3 (Bitfield-Mask: 0xff) */
/* =======================================================  PLL2_STAT  ======================================================= */
#define MDR_RST_CLOCK_PLL2_STAT_MAX_CLK_SHIFT_REG0_Pos (0UL)        /*!< MDR_RST_CLOCK PLL2_STAT: MAX_CLK_SHIFT_REG0 (Bit 0)   */
#define MDR_RST_CLOCK_PLL2_STAT_MAX_CLK_SHIFT_REG0_Msk (0xffUL)     /*!< MDR_RST_CLOCK PLL2_STAT: MAX_CLK_SHIFT_REG0 (Bitfield-Mask: 0xff) */
#define MDR_RST_CLOCK_PLL2_STAT_MAX_CLK_SHIFT_REG1_Pos (8UL)        /*!< MDR_RST_CLOCK PLL2_STAT: MAX_CLK_SHIFT_REG1 (Bit 8)   */
#define MDR_RST_CLOCK_PLL2_STAT_MAX_CLK_SHIFT_REG1_Msk (0xff00UL)   /*!< MDR_RST_CLOCK PLL2_STAT: MAX_CLK_SHIFT_REG1 (Bitfield-Mask: 0xff) */
#define MDR_RST_CLOCK_PLL2_STAT_EVENT0_Pos (16UL)                   /*!< MDR_RST_CLOCK PLL2_STAT: EVENT0 (Bit 16)              */
#define MDR_RST_CLOCK_PLL2_STAT_EVENT0_Msk (0x10000UL)              /*!< MDR_RST_CLOCK PLL2_STAT: EVENT0 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL2_STAT_EVENT1_Pos (17UL)                   /*!< MDR_RST_CLOCK PLL2_STAT: EVENT1 (Bit 17)              */
#define MDR_RST_CLOCK_PLL2_STAT_EVENT1_Msk (0x20000UL)              /*!< MDR_RST_CLOCK PLL2_STAT: EVENT1 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL2_STAT_EVENT2_Pos (18UL)                   /*!< MDR_RST_CLOCK PLL2_STAT: EVENT2 (Bit 18)              */
#define MDR_RST_CLOCK_PLL2_STAT_EVENT2_Msk (0x40000UL)              /*!< MDR_RST_CLOCK PLL2_STAT: EVENT2 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL2_STAT_EVENT3_Pos (19UL)                   /*!< MDR_RST_CLOCK PLL2_STAT: EVENT3 (Bit 19)              */
#define MDR_RST_CLOCK_PLL2_STAT_EVENT3_Msk (0x80000UL)              /*!< MDR_RST_CLOCK PLL2_STAT: EVENT3 (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_PLL2_STAT_READY_Pos (20UL)                    /*!< MDR_RST_CLOCK PLL2_STAT: READY (Bit 20)               */
#define MDR_RST_CLOCK_PLL2_STAT_READY_Msk (0x100000UL)              /*!< MDR_RST_CLOCK PLL2_STAT: READY (Bitfield-Mask: 0x01)  */
/* =======================================================  CAN1_CLK  ======================================================== */
#define MDR_RST_CLOCK_CAN1_CLK_DIV_Pos    (0UL)                     /*!< MDR_RST_CLOCK CAN1_CLK: DIV (Bit 0)                   */
#define MDR_RST_CLOCK_CAN1_CLK_DIV_Msk    (0xffffUL)                /*!< MDR_RST_CLOCK CAN1_CLK: DIV (Bitfield-Mask: 0xffff)   */
#define MDR_RST_CLOCK_CAN1_CLK_CLK_EN_Pos (16UL)                    /*!< MDR_RST_CLOCK CAN1_CLK: CLK_EN (Bit 16)               */
#define MDR_RST_CLOCK_CAN1_CLK_CLK_EN_Msk (0x10000UL)               /*!< MDR_RST_CLOCK CAN1_CLK: CLK_EN (Bitfield-Mask: 0x01)  */
/* =======================================================  TIM1_CLK  ======================================================== */
#define MDR_RST_CLOCK_TIM1_CLK_DIV_Pos    (0UL)                     /*!< MDR_RST_CLOCK TIM1_CLK: DIV (Bit 0)                   */
#define MDR_RST_CLOCK_TIM1_CLK_DIV_Msk    (0xffffUL)                /*!< MDR_RST_CLOCK TIM1_CLK: DIV (Bitfield-Mask: 0xffff)   */
#define MDR_RST_CLOCK_TIM1_CLK_CLK_EN_Pos (16UL)                    /*!< MDR_RST_CLOCK TIM1_CLK: CLK_EN (Bit 16)               */
#define MDR_RST_CLOCK_TIM1_CLK_CLK_EN_Msk (0x10000UL)               /*!< MDR_RST_CLOCK TIM1_CLK: CLK_EN (Bitfield-Mask: 0x01)  */
/* =======================================================  TIM2_CLK  ======================================================== */
#define MDR_RST_CLOCK_TIM2_CLK_DIV_Pos    (0UL)                     /*!< MDR_RST_CLOCK TIM2_CLK: DIV (Bit 0)                   */
#define MDR_RST_CLOCK_TIM2_CLK_DIV_Msk    (0xffffUL)                /*!< MDR_RST_CLOCK TIM2_CLK: DIV (Bitfield-Mask: 0xffff)   */
#define MDR_RST_CLOCK_TIM2_CLK_CLK_EN_Pos (16UL)                    /*!< MDR_RST_CLOCK TIM2_CLK: CLK_EN (Bit 16)               */
#define MDR_RST_CLOCK_TIM2_CLK_CLK_EN_Msk (0x10000UL)               /*!< MDR_RST_CLOCK TIM2_CLK: CLK_EN (Bitfield-Mask: 0x01)  */
/* =======================================================  TIM3_CLK  ======================================================== */
#define MDR_RST_CLOCK_TIM3_CLK_DIV_Pos    (0UL)                     /*!< MDR_RST_CLOCK TIM3_CLK: DIV (Bit 0)                   */
#define MDR_RST_CLOCK_TIM3_CLK_DIV_Msk    (0xffffUL)                /*!< MDR_RST_CLOCK TIM3_CLK: DIV (Bitfield-Mask: 0xffff)   */
#define MDR_RST_CLOCK_TIM3_CLK_CLK_EN_Pos (16UL)                    /*!< MDR_RST_CLOCK TIM3_CLK: CLK_EN (Bit 16)               */
#define MDR_RST_CLOCK_TIM3_CLK_CLK_EN_Msk (0x10000UL)               /*!< MDR_RST_CLOCK TIM3_CLK: CLK_EN (Bitfield-Mask: 0x01)  */
/* =======================================================  TIM4_CLK  ======================================================== */
#define MDR_RST_CLOCK_TIM4_CLK_DIV_Pos    (0UL)                     /*!< MDR_RST_CLOCK TIM4_CLK: DIV (Bit 0)                   */
#define MDR_RST_CLOCK_TIM4_CLK_DIV_Msk    (0xffffUL)                /*!< MDR_RST_CLOCK TIM4_CLK: DIV (Bitfield-Mask: 0xffff)   */
#define MDR_RST_CLOCK_TIM4_CLK_CLK_EN_Pos (16UL)                    /*!< MDR_RST_CLOCK TIM4_CLK: CLK_EN (Bit 16)               */
#define MDR_RST_CLOCK_TIM4_CLK_CLK_EN_Msk (0x10000UL)               /*!< MDR_RST_CLOCK TIM4_CLK: CLK_EN (Bitfield-Mask: 0x01)  */
/* ========================================================  ETH_CLK  ======================================================== */
#define MDR_RST_CLOCK_ETH_CLK_DIV_Pos     (0UL)                     /*!< MDR_RST_CLOCK ETH_CLK: DIV (Bit 0)                    */
#define MDR_RST_CLOCK_ETH_CLK_DIV_Msk     (0xffffUL)                /*!< MDR_RST_CLOCK ETH_CLK: DIV (Bitfield-Mask: 0xffff)    */
#define MDR_RST_CLOCK_ETH_CLK_CLK_EN_Pos  (16UL)                    /*!< MDR_RST_CLOCK ETH_CLK: CLK_EN (Bit 16)                */
#define MDR_RST_CLOCK_ETH_CLK_CLK_EN_Msk  (0x10000UL)               /*!< MDR_RST_CLOCK ETH_CLK: CLK_EN (Bitfield-Mask: 0x01)   */
#define MDR_RST_CLOCK_ETH_CLK_SELECT_Pos  (28UL)                    /*!< MDR_RST_CLOCK ETH_CLK: SELECT (Bit 28)                */
#define MDR_RST_CLOCK_ETH_CLK_SELECT_Msk  (0xf0000000UL)            /*!< MDR_RST_CLOCK ETH_CLK: SELECT (Bitfield-Mask: 0x0f)   */
/* =======================================================  SPW1_CLK  ======================================================== */
#define MDR_RST_CLOCK_SPW1_CLK_DIV_Pos    (0UL)                     /*!< MDR_RST_CLOCK SPW1_CLK: DIV (Bit 0)                   */
#define MDR_RST_CLOCK_SPW1_CLK_DIV_Msk    (0xffffUL)                /*!< MDR_RST_CLOCK SPW1_CLK: DIV (Bitfield-Mask: 0xffff)   */
#define MDR_RST_CLOCK_SPW1_CLK_CLK_EN_Pos (16UL)                    /*!< MDR_RST_CLOCK SPW1_CLK: CLK_EN (Bit 16)               */
#define MDR_RST_CLOCK_SPW1_CLK_CLK_EN_Msk (0x10000UL)               /*!< MDR_RST_CLOCK SPW1_CLK: CLK_EN (Bitfield-Mask: 0x01)  */
/* =======================================================  UART1_CLK  ======================================================= */
#define MDR_RST_CLOCK_UART1_CLK_DIV_Pos   (0UL)                     /*!< MDR_RST_CLOCK UART1_CLK: DIV (Bit 0)                  */
#define MDR_RST_CLOCK_UART1_CLK_DIV_Msk   (0xffffUL)                /*!< MDR_RST_CLOCK UART1_CLK: DIV (Bitfield-Mask: 0xffff)  */
#define MDR_RST_CLOCK_UART1_CLK_CLK_EN_Pos (16UL)                   /*!< MDR_RST_CLOCK UART1_CLK: CLK_EN (Bit 16)              */
#define MDR_RST_CLOCK_UART1_CLK_CLK_EN_Msk (0x10000UL)              /*!< MDR_RST_CLOCK UART1_CLK: CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_UART1_CLK_SELECT_Pos (28UL)                   /*!< MDR_RST_CLOCK UART1_CLK: SELECT (Bit 28)              */
#define MDR_RST_CLOCK_UART1_CLK_SELECT_Msk (0xf0000000UL)           /*!< MDR_RST_CLOCK UART1_CLK: SELECT (Bitfield-Mask: 0x0f) */
/* =======================================================  UART2_CLK  ======================================================= */
#define MDR_RST_CLOCK_UART2_CLK_DIV_Pos   (0UL)                     /*!< MDR_RST_CLOCK UART2_CLK: DIV (Bit 0)                  */
#define MDR_RST_CLOCK_UART2_CLK_DIV_Msk   (0xffffUL)                /*!< MDR_RST_CLOCK UART2_CLK: DIV (Bitfield-Mask: 0xffff)  */
#define MDR_RST_CLOCK_UART2_CLK_CLK_EN_Pos (16UL)                   /*!< MDR_RST_CLOCK UART2_CLK: CLK_EN (Bit 16)              */
#define MDR_RST_CLOCK_UART2_CLK_CLK_EN_Msk (0x10000UL)              /*!< MDR_RST_CLOCK UART2_CLK: CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_UART2_CLK_SELECT_Pos (28UL)                   /*!< MDR_RST_CLOCK UART2_CLK: SELECT (Bit 28)              */
#define MDR_RST_CLOCK_UART2_CLK_SELECT_Msk (0xf0000000UL)           /*!< MDR_RST_CLOCK UART2_CLK: SELECT (Bitfield-Mask: 0x0f) */
/* =======================================================  SSP1_CLK  ======================================================== */
#define MDR_RST_CLOCK_SSP1_CLK_DIV_Pos    (0UL)                     /*!< MDR_RST_CLOCK SSP1_CLK: DIV (Bit 0)                   */
#define MDR_RST_CLOCK_SSP1_CLK_DIV_Msk    (0xffffUL)                /*!< MDR_RST_CLOCK SSP1_CLK: DIV (Bitfield-Mask: 0xffff)   */
#define MDR_RST_CLOCK_SSP1_CLK_CLK_EN_Pos (16UL)                    /*!< MDR_RST_CLOCK SSP1_CLK: CLK_EN (Bit 16)               */
#define MDR_RST_CLOCK_SSP1_CLK_CLK_EN_Msk (0x10000UL)               /*!< MDR_RST_CLOCK SSP1_CLK: CLK_EN (Bitfield-Mask: 0x01)  */
#define MDR_RST_CLOCK_SSP1_CLK_SELECT_Pos (28UL)                    /*!< MDR_RST_CLOCK SSP1_CLK: SELECT (Bit 28)               */
#define MDR_RST_CLOCK_SSP1_CLK_SELECT_Msk (0xf0000000UL)            /*!< MDR_RST_CLOCK SSP1_CLK: SELECT (Bitfield-Mask: 0x0f)  */
/* =======================================================  ADC1_CLK  ======================================================== */
#define MDR_RST_CLOCK_ADC1_CLK_DIV_Pos    (0UL)                     /*!< MDR_RST_CLOCK ADC1_CLK: DIV (Bit 0)                   */
#define MDR_RST_CLOCK_ADC1_CLK_DIV_Msk    (0xffffUL)                /*!< MDR_RST_CLOCK ADC1_CLK: DIV (Bitfield-Mask: 0xffff)   */
#define MDR_RST_CLOCK_ADC1_CLK_CLK_EN_Pos (16UL)                    /*!< MDR_RST_CLOCK ADC1_CLK: CLK_EN (Bit 16)               */
#define MDR_RST_CLOCK_ADC1_CLK_CLK_EN_Msk (0x10000UL)               /*!< MDR_RST_CLOCK ADC1_CLK: CLK_EN (Bitfield-Mask: 0x01)  */
#define MDR_RST_CLOCK_ADC1_CLK_SELECT_Pos (28UL)                    /*!< MDR_RST_CLOCK ADC1_CLK: SELECT (Bit 28)               */
#define MDR_RST_CLOCK_ADC1_CLK_SELECT_Msk (0xf0000000UL)            /*!< MDR_RST_CLOCK ADC1_CLK: SELECT (Bitfield-Mask: 0x0f)  */
/* =======================================================  ADC2_CLK  ======================================================== */
#define MDR_RST_CLOCK_ADC2_CLK_DIV_Pos    (0UL)                     /*!< MDR_RST_CLOCK ADC2_CLK: DIV (Bit 0)                   */
#define MDR_RST_CLOCK_ADC2_CLK_DIV_Msk    (0xffffUL)                /*!< MDR_RST_CLOCK ADC2_CLK: DIV (Bitfield-Mask: 0xffff)   */
#define MDR_RST_CLOCK_ADC2_CLK_CLK_EN_Pos (16UL)                    /*!< MDR_RST_CLOCK ADC2_CLK: CLK_EN (Bit 16)               */
#define MDR_RST_CLOCK_ADC2_CLK_CLK_EN_Msk (0x10000UL)               /*!< MDR_RST_CLOCK ADC2_CLK: CLK_EN (Bitfield-Mask: 0x01)  */
#define MDR_RST_CLOCK_ADC2_CLK_SELECT_Pos (28UL)                    /*!< MDR_RST_CLOCK ADC2_CLK: SELECT (Bit 28)               */
#define MDR_RST_CLOCK_ADC2_CLK_SELECT_Msk (0xf0000000UL)            /*!< MDR_RST_CLOCK ADC2_CLK: SELECT (Bitfield-Mask: 0x0f)  */
/* =======================================================  DAC1_CLK  ======================================================== */
#define MDR_RST_CLOCK_DAC1_CLK_DIV_Pos    (0UL)                     /*!< MDR_RST_CLOCK DAC1_CLK: DIV (Bit 0)                   */
#define MDR_RST_CLOCK_DAC1_CLK_DIV_Msk    (0xffffUL)                /*!< MDR_RST_CLOCK DAC1_CLK: DIV (Bitfield-Mask: 0xffff)   */
#define MDR_RST_CLOCK_DAC1_CLK_CLK_EN_Pos (16UL)                    /*!< MDR_RST_CLOCK DAC1_CLK: CLK_EN (Bit 16)               */
#define MDR_RST_CLOCK_DAC1_CLK_CLK_EN_Msk (0x10000UL)               /*!< MDR_RST_CLOCK DAC1_CLK: CLK_EN (Bitfield-Mask: 0x01)  */
#define MDR_RST_CLOCK_DAC1_CLK_SELECT_Pos (28UL)                    /*!< MDR_RST_CLOCK DAC1_CLK: SELECT (Bit 28)               */
#define MDR_RST_CLOCK_DAC1_CLK_SELECT_Msk (0xf0000000UL)            /*!< MDR_RST_CLOCK DAC1_CLK: SELECT (Bitfield-Mask: 0x0f)  */
/* =======================================================  DAC2_CLK  ======================================================== */
#define MDR_RST_CLOCK_DAC2_CLK_DIV_Pos    (0UL)                     /*!< MDR_RST_CLOCK DAC2_CLK: DIV (Bit 0)                   */
#define MDR_RST_CLOCK_DAC2_CLK_DIV_Msk    (0xffffUL)                /*!< MDR_RST_CLOCK DAC2_CLK: DIV (Bitfield-Mask: 0xffff)   */
#define MDR_RST_CLOCK_DAC2_CLK_CLK_EN_Pos (16UL)                    /*!< MDR_RST_CLOCK DAC2_CLK: CLK_EN (Bit 16)               */
#define MDR_RST_CLOCK_DAC2_CLK_CLK_EN_Msk (0x10000UL)               /*!< MDR_RST_CLOCK DAC2_CLK: CLK_EN (Bitfield-Mask: 0x01)  */
#define MDR_RST_CLOCK_DAC2_CLK_SELECT_Pos (28UL)                    /*!< MDR_RST_CLOCK DAC2_CLK: SELECT (Bit 28)               */
#define MDR_RST_CLOCK_DAC2_CLK_SELECT_Msk (0xf0000000UL)            /*!< MDR_RST_CLOCK DAC2_CLK: SELECT (Bitfield-Mask: 0x0f)  */
/* ========================================================  RTC_CLK  ======================================================== */
#define MDR_RST_CLOCK_RTC_CLK_DIV_Pos     (0UL)                     /*!< MDR_RST_CLOCK RTC_CLK: DIV (Bit 0)                    */
#define MDR_RST_CLOCK_RTC_CLK_DIV_Msk     (0xffffUL)                /*!< MDR_RST_CLOCK RTC_CLK: DIV (Bitfield-Mask: 0xffff)    */
#define MDR_RST_CLOCK_RTC_CLK_CLK_EN_Pos  (16UL)                    /*!< MDR_RST_CLOCK RTC_CLK: CLK_EN (Bit 16)                */
#define MDR_RST_CLOCK_RTC_CLK_CLK_EN_Msk  (0x10000UL)               /*!< MDR_RST_CLOCK RTC_CLK: CLK_EN (Bitfield-Mask: 0x01)   */
#define MDR_RST_CLOCK_RTC_CLK_SELECT_Pos  (28UL)                    /*!< MDR_RST_CLOCK RTC_CLK: SELECT (Bit 28)                */
#define MDR_RST_CLOCK_RTC_CLK_SELECT_Msk  (0xf0000000UL)            /*!< MDR_RST_CLOCK RTC_CLK: SELECT (Bitfield-Mask: 0x0f)   */


/* =========================================================================================================================== */
/* ================                                          MDR_BKP                                          ================ */
/* =========================================================================================================================== */

