StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* ==========================================================  REG  ========================================================== */
/* ==========================================================  KEY  ========================================================== */
/* ======================================================  REG_60_TMR0  ====================================================== */
#define MDR_BKP_REG_60_TMR0_MODE_Pos      (0UL)                     /*!< MDR_BKP REG_60_TMR0: MODE (Bit 0)                     */
#define MDR_BKP_REG_60_TMR0_MODE_Msk      (0x7fUL)                  /*!< MDR_BKP REG_60_TMR0: MODE (Bitfield-Mask: 0x7f)       */
#define MDR_BKP_REG_60_TMR0_FPOR_Pos      (7UL)                     /*!< MDR_BKP REG_60_TMR0: FPOR (Bit 7)                     */
#define MDR_BKP_REG_60_TMR0_FPOR_Msk      (0x80UL)                  /*!< MDR_BKP REG_60_TMR0: FPOR (Bitfield-Mask: 0x01)       */
#define MDR_BKP_REG_60_TMR0_S_UccReset_Pos (8UL)                    /*!< MDR_BKP REG_60_TMR0: S_UccReset (Bit 8)               */
#define MDR_BKP_REG_60_TMR0_S_UccReset_Msk (0x100UL)                /*!< MDR_BKP REG_60_TMR0: S_UccReset (Bitfield-Mask: 0x01) */
#define MDR_BKP_REG_60_TMR0_S_RSTn0_Pos   (9UL)                     /*!< MDR_BKP REG_60_TMR0: S_RSTn0 (Bit 9)                  */
#define MDR_BKP_REG_60_TMR0_S_RSTn0_Msk   (0x200UL)                 /*!< MDR_BKP REG_60_TMR0: S_RSTn0 (Bitfield-Mask: 0x01)    */
#define MDR_BKP_REG_60_TMR0_S_FT_Reset_Pos (10UL)                   /*!< MDR_BKP REG_60_TMR0: S_FT_Reset (Bit 10)              */
#define MDR_BKP_REG_60_TMR0_S_FT_Reset_Msk (0x400UL)                /*!< MDR_BKP REG_60_TMR0: S_FT_Reset (Bitfield-Mask: 0x01) */
#define MDR_BKP_REG_60_TMR0_S_WDT_Reset_Pos (11UL)                  /*!< MDR_BKP REG_60_TMR0: S_WDT_Reset (Bit 11)             */
#define MDR_BKP_REG_60_TMR0_S_WDT_Reset_Msk (0x800UL)               /*!< MDR_BKP REG_60_TMR0: S_WDT_Reset (Bitfield-Mask: 0x01) */
#define MDR_BKP_REG_60_TMR0_S_RSTn1_Pos   (12UL)                    /*!< MDR_BKP REG_60_TMR0: S_RSTn1 (Bit 12)                 */
#define MDR_BKP_REG_60_TMR0_S_RSTn1_Msk   (0x1000UL)                /*!< MDR_BKP REG_60_TMR0: S_RSTn1 (Bitfield-Mask: 0x01)    */
#define MDR_BKP_REG_60_TMR0_S_OVRSTn_Pos  (13UL)                    /*!< MDR_BKP REG_60_TMR0: S_OVRSTn (Bit 13)                */
#define MDR_BKP_REG_60_TMR0_S_OVRSTn_Msk  (0x2000UL)                /*!< MDR_BKP REG_60_TMR0: S_OVRSTn (Bitfield-Mask: 0x01)   */
#define MDR_BKP_REG_60_TMR0_S_SYSRSTn_Pos (14UL)                    /*!< MDR_BKP REG_60_TMR0: S_SYSRSTn (Bit 14)               */
#define MDR_BKP_REG_60_TMR0_S_SYSRSTn_Msk (0x4000UL)                /*!< MDR_BKP REG_60_TMR0: S_SYSRSTn (Bitfield-Mask: 0x01)  */
#define MDR_BKP_REG_60_TMR0_JTAG_Enable_Pos (15UL)                  /*!< MDR_BKP REG_60_TMR0: JTAG_Enable (Bit 15)             */
#define MDR_BKP_REG_60_TMR0_JTAG_Enable_Msk (0x8000UL)              /*!< MDR_BKP REG_60_TMR0: JTAG_Enable (Bitfield-Mask: 0x01) */
#define MDR_BKP_REG_60_TMR0_LimEn_LDO_DUcc0_Pos (16UL)              /*!< MDR_BKP REG_60_TMR0: LimEn_LDO_DUcc0 (Bit 16)         */
#define MDR_BKP_REG_60_TMR0_LimEn_LDO_DUcc0_Msk (0x10000UL)         /*!< MDR_BKP REG_60_TMR0: LimEn_LDO_DUcc0 (Bitfield-Mask: 0x01) */
#define MDR_BKP_REG_60_TMR0_LimEn_LDO_DUcc1_Pos (17UL)              /*!< MDR_BKP REG_60_TMR0: LimEn_LDO_DUcc1 (Bit 17)         */
#define MDR_BKP_REG_60_TMR0_LimEn_LDO_DUcc1_Msk (0x20000UL)         /*!< MDR_BKP REG_60_TMR0: LimEn_LDO_DUcc1 (Bitfield-Mask: 0x01) */
#define MDR_BKP_REG_60_TMR0_LimEn_LDO_DUcc2_Pos (18UL)              /*!< MDR_BKP REG_60_TMR0: LimEn_LDO_DUcc2 (Bit 18)         */
#define MDR_BKP_REG_60_TMR0_LimEn_LDO_DUcc2_Msk (0x40000UL)         /*!< MDR_BKP REG_60_TMR0: LimEn_LDO_DUcc2 (Bitfield-Mask: 0x01) */
#define MDR_BKP_REG_60_TMR0_LimEn_LDO_DUcc3_Pos (19UL)              /*!< MDR_BKP REG_60_TMR0: LimEn_LDO_DUcc3 (Bit 19)         */
#define MDR_BKP_REG_60_TMR0_LimEn_LDO_DUcc3_Msk (0x80000UL)         /*!< MDR_BKP REG_60_TMR0: LimEn_LDO_DUcc3 (Bitfield-Mask: 0x01) */
#define MDR_BKP_REG_60_TMR0_LimEn_LDO_BUcc_Pos (20UL)               /*!< MDR_BKP REG_60_TMR0: LimEn_LDO_BUcc (Bit 20)          */
#define MDR_BKP_REG_60_TMR0_LimEn_LDO_BUcc_Msk (0x100000UL)         /*!< MDR_BKP REG_60_TMR0: LimEn_LDO_BUcc (Bitfield-Mask: 0x01) */
#define MDR_BKP_REG_60_TMR0_LimEn_LDO_PLL_Pos (21UL)                /*!< MDR_BKP REG_60_TMR0: LimEn_LDO_PLL (Bit 21)           */
#define MDR_BKP_REG_60_TMR0_LimEn_LDO_PLL_Msk (0x200000UL)          /*!< MDR_BKP REG_60_TMR0: LimEn_LDO_PLL (Bitfield-Mask: 0x01) */
#define MDR_BKP_REG_60_TMR0_ERR_REG60x_Pos (25UL)                   /*!< MDR_BKP REG_60_TMR0: ERR_REG60x (Bit 25)              */
#define MDR_BKP_REG_60_TMR0_ERR_REG60x_Msk (0x2000000UL)            /*!< MDR_BKP REG_60_TMR0: ERR_REG60x (Bitfield-Mask: 0x01) */
#define MDR_BKP_REG_60_TMR0_ERR_REG61x_62x_Pos (26UL)               /*!< MDR_BKP REG_60_TMR0: ERR_REG61x_62x (Bit 26)          */
#define MDR_BKP_REG_60_TMR0_ERR_REG61x_62x_Msk (0x4000000UL)        /*!< MDR_BKP REG_60_TMR0: ERR_REG61x_62x (Bitfield-Mask: 0x01) */
#define MDR_BKP_REG_60_TMR0_ERR_REG63x_Pos (27UL)                   /*!< MDR_BKP REG_60_TMR0: ERR_REG63x (Bit 27)              */
#define MDR_BKP_REG_60_TMR0_ERR_REG63x_Msk (0x8000000UL)            /*!< MDR_BKP REG_60_TMR0: ERR_REG63x (Bitfield-Mask: 0x01) */
#define MDR_BKP_REG_60_TMR0_PORSTn_En_Pos (28UL)                    /*!< MDR_BKP REG_60_TMR0: PORSTn_En (Bit 28)               */
#define MDR_BKP_REG_60_TMR0_PORSTn_En_Msk (0x10000000UL)            /*!< MDR_BKP REG_60_TMR0: PORSTn_En (Bitfield-Mask: 0x01)  */
#define MDR_BKP_REG_60_TMR0_OVRSTn_En_Pos (29UL)                    /*!< MDR_BKP REG_60_TMR0: OVRSTn_En (Bit 29)               */
#define MDR_BKP_REG_60_TMR0_OVRSTn_En_Msk (0x20000000UL)            /*!< MDR_BKP REG_60_TMR0: OVRSTn_En (Bitfield-Mask: 0x01)  */
#define MDR_BKP_REG_60_TMR0_CLR_ERR_Pos   (30UL)                    /*!< MDR_BKP REG_60_TMR0: CLR_ERR (Bit 30)                 */
#define MDR_BKP_REG_60_TMR0_CLR_ERR_Msk   (0x40000000UL)            /*!< MDR_BKP REG_60_TMR0: CLR_ERR (Bitfield-Mask: 0x01)    */
#define MDR_BKP_REG_60_TMR0_ERR_IRQ_EN_Pos (31UL)                   /*!< MDR_BKP REG_60_TMR0: ERR_IRQ_EN (Bit 31)              */
#define MDR_BKP_REG_60_TMR0_ERR_IRQ_EN_Msk (0x80000000UL)           /*!< MDR_BKP REG_60_TMR0: ERR_IRQ_EN (Bitfield-Mask: 0x01) */
/* ======================================================  REG_61_TMR0  ====================================================== */
#define MDR_BKP_REG_61_TMR0_LDO0_SRILow_Pos (0UL)                   /*!< MDR_BKP REG_61_TMR0: LDO0_SRILow (Bit 0)              */
#define MDR_BKP_REG_61_TMR0_LDO0_SRILow_Msk (0x7UL)                 /*!< MDR_BKP REG_61_TMR0: LDO0_SRILow (Bitfield-Mask: 0x07) */
#define MDR_BKP_REG_61_TMR0_LDO0_Trim_Pos (3UL)                     /*!< MDR_BKP REG_61_TMR0: LDO0_Trim (Bit 3)                */
#define MDR_BKP_REG_61_TMR0_LDO0_Trim_Msk (0x38UL)                  /*!< MDR_BKP REG_61_TMR0: LDO0_Trim (Bitfield-Mask: 0x07)  */
#define MDR_BKP_REG_61_TMR0_LDO0_En_Pos   (6UL)                     /*!< MDR_BKP REG_61_TMR0: LDO0_En (Bit 6)                  */
#define MDR_BKP_REG_61_TMR0_LDO0_En_Msk   (0x40UL)                  /*!< MDR_BKP REG_61_TMR0: LDO0_En (Bitfield-Mask: 0x01)    */
#define MDR_BKP_REG_61_TMR0_LDO0_RDY_Pos  (7UL)                     /*!< MDR_BKP REG_61_TMR0: LDO0_RDY (Bit 7)                 */
#define MDR_BKP_REG_61_TMR0_LDO0_RDY_Msk  (0x80UL)                  /*!< MDR_BKP REG_61_TMR0: LDO0_RDY (Bitfield-Mask: 0x01)   */
#define MDR_BKP_REG_61_TMR0_LDO1_SRILow_Pos (8UL)                   /*!< MDR_BKP REG_61_TMR0: LDO1_SRILow (Bit 8)              */
#define MDR_BKP_REG_61_TMR0_LDO1_SRILow_Msk (0x700UL)               /*!< MDR_BKP REG_61_TMR0: LDO1_SRILow (Bitfield-Mask: 0x07) */
#define MDR_BKP_REG_61_TMR0_LDO1_Trim_Pos (11UL)                    /*!< MDR_BKP REG_61_TMR0: LDO1_Trim (Bit 11)               */
#define MDR_BKP_REG_61_TMR0_LDO1_Trim_Msk (0x3800UL)                /*!< MDR_BKP REG_61_TMR0: LDO1_Trim (Bitfield-Mask: 0x07)  */
#define MDR_BKP_REG_61_TMR0_LDO1_En_Pos   (14UL)                    /*!< MDR_BKP REG_61_TMR0: LDO1_En (Bit 14)                 */
#define MDR_BKP_REG_61_TMR0_LDO1_En_Msk   (0x4000UL)                /*!< MDR_BKP REG_61_TMR0: LDO1_En (Bitfield-Mask: 0x01)    */
#define MDR_BKP_REG_61_TMR0_LDO1_RDY_Pos  (15UL)                    /*!< MDR_BKP REG_61_TMR0: LDO1_RDY (Bit 15)                */
#define MDR_BKP_REG_61_TMR0_LDO1_RDY_Msk  (0x8000UL)                /*!< MDR_BKP REG_61_TMR0: LDO1_RDY (Bitfield-Mask: 0x01)   */
#define MDR_BKP_REG_61_TMR0_LDO2_SRILow_Pos (16UL)                  /*!< MDR_BKP REG_61_TMR0: LDO2_SRILow (Bit 16)             */
#define MDR_BKP_REG_61_TMR0_LDO2_SRILow_Msk (0x70000UL)             /*!< MDR_BKP REG_61_TMR0: LDO2_SRILow (Bitfield-Mask: 0x07) */
#define MDR_BKP_REG_61_TMR0_LDO2_Trim_Pos (19UL)                    /*!< MDR_BKP REG_61_TMR0: LDO2_Trim (Bit 19)               */
#define MDR_BKP_REG_61_TMR0_LDO2_Trim_Msk (0x380000UL)              /*!< MDR_BKP REG_61_TMR0: LDO2_Trim (Bitfield-Mask: 0x07)  */
#define MDR_BKP_REG_61_TMR0_LDO2_En_Pos   (22UL)                    /*!< MDR_BKP REG_61_TMR0: LDO2_En (Bit 22)                 */
#define MDR_BKP_REG_61_TMR0_LDO2_En_Msk   (0x400000UL)              /*!< MDR_BKP REG_61_TMR0: LDO2_En (Bitfield-Mask: 0x01)    */
#define MDR_BKP_REG_61_TMR0_LDO2_RDY_Pos  (23UL)                    /*!< MDR_BKP REG_61_TMR0: LDO2_RDY (Bit 23)                */
#define MDR_BKP_REG_61_TMR0_LDO2_RDY_Msk  (0x800000UL)              /*!< MDR_BKP REG_61_TMR0: LDO2_RDY (Bitfield-Mask: 0x01)   */
#define MDR_BKP_REG_61_TMR0_LDO3_SRILow_Pos (24UL)                  /*!< MDR_BKP REG_61_TMR0: LDO3_SRILow (Bit 24)             */
#define MDR_BKP_REG_61_TMR0_LDO3_SRILow_Msk (0x7000000UL)           /*!< MDR_BKP REG_61_TMR0: LDO3_SRILow (Bitfield-Mask: 0x07) */
#define MDR_BKP_REG_61_TMR0_LDO3_Trim_Pos (27UL)                    /*!< MDR_BKP REG_61_TMR0: LDO3_Trim (Bit 27)               */
#define MDR_BKP_REG_61_TMR0_LDO3_Trim_Msk (0x38000000UL)            /*!< MDR_BKP REG_61_TMR0: LDO3_Trim (Bitfield-Mask: 0x07)  */
#define MDR_BKP_REG_61_TMR0_LDO3_En_Pos   (30UL)                    /*!< MDR_BKP REG_61_TMR0: LDO3_En (Bit 30)                 */
#define MDR_BKP_REG_61_TMR0_LDO3_En_Msk   (0x40000000UL)            /*!< MDR_BKP REG_61_TMR0: LDO3_En (Bitfield-Mask: 0x01)    */
#define MDR_BKP_REG_61_TMR0_LDO3_RDY_Pos  (31UL)                    /*!< MDR_BKP REG_61_TMR0: LDO3_RDY (Bit 31)                */
#define MDR_BKP_REG_61_TMR0_LDO3_RDY_Msk  (0x80000000UL)            /*!< MDR_BKP REG_61_TMR0: LDO3_RDY (Bitfield-Mask: 0x01)   */
/* ======================================================  REG_62_TMR0  ====================================================== */
#define MDR_BKP_REG_62_TMR0_LDO_BUcc_SRILow_Pos (0UL)               /*!< MDR_BKP REG_62_TMR0: LDO_BUcc_SRILow (Bit 0)          */
#define MDR_BKP_REG_62_TMR0_LDO_BUcc_SRILow_Msk (0x7UL)             /*!< MDR_BKP REG_62_TMR0: LDO_BUcc_SRILow (Bitfield-Mask: 0x07) */
#define MDR_BKP_REG_62_TMR0_LDO_BUcc_Trim_Pos (3UL)                 /*!< MDR_BKP REG_62_TMR0: LDO_BUcc_Trim (Bit 3)            */
#define MDR_BKP_REG_62_TMR0_LDO_BUcc_Trim_Msk (0x38UL)              /*!< MDR_BKP REG_62_TMR0: LDO_BUcc_Trim (Bitfield-Mask: 0x07) */
#define MDR_BKP_REG_62_TMR0_LDO_BUcc_En_Pos (6UL)                   /*!< MDR_BKP REG_62_TMR0: LDO_BUcc_En (Bit 6)              */
#define MDR_BKP_REG_62_TMR0_LDO_BUcc_En_Msk (0x40UL)                /*!< MDR_BKP REG_62_TMR0: LDO_BUcc_En (Bitfield-Mask: 0x01) */
#define MDR_BKP_REG_62_TMR0_LDO_BUcc_RDY_Pos (7UL)                  /*!< MDR_BKP REG_62_TMR0: LDO_BUcc_RDY (Bit 7)             */
#define MDR_BKP_REG_62_TMR0_LDO_BUcc_RDY_Msk (0x80UL)               /*!< MDR_BKP REG_62_TMR0: LDO_BUcc_RDY (Bitfield-Mask: 0x01) */
#define MDR_BKP_REG_62_TMR0_LDO_PLL_SRILow_Pos (8UL)                /*!< MDR_BKP REG_62_TMR0: LDO_PLL_SRILow (Bit 8)           */
#define MDR_BKP_REG_62_TMR0_LDO_PLL_SRILow_Msk (0x700UL)            /*!< MDR_BKP REG_62_TMR0: LDO_PLL_SRILow (Bitfield-Mask: 0x07) */
#define MDR_BKP_REG_62_TMR0_LDO_PLL_Trim_Pos (11UL)                 /*!< MDR_BKP REG_62_TMR0: LDO_PLL_Trim (Bit 11)            */
#define MDR_BKP_REG_62_TMR0_LDO_PLL_Trim_Msk (0x3800UL)             /*!< MDR_BKP REG_62_TMR0: LDO_PLL_Trim (Bitfield-Mask: 0x07) */
#define MDR_BKP_REG_62_TMR0_LDO_PLL_En_Pos (14UL)                   /*!< MDR_BKP REG_62_TMR0: LDO_PLL_En (Bit 14)              */
#define MDR_BKP_REG_62_TMR0_LDO_PLL_En_Msk (0x4000UL)               /*!< MDR_BKP REG_62_TMR0: LDO_PLL_En (Bitfield-Mask: 0x01) */
#define MDR_BKP_REG_62_TMR0_LDO_PLL_RDY_Pos (15UL)                  /*!< MDR_BKP REG_62_TMR0: LDO_PLL_RDY (Bit 15)             */
#define MDR_BKP_REG_62_TMR0_LDO_PLL_RDY_Msk (0x8000UL)              /*!< MDR_BKP REG_62_TMR0: LDO_PLL_RDY (Bitfield-Mask: 0x01) */
#define MDR_BKP_REG_62_TMR0_TrimR_Pos     (16UL)                    /*!< MDR_BKP REG_62_TMR0: TrimR (Bit 16)                   */
#define MDR_BKP_REG_62_TMR0_TrimR_Msk     (0x1ff0000UL)             /*!< MDR_BKP REG_62_TMR0: TrimR (Bitfield-Mask: 0x1ff)     */
#define MDR_BKP_REG_62_TMR0_Trim_Ref_Pos  (28UL)                    /*!< MDR_BKP REG_62_TMR0: Trim_Ref (Bit 28)                */
#define MDR_BKP_REG_62_TMR0_Trim_Ref_Msk  (0x70000000UL)            /*!< MDR_BKP REG_62_TMR0: Trim_Ref (Bitfield-Mask: 0x07)   */
/* ======================================================  REG_63_TMR0  ====================================================== */
#define MDR_BKP_REG_63_TMR0_LSE_On_Pos    (0UL)                     /*!< MDR_BKP REG_63_TMR0: LSE_On (Bit 0)                   */
#define MDR_BKP_REG_63_TMR0_LSE_On_Msk    (0x1UL)                   /*!< MDR_BKP REG_63_TMR0: LSE_On (Bitfield-Mask: 0x01)     */
#define MDR_BKP_REG_63_TMR0_LSE_BYP_Pos   (1UL)                     /*!< MDR_BKP REG_63_TMR0: LSE_BYP (Bit 1)                  */
#define MDR_BKP_REG_63_TMR0_LSE_BYP_Msk   (0x2UL)                   /*!< MDR_BKP REG_63_TMR0: LSE_BYP (Bitfield-Mask: 0x01)    */
#define MDR_BKP_REG_63_TMR0_RTC_Sel_Pos   (2UL)                     /*!< MDR_BKP REG_63_TMR0: RTC_Sel (Bit 2)                  */
#define MDR_BKP_REG_63_TMR0_RTC_Sel_Msk   (0xcUL)                   /*!< MDR_BKP REG_63_TMR0: RTC_Sel (Bitfield-Mask: 0x03)    */
#define MDR_BKP_REG_63_TMR0_RTC_En_Pos    (4UL)                     /*!< MDR_BKP REG_63_TMR0: RTC_En (Bit 4)                   */
#define MDR_BKP_REG_63_TMR0_RTC_En_Msk    (0x10UL)                  /*!< MDR_BKP REG_63_TMR0: RTC_En (Bitfield-Mask: 0x01)     */
#define MDR_BKP_REG_63_TMR0_RTC_Cal_Pos   (5UL)                     /*!< MDR_BKP REG_63_TMR0: RTC_Cal (Bit 5)                  */
#define MDR_BKP_REG_63_TMR0_RTC_Cal_Msk   (0x1fe0UL)                /*!< MDR_BKP REG_63_TMR0: RTC_Cal (Bitfield-Mask: 0xff)    */
#define MDR_BKP_REG_63_TMR0_LSE_RDY_Pos   (13UL)                    /*!< MDR_BKP REG_63_TMR0: LSE_RDY (Bit 13)                 */
#define MDR_BKP_REG_63_TMR0_LSE_RDY_Msk   (0x2000UL)                /*!< MDR_BKP REG_63_TMR0: LSE_RDY (Bitfield-Mask: 0x01)    */
#define MDR_BKP_REG_63_TMR0_LSE_FilterEn_Pos (14UL)                 /*!< MDR_BKP REG_63_TMR0: LSE_FilterEn (Bit 14)            */
#define MDR_BKP_REG_63_TMR0_LSE_FilterEn_Msk (0x4000UL)             /*!< MDR_BKP REG_63_TMR0: LSE_FilterEn (Bitfield-Mask: 0x01) */
#define MDR_BKP_REG_63_TMR0_LSI_On_Pos    (15UL)                    /*!< MDR_BKP REG_63_TMR0: LSI_On (Bit 15)                  */
#define MDR_BKP_REG_63_TMR0_LSI_On_Msk    (0x8000UL)                /*!< MDR_BKP REG_63_TMR0: LSI_On (Bitfield-Mask: 0x01)     */
#define MDR_BKP_REG_63_TMR0_LSI_Trim_Pos  (16UL)                    /*!< MDR_BKP REG_63_TMR0: LSI_Trim (Bit 16)                */
#define MDR_BKP_REG_63_TMR0_LSI_Trim_Msk  (0x1f0000UL)              /*!< MDR_BKP REG_63_TMR0: LSI_Trim (Bitfield-Mask: 0x1f)   */
#define MDR_BKP_REG_63_TMR0_LSI_RDY_Pos   (21UL)                    /*!< MDR_BKP REG_63_TMR0: LSI_RDY (Bit 21)                 */
#define MDR_BKP_REG_63_TMR0_LSI_RDY_Msk   (0x200000UL)              /*!< MDR_BKP REG_63_TMR0: LSI_RDY (Bitfield-Mask: 0x01)    */
#define MDR_BKP_REG_63_TMR0_HSI_On_Pos    (22UL)                    /*!< MDR_BKP REG_63_TMR0: HSI_On (Bit 22)                  */
#define MDR_BKP_REG_63_TMR0_HSI_On_Msk    (0x400000UL)              /*!< MDR_BKP REG_63_TMR0: HSI_On (Bitfield-Mask: 0x01)     */
#define MDR_BKP_REG_63_TMR0_HSI_RDY_Pos   (23UL)                    /*!< MDR_BKP REG_63_TMR0: HSI_RDY (Bit 23)                 */
#define MDR_BKP_REG_63_TMR0_HSI_RDY_Msk   (0x800000UL)              /*!< MDR_BKP REG_63_TMR0: HSI_RDY (Bitfield-Mask: 0x01)    */
#define MDR_BKP_REG_63_TMR0_HSI_Trim_Pos  (24UL)                    /*!< MDR_BKP REG_63_TMR0: HSI_Trim (Bit 24)                */
#define MDR_BKP_REG_63_TMR0_HSI_Trim_Msk  (0x3f000000UL)            /*!< MDR_BKP REG_63_TMR0: HSI_Trim (Bitfield-Mask: 0x3f)   */
#define MDR_BKP_REG_63_TMR0_STANDBY_Pos   (30UL)                    /*!< MDR_BKP REG_63_TMR0: STANDBY (Bit 30)                 */
#define MDR_BKP_REG_63_TMR0_STANDBY_Msk   (0x40000000UL)            /*!< MDR_BKP REG_63_TMR0: STANDBY (Bitfield-Mask: 0x01)    */
#define MDR_BKP_REG_63_TMR0_RTC_RST_Pos   (31UL)                    /*!< MDR_BKP REG_63_TMR0: RTC_RST (Bit 31)                 */
#define MDR_BKP_REG_63_TMR0_RTC_RST_Msk   (0x80000000UL)            /*!< MDR_BKP REG_63_TMR0: RTC_RST (Bitfield-Mask: 0x01)    */
/* ======================================================  REG_60_TMR1  ====================================================== */
#define MDR_BKP_REG_60_TMR1_MODE_Pos      (0UL)                     /*!< MDR_BKP REG_60_TMR1: MODE (Bit 0)                     */
#define MDR_BKP_REG_60_TMR1_MODE_Msk      (0x7fUL)                  /*!< MDR_BKP REG_60_TMR1: MODE (Bitfield-Mask: 0x7f)       */
#define MDR_BKP_REG_60_TMR1_FPOR_Pos      (7UL)                     /*!< MDR_BKP REG_60_TMR1: FPOR (Bit 7)                     */
#define MDR_BKP_REG_60_TMR1_FPOR_Msk      (0x80UL)                  /*!< MDR_BKP REG_60_TMR1: FPOR (Bitfield-Mask: 0x01)       */
#define MDR_BKP_REG_60_TMR1_S_UccReset_Pos (8UL)                    /*!< MDR_BKP REG_60_TMR1: S_UccReset (Bit 8)               */
#define MDR_BKP_REG_60_TMR1_S_UccReset_Msk (0x100UL)                /*!< MDR_BKP REG_60_TMR1: S_UccReset (Bitfield-Mask: 0x01) */
#define MDR_BKP_REG_60_TMR1_S_RSTn0_Pos   (9UL)                     /*!< MDR_BKP REG_60_TMR1: S_RSTn0 (Bit 9)                  */
#define MDR_BKP_REG_60_TMR1_S_RSTn0_Msk   (0x200UL)                 /*!< MDR_BKP REG_60_TMR1: S_RSTn0 (Bitfield-Mask: 0x01)    */
#define MDR_BKP_REG_60_TMR1_S_FT_Reset_Pos (10UL)                   /*!< MDR_BKP REG_60_TMR1: S_FT_Reset (Bit 10)              */
#define MDR_BKP_REG_60_TMR1_S_FT_Reset_Msk (0x400UL)                /*!< MDR_BKP REG_60_TMR1: S_FT_Reset (Bitfield-Mask: 0x01) */
#define MDR_BKP_REG_60_TMR1_S_WDT_Reset_Pos (11UL)                  /*!< MDR_BKP REG_60_TMR1: S_WDT_Reset (Bit 11)             */
#define MDR_BKP_REG_60_TMR1_S_WDT_Reset_Msk (0x800UL)               /*!< MDR_BKP REG_60_TMR1: S_WDT_Reset (Bitfield-Mask: 0x01) */
#define MDR_BKP_REG_60_TMR1_S_RSTn1_Pos   (12UL)                    /*!< MDR_BKP REG_60_TMR1: S_RSTn1 (Bit 12)                 */
#define MDR_BKP_REG_60_TMR1_S_RSTn1_Msk   (0x1000UL)                /*!< MDR_BKP REG_60_TMR1: S_RSTn1 (Bitfield-Mask: 0x01)    */
#define MDR_BKP_REG_60_TMR1_S_OVRSTn_Pos  (13UL)                    /*!< MDR_BKP REG_60_TMR1: S_OVRSTn (Bit 13)                */
#define MDR_BKP_REG_60_TMR1_S_OVRSTn_Msk  (0x2000UL)                /*!< MDR_BKP REG_60_TMR1: S_OVRSTn (Bitfield-Mask: 0x01)   */
#define MDR_BKP_REG_60_TMR1_S_SYSRSTn_Pos (14UL)                    /*!< MDR_BKP REG_60_TMR1: S_SYSRSTn (Bit 14)               */
#define MDR_BKP_REG_60_TMR1_S_SYSRSTn_Msk (0x4000UL)                /*!< MDR_BKP REG_60_TMR1: S_SYSRSTn (Bitfield-Mask: 0x01)  */
#define MDR_BKP_REG_60_TMR1_JTAG_Enable_Pos (15UL)                  /*!< MDR_BKP REG_60_TMR1: JTAG_Enable (Bit 15)             */
#define MDR_BKP_REG_60_TMR1_JTAG_Enable_Msk (0x8000UL)              /*!< MDR_BKP REG_60_TMR1: JTAG_Enable (Bitfield-Mask: 0x01) */
#define MDR_BKP_REG_60_TMR1_LimEn_LDO_DUcc0_Pos (16UL)              /*!< MDR_BKP REG_60_TMR1: LimEn_LDO_DUcc0 (Bit 16)         */
#define MDR_BKP_REG_60_TMR1_LimEn_LDO_DUcc0_Msk (0x10000UL)         /*!< MDR_BKP REG_60_TMR1: LimEn_LDO_DUcc0 (Bitfield-Mask: 0x01) */
#define MDR_BKP_REG_60_TMR1_LimEn_LDO_DUcc1_Pos (17UL)              /*!< MDR_BKP REG_60_TMR1: LimEn_LDO_DUcc1 (Bit 17)         */
#define MDR_BKP_REG_60_TMR1_LimEn_LDO_DUcc1_Msk (0x20000UL)         /*!< MDR_BKP REG_60_TMR1: LimEn_LDO_DUcc1 (Bitfield-Mask: 0x01) */
#define MDR_BKP_REG_60_TMR1_LimEn_LDO_DUcc2_Pos (18UL)              /*!< MDR_BKP REG_60_TMR1: LimEn_LDO_DUcc2 (Bit 18)         */
#define MDR_BKP_REG_60_TMR1_LimEn_LDO_DUcc2_Msk (0x40000UL)         /*!< MDR_BKP REG_60_TMR1: LimEn_LDO_DUcc2 (Bitfield-Mask: 0x01) */
#define MDR_BKP_REG_60_TMR1_LimEn_LDO_DUcc3_Pos (19UL)              /*!< MDR_BKP REG_60_TMR1: LimEn_LDO_DUcc3 (Bit 19)         */
#define MDR_BKP_REG_60_TMR1_LimEn_LDO_DUcc3_Msk (0x80000UL)         /*!< MDR_BKP REG_60_TMR1: LimEn_LDO_DUcc3 (Bitfield-Mask: 0x01) */
#define MDR_BKP_REG_60_TMR1_LimEn_LDO_BUcc_Pos (20UL)               /*!< MDR_BKP REG_60_TMR1: LimEn_LDO_BUcc (Bit 20)          */
#define MDR_BKP_REG_60_TMR1_LimEn_LDO_BUcc_Msk (0x100000UL)         /*!< MDR_BKP REG_60_TMR1: LimEn_LDO_BUcc (Bitfield-Mask: 0x01) */
#define MDR_BKP_REG_60_TMR1_LimEn_LDO_PLL_Pos (21UL)                /*!< MDR_BKP REG_60_TMR1: LimEn_LDO_PLL (Bit 21)           */
#define MDR_BKP_REG_60_TMR1_LimEn_LDO_PLL_Msk (0x200000UL)          /*!< MDR_BKP REG_60_TMR1: LimEn_LDO_PLL (Bitfield-Mask: 0x01) */
#define MDR_BKP_REG_60_TMR1_ERR_REG60x_Pos (25UL)                   /*!< MDR_BKP REG_60_TMR1: ERR_REG60x (Bit 25)              */
#define MDR_BKP_REG_60_TMR1_ERR_REG60x_Msk (0x2000000UL)            /*!< MDR_BKP REG_60_TMR1: ERR_REG60x (Bitfield-Mask: 0x01) */
#define MDR_BKP_REG_60_TMR1_ERR_REG61x_62x_Pos (26UL)               /*!< MDR_BKP REG_60_TMR1: ERR_REG61x_62x (Bit 26)          */
#define MDR_BKP_REG_60_TMR1_ERR_REG61x_62x_Msk (0x4000000UL)        /*!< MDR_BKP REG_60_TMR1: ERR_REG61x_62x (Bitfield-Mask: 0x01) */
#define MDR_BKP_REG_60_TMR1_ERR_REG63x_Pos (27UL)                   /*!< MDR_BKP REG_60_TMR1: ERR_REG63x (Bit 27)              */
#define MDR_BKP_REG_60_TMR1_ERR_REG63x_Msk (0x8000000UL)            /*!< MDR_BKP REG_60_TMR1: ERR_REG63x (Bitfield-Mask: 0x01) */
#define MDR_BKP_REG_60_TMR1_PORSTn_En_Pos (28UL)                    /*!< MDR_BKP REG_60_TMR1: PORSTn_En (Bit 28)               */
#define MDR_BKP_REG_60_TMR1_PORSTn_En_Msk (0x10000000UL)            /*!< MDR_BKP REG_60_TMR1: PORSTn_En (Bitfield-Mask: 0x01)  */
#define MDR_BKP_REG_60_TMR1_OVRSTn_En_Pos (29UL)                    /*!< MDR_BKP REG_60_TMR1: OVRSTn_En (Bit 29)               */
#define MDR_BKP_REG_60_TMR1_OVRSTn_En_Msk (0x20000000UL)            /*!< MDR_BKP REG_60_TMR1: OVRSTn_En (Bitfield-Mask: 0x01)  */
#define MDR_BKP_REG_60_TMR1_CLR_ERR_Pos   (30UL)                    /*!< MDR_BKP REG_60_TMR1: CLR_ERR (Bit 30)                 */
#define MDR_BKP_REG_60_TMR1_CLR_ERR_Msk   (0x40000000UL)            /*!< MDR_BKP REG_60_TMR1: CLR_ERR (Bitfield-Mask: 0x01)    */
#define MDR_BKP_REG_60_TMR1_ERR_IRQ_EN_Pos (31UL)                   /*!< MDR_BKP REG_60_TMR1: ERR_IRQ_EN (Bit 31)              */
#define MDR_BKP_REG_60_TMR1_ERR_IRQ_EN_Msk (0x80000000UL)           /*!< MDR_BKP REG_60_TMR1: ERR_IRQ_EN (Bitfield-Mask: 0x01) */
/* ======================================================  REG_61_TMR1  ====================================================== */
#define MDR_BKP_REG_61_TMR1_LDO0_SRILow_Pos (0UL)                   /*!< MDR_BKP REG_61_TMR1: LDO0_SRILow (Bit 0)              */
