StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* ======================================================  REG_63_TMR2  ====================================================== */
#define MDR_BKP_REG_63_TMR2_LSE_On_Pos    (0UL)                     /*!< MDR_BKP REG_63_TMR2: LSE_On (Bit 0)                   */
#define MDR_BKP_REG_63_TMR2_LSE_On_Msk    (0x1UL)                   /*!< MDR_BKP REG_63_TMR2: LSE_On (Bitfield-Mask: 0x01)     */
#define MDR_BKP_REG_63_TMR2_LSE_BYP_Pos   (1UL)                     /*!< MDR_BKP REG_63_TMR2: LSE_BYP (Bit 1)                  */
#define MDR_BKP_REG_63_TMR2_LSE_BYP_Msk   (0x2UL)                   /*!< MDR_BKP REG_63_TMR2: LSE_BYP (Bitfield-Mask: 0x01)    */
#define MDR_BKP_REG_63_TMR2_RTC_Sel_Pos   (2UL)                     /*!< MDR_BKP REG_63_TMR2: RTC_Sel (Bit 2)                  */
#define MDR_BKP_REG_63_TMR2_RTC_Sel_Msk   (0xcUL)                   /*!< MDR_BKP REG_63_TMR2: RTC_Sel (Bitfield-Mask: 0x03)    */
#define MDR_BKP_REG_63_TMR2_RTC_En_Pos    (4UL)                     /*!< MDR_BKP REG_63_TMR2: RTC_En (Bit 4)                   */
#define MDR_BKP_REG_63_TMR2_RTC_En_Msk    (0x10UL)                  /*!< MDR_BKP REG_63_TMR2: RTC_En (Bitfield-Mask: 0x01)     */
#define MDR_BKP_REG_63_TMR2_RTC_Cal_Pos   (5UL)                     /*!< MDR_BKP REG_63_TMR2: RTC_Cal (Bit 5)                  */
#define MDR_BKP_REG_63_TMR2_RTC_Cal_Msk   (0x1fe0UL)                /*!< MDR_BKP REG_63_TMR2: RTC_Cal (Bitfield-Mask: 0xff)    */
#define MDR_BKP_REG_63_TMR2_LSE_RDY_Pos   (13UL)                    /*!< MDR_BKP REG_63_TMR2: LSE_RDY (Bit 13)                 */
#define MDR_BKP_REG_63_TMR2_LSE_RDY_Msk   (0x2000UL)                /*!< MDR_BKP REG_63_TMR2: LSE_RDY (Bitfield-Mask: 0x01)    */
#define MDR_BKP_REG_63_TMR2_LSE_FilterEn_Pos (14UL)                 /*!< MDR_BKP REG_63_TMR2: LSE_FilterEn (Bit 14)            */
#define MDR_BKP_REG_63_TMR2_LSE_FilterEn_Msk (0x4000UL)             /*!< MDR_BKP REG_63_TMR2: LSE_FilterEn (Bitfield-Mask: 0x01) */
#define MDR_BKP_REG_63_TMR2_LSI_On_Pos    (15UL)                    /*!< MDR_BKP REG_63_TMR2: LSI_On (Bit 15)                  */
#define MDR_BKP_REG_63_TMR2_LSI_On_Msk    (0x8000UL)                /*!< MDR_BKP REG_63_TMR2: LSI_On (Bitfield-Mask: 0x01)     */
#define MDR_BKP_REG_63_TMR2_LSI_Trim_Pos  (16UL)                    /*!< MDR_BKP REG_63_TMR2: LSI_Trim (Bit 16)                */
#define MDR_BKP_REG_63_TMR2_LSI_Trim_Msk  (0x1f0000UL)              /*!< MDR_BKP REG_63_TMR2: LSI_Trim (Bitfield-Mask: 0x1f)   */
#define MDR_BKP_REG_63_TMR2_LSI_RDY_Pos   (21UL)                    /*!< MDR_BKP REG_63_TMR2: LSI_RDY (Bit 21)                 */
#define MDR_BKP_REG_63_TMR2_LSI_RDY_Msk   (0x200000UL)              /*!< MDR_BKP REG_63_TMR2: LSI_RDY (Bitfield-Mask: 0x01)    */
#define MDR_BKP_REG_63_TMR2_HSI_On_Pos    (22UL)                    /*!< MDR_BKP REG_63_TMR2: HSI_On (Bit 22)                  */
#define MDR_BKP_REG_63_TMR2_HSI_On_Msk    (0x400000UL)              /*!< MDR_BKP REG_63_TMR2: HSI_On (Bitfield-Mask: 0x01)     */
#define MDR_BKP_REG_63_TMR2_HSI_RDY_Pos   (23UL)                    /*!< MDR_BKP REG_63_TMR2: HSI_RDY (Bit 23)                 */
#define MDR_BKP_REG_63_TMR2_HSI_RDY_Msk   (0x800000UL)              /*!< MDR_BKP REG_63_TMR2: HSI_RDY (Bitfield-Mask: 0x01)    */
#define MDR_BKP_REG_63_TMR2_HSI_Trim_Pos  (24UL)                    /*!< MDR_BKP REG_63_TMR2: HSI_Trim (Bit 24)                */
#define MDR_BKP_REG_63_TMR2_HSI_Trim_Msk  (0x3f000000UL)            /*!< MDR_BKP REG_63_TMR2: HSI_Trim (Bitfield-Mask: 0x3f)   */
#define MDR_BKP_REG_63_TMR2_STANDBY_Pos   (30UL)                    /*!< MDR_BKP REG_63_TMR2: STANDBY (Bit 30)                 */
#define MDR_BKP_REG_63_TMR2_STANDBY_Msk   (0x40000000UL)            /*!< MDR_BKP REG_63_TMR2: STANDBY (Bitfield-Mask: 0x01)    */
#define MDR_BKP_REG_63_TMR2_RTC_RST_Pos   (31UL)                    /*!< MDR_BKP REG_63_TMR2: RTC_RST (Bit 31)                 */
#define MDR_BKP_REG_63_TMR2_RTC_RST_Msk   (0x80000000UL)            /*!< MDR_BKP REG_63_TMR2: RTC_RST (Bitfield-Mask: 0x01)    */
/* =====================================================  RTC_CNT_TMR0  ====================================================== */
/* =====================================================  RTC_DIV_TMR0  ====================================================== */
#define MDR_BKP_RTC_DIV_TMR0_Value_Pos    (0UL)                     /*!< MDR_BKP RTC_DIV_TMR0: Value (Bit 0)                   */
#define MDR_BKP_RTC_DIV_TMR0_Value_Msk    (0xfffffUL)               /*!< MDR_BKP RTC_DIV_TMR0: Value (Bitfield-Mask: 0xfffff)  */
/* =====================================================  RTC_PRL_TMR0  ====================================================== */
#define MDR_BKP_RTC_PRL_TMR0_Value_Pos    (0UL)                     /*!< MDR_BKP RTC_PRL_TMR0: Value (Bit 0)                   */
#define MDR_BKP_RTC_PRL_TMR0_Value_Msk    (0xfffffUL)               /*!< MDR_BKP RTC_PRL_TMR0: Value (Bitfield-Mask: 0xfffff)  */
/* =====================================================  RTC_ALRM_TMR0  ===================================================== */
#define MDR_BKP_RTC_ALRM_TMR0_Value_Pos   (0UL)                     /*!< MDR_BKP RTC_ALRM_TMR0: Value (Bit 0)                  */
#define MDR_BKP_RTC_ALRM_TMR0_Value_Msk   (0xffffffffUL)            /*!< MDR_BKP RTC_ALRM_TMR0: Value (Bitfield-Mask: 0xffffffff) */
/* ======================================================  RTC_CS_TMR0  ====================================================== */
#define MDR_BKP_RTC_CS_TMR0_OWF_Pos       (0UL)                     /*!< MDR_BKP RTC_CS_TMR0: OWF (Bit 0)                      */
#define MDR_BKP_RTC_CS_TMR0_OWF_Msk       (0x1UL)                   /*!< MDR_BKP RTC_CS_TMR0: OWF (Bitfield-Mask: 0x01)        */
#define MDR_BKP_RTC_CS_TMR0_SECF_Pos      (1UL)                     /*!< MDR_BKP RTC_CS_TMR0: SECF (Bit 1)                     */
#define MDR_BKP_RTC_CS_TMR0_SECF_Msk      (0x2UL)                   /*!< MDR_BKP RTC_CS_TMR0: SECF (Bitfield-Mask: 0x01)       */
#define MDR_BKP_RTC_CS_TMR0_ALRF_Pos      (2UL)                     /*!< MDR_BKP RTC_CS_TMR0: ALRF (Bit 2)                     */
#define MDR_BKP_RTC_CS_TMR0_ALRF_Msk      (0x4UL)                   /*!< MDR_BKP RTC_CS_TMR0: ALRF (Bitfield-Mask: 0x01)       */
#define MDR_BKP_RTC_CS_TMR0_OWF_IE_Pos    (3UL)                     /*!< MDR_BKP RTC_CS_TMR0: OWF_IE (Bit 3)                   */
#define MDR_BKP_RTC_CS_TMR0_OWF_IE_Msk    (0x8UL)                   /*!< MDR_BKP RTC_CS_TMR0: OWF_IE (Bitfield-Mask: 0x01)     */
#define MDR_BKP_RTC_CS_TMR0_SECF_IE_Pos   (4UL)                     /*!< MDR_BKP RTC_CS_TMR0: SECF_IE (Bit 4)                  */
#define MDR_BKP_RTC_CS_TMR0_SECF_IE_Msk   (0x10UL)                  /*!< MDR_BKP RTC_CS_TMR0: SECF_IE (Bitfield-Mask: 0x01)    */
#define MDR_BKP_RTC_CS_TMR0_ALRF_IE_Pos   (5UL)                     /*!< MDR_BKP RTC_CS_TMR0: ALRF_IE (Bit 5)                  */
#define MDR_BKP_RTC_CS_TMR0_ALRF_IE_Msk   (0x20UL)                  /*!< MDR_BKP RTC_CS_TMR0: ALRF_IE (Bitfield-Mask: 0x01)    */
#define MDR_BKP_RTC_CS_TMR0_WEC_Pos       (6UL)                     /*!< MDR_BKP RTC_CS_TMR0: WEC (Bit 6)                      */
#define MDR_BKP_RTC_CS_TMR0_WEC_Msk       (0x40UL)                  /*!< MDR_BKP RTC_CS_TMR0: WEC (Bitfield-Mask: 0x01)        */
#define MDR_BKP_RTC_CS_TMR0_CLR_ERRx_Pos  (7UL)                     /*!< MDR_BKP RTC_CS_TMR0: CLR_ERRx (Bit 7)                 */
#define MDR_BKP_RTC_CS_TMR0_CLR_ERRx_Msk  (0x80UL)                  /*!< MDR_BKP RTC_CS_TMR0: CLR_ERRx (Bitfield-Mask: 0x01)   */
#define MDR_BKP_RTC_CS_TMR0_ERR_CNT_Pos   (8UL)                     /*!< MDR_BKP RTC_CS_TMR0: ERR_CNT (Bit 8)                  */
#define MDR_BKP_RTC_CS_TMR0_ERR_CNT_Msk   (0x100UL)                 /*!< MDR_BKP RTC_CS_TMR0: ERR_CNT (Bitfield-Mask: 0x01)    */
#define MDR_BKP_RTC_CS_TMR0_ERR_DIV_Pos   (9UL)                     /*!< MDR_BKP RTC_CS_TMR0: ERR_DIV (Bit 9)                  */
#define MDR_BKP_RTC_CS_TMR0_ERR_DIV_Msk   (0x200UL)                 /*!< MDR_BKP RTC_CS_TMR0: ERR_DIV (Bitfield-Mask: 0x01)    */
#define MDR_BKP_RTC_CS_TMR0_ERR_CM_Pos    (10UL)                    /*!< MDR_BKP RTC_CS_TMR0: ERR_CM (Bit 10)                  */
#define MDR_BKP_RTC_CS_TMR0_ERR_CM_Msk    (0x400UL)                 /*!< MDR_BKP RTC_CS_TMR0: ERR_CM (Bitfield-Mask: 0x01)     */
#define MDR_BKP_RTC_CS_TMR0_ERR_CC_Pos    (11UL)                    /*!< MDR_BKP RTC_CS_TMR0: ERR_CC (Bit 11)                  */
#define MDR_BKP_RTC_CS_TMR0_ERR_CC_Msk    (0x800UL)                 /*!< MDR_BKP RTC_CS_TMR0: ERR_CC (Bitfield-Mask: 0x01)     */
#define MDR_BKP_RTC_CS_TMR0_ERR_CNTx_Pos  (12UL)                    /*!< MDR_BKP RTC_CS_TMR0: ERR_CNTx (Bit 12)                */
#define MDR_BKP_RTC_CS_TMR0_ERR_CNTx_Msk  (0x1000UL)                /*!< MDR_BKP RTC_CS_TMR0: ERR_CNTx (Bitfield-Mask: 0x01)   */
#define MDR_BKP_RTC_CS_TMR0_ERR_DIVx_Pos  (13UL)                    /*!< MDR_BKP RTC_CS_TMR0: ERR_DIVx (Bit 13)                */
#define MDR_BKP_RTC_CS_TMR0_ERR_DIVx_Msk  (0x2000UL)                /*!< MDR_BKP RTC_CS_TMR0: ERR_DIVx (Bitfield-Mask: 0x01)   */
#define MDR_BKP_RTC_CS_TMR0_ERR_CMx_Pos   (14UL)                    /*!< MDR_BKP RTC_CS_TMR0: ERR_CMx (Bit 14)                 */
#define MDR_BKP_RTC_CS_TMR0_ERR_CMx_Msk   (0x4000UL)                /*!< MDR_BKP RTC_CS_TMR0: ERR_CMx (Bitfield-Mask: 0x01)    */
#define MDR_BKP_RTC_CS_TMR0_ERR_IE_Pos    (15UL)                    /*!< MDR_BKP RTC_CS_TMR0: ERR_IE (Bit 15)                  */
#define MDR_BKP_RTC_CS_TMR0_ERR_IE_Msk    (0x8000UL)                /*!< MDR_BKP RTC_CS_TMR0: ERR_IE (Bitfield-Mask: 0x01)     */
/* =====================================================  RTC_CNT_TMR1  ====================================================== */
/* =====================================================  RTC_DIV_TMR1  ====================================================== */
#define MDR_BKP_RTC_DIV_TMR1_Value_Pos    (0UL)                     /*!< MDR_BKP RTC_DIV_TMR1: Value (Bit 0)                   */
#define MDR_BKP_RTC_DIV_TMR1_Value_Msk    (0xfffffUL)               /*!< MDR_BKP RTC_DIV_TMR1: Value (Bitfield-Mask: 0xfffff)  */
/* =====================================================  RTC_PRL_TMR1  ====================================================== */
#define MDR_BKP_RTC_PRL_TMR1_Value_Pos    (0UL)                     /*!< MDR_BKP RTC_PRL_TMR1: Value (Bit 0)                   */
#define MDR_BKP_RTC_PRL_TMR1_Value_Msk    (0xfffffUL)               /*!< MDR_BKP RTC_PRL_TMR1: Value (Bitfield-Mask: 0xfffff)  */
/* =====================================================  RTC_ALRM_TMR1  ===================================================== */
#define MDR_BKP_RTC_ALRM_TMR1_Value_Pos   (0UL)                     /*!< MDR_BKP RTC_ALRM_TMR1: Value (Bit 0)                  */
#define MDR_BKP_RTC_ALRM_TMR1_Value_Msk   (0xffffffffUL)            /*!< MDR_BKP RTC_ALRM_TMR1: Value (Bitfield-Mask: 0xffffffff) */
/* ======================================================  RTC_CS_TMR1  ====================================================== */
#define MDR_BKP_RTC_CS_TMR1_OWF_Pos       (0UL)                     /*!< MDR_BKP RTC_CS_TMR1: OWF (Bit 0)                      */
#define MDR_BKP_RTC_CS_TMR1_OWF_Msk       (0x1UL)                   /*!< MDR_BKP RTC_CS_TMR1: OWF (Bitfield-Mask: 0x01)        */
#define MDR_BKP_RTC_CS_TMR1_SECF_Pos      (1UL)                     /*!< MDR_BKP RTC_CS_TMR1: SECF (Bit 1)                     */
#define MDR_BKP_RTC_CS_TMR1_SECF_Msk      (0x2UL)                   /*!< MDR_BKP RTC_CS_TMR1: SECF (Bitfield-Mask: 0x01)       */
#define MDR_BKP_RTC_CS_TMR1_ALRF_Pos      (2UL)                     /*!< MDR_BKP RTC_CS_TMR1: ALRF (Bit 2)                     */
#define MDR_BKP_RTC_CS_TMR1_ALRF_Msk      (0x4UL)                   /*!< MDR_BKP RTC_CS_TMR1: ALRF (Bitfield-Mask: 0x01)       */
#define MDR_BKP_RTC_CS_TMR1_OWF_IE_Pos    (3UL)                     /*!< MDR_BKP RTC_CS_TMR1: OWF_IE (Bit 3)                   */
#define MDR_BKP_RTC_CS_TMR1_OWF_IE_Msk    (0x8UL)                   /*!< MDR_BKP RTC_CS_TMR1: OWF_IE (Bitfield-Mask: 0x01)     */
#define MDR_BKP_RTC_CS_TMR1_SECF_IE_Pos   (4UL)                     /*!< MDR_BKP RTC_CS_TMR1: SECF_IE (Bit 4)                  */
#define MDR_BKP_RTC_CS_TMR1_SECF_IE_Msk   (0x10UL)                  /*!< MDR_BKP RTC_CS_TMR1: SECF_IE (Bitfield-Mask: 0x01)    */
#define MDR_BKP_RTC_CS_TMR1_ALRF_IE_Pos   (5UL)                     /*!< MDR_BKP RTC_CS_TMR1: ALRF_IE (Bit 5)                  */
#define MDR_BKP_RTC_CS_TMR1_ALRF_IE_Msk   (0x20UL)                  /*!< MDR_BKP RTC_CS_TMR1: ALRF_IE (Bitfield-Mask: 0x01)    */
#define MDR_BKP_RTC_CS_TMR1_WEC_Pos       (6UL)                     /*!< MDR_BKP RTC_CS_TMR1: WEC (Bit 6)                      */
#define MDR_BKP_RTC_CS_TMR1_WEC_Msk       (0x40UL)                  /*!< MDR_BKP RTC_CS_TMR1: WEC (Bitfield-Mask: 0x01)        */
#define MDR_BKP_RTC_CS_TMR1_CLR_ERRx_Pos  (7UL)                     /*!< MDR_BKP RTC_CS_TMR1: CLR_ERRx (Bit 7)                 */
#define MDR_BKP_RTC_CS_TMR1_CLR_ERRx_Msk  (0x80UL)                  /*!< MDR_BKP RTC_CS_TMR1: CLR_ERRx (Bitfield-Mask: 0x01)   */
#define MDR_BKP_RTC_CS_TMR1_ERR_CNT_Pos   (8UL)                     /*!< MDR_BKP RTC_CS_TMR1: ERR_CNT (Bit 8)                  */
#define MDR_BKP_RTC_CS_TMR1_ERR_CNT_Msk   (0x100UL)                 /*!< MDR_BKP RTC_CS_TMR1: ERR_CNT (Bitfield-Mask: 0x01)    */
#define MDR_BKP_RTC_CS_TMR1_ERR_DIV_Pos   (9UL)                     /*!< MDR_BKP RTC_CS_TMR1: ERR_DIV (Bit 9)                  */
#define MDR_BKP_RTC_CS_TMR1_ERR_DIV_Msk   (0x200UL)                 /*!< MDR_BKP RTC_CS_TMR1: ERR_DIV (Bitfield-Mask: 0x01)    */
#define MDR_BKP_RTC_CS_TMR1_ERR_CM_Pos    (10UL)                    /*!< MDR_BKP RTC_CS_TMR1: ERR_CM (Bit 10)                  */
#define MDR_BKP_RTC_CS_TMR1_ERR_CM_Msk    (0x400UL)                 /*!< MDR_BKP RTC_CS_TMR1: ERR_CM (Bitfield-Mask: 0x01)     */
#define MDR_BKP_RTC_CS_TMR1_ERR_CC_Pos    (11UL)                    /*!< MDR_BKP RTC_CS_TMR1: ERR_CC (Bit 11)                  */
#define MDR_BKP_RTC_CS_TMR1_ERR_CC_Msk    (0x800UL)                 /*!< MDR_BKP RTC_CS_TMR1: ERR_CC (Bitfield-Mask: 0x01)     */
#define MDR_BKP_RTC_CS_TMR1_ERR_CNTx_Pos  (12UL)                    /*!< MDR_BKP RTC_CS_TMR1: ERR_CNTx (Bit 12)                */
#define MDR_BKP_RTC_CS_TMR1_ERR_CNTx_Msk  (0x1000UL)                /*!< MDR_BKP RTC_CS_TMR1: ERR_CNTx (Bitfield-Mask: 0x01)   */
#define MDR_BKP_RTC_CS_TMR1_ERR_DIVx_Pos  (13UL)                    /*!< MDR_BKP RTC_CS_TMR1: ERR_DIVx (Bit 13)                */
#define MDR_BKP_RTC_CS_TMR1_ERR_DIVx_Msk  (0x2000UL)                /*!< MDR_BKP RTC_CS_TMR1: ERR_DIVx (Bitfield-Mask: 0x01)   */
#define MDR_BKP_RTC_CS_TMR1_ERR_CMx_Pos   (14UL)                    /*!< MDR_BKP RTC_CS_TMR1: ERR_CMx (Bit 14)                 */
#define MDR_BKP_RTC_CS_TMR1_ERR_CMx_Msk   (0x4000UL)                /*!< MDR_BKP RTC_CS_TMR1: ERR_CMx (Bitfield-Mask: 0x01)    */
#define MDR_BKP_RTC_CS_TMR1_ERR_IE_Pos    (15UL)                    /*!< MDR_BKP RTC_CS_TMR1: ERR_IE (Bit 15)                  */
#define MDR_BKP_RTC_CS_TMR1_ERR_IE_Msk    (0x8000UL)                /*!< MDR_BKP RTC_CS_TMR1: ERR_IE (Bitfield-Mask: 0x01)     */
/* =====================================================  RTC_CNT_TMR2  ====================================================== */
/* =====================================================  RTC_DIV_TMR2  ====================================================== */
#define MDR_BKP_RTC_DIV_TMR2_Value_Pos    (0UL)                     /*!< MDR_BKP RTC_DIV_TMR2: Value (Bit 0)                   */
#define MDR_BKP_RTC_DIV_TMR2_Value_Msk    (0xfffffUL)               /*!< MDR_BKP RTC_DIV_TMR2: Value (Bitfield-Mask: 0xfffff)  */
/* =====================================================  RTC_PRL_TMR2  ====================================================== */
#define MDR_BKP_RTC_PRL_TMR2_Value_Pos    (0UL)                     /*!< MDR_BKP RTC_PRL_TMR2: Value (Bit 0)                   */
#define MDR_BKP_RTC_PRL_TMR2_Value_Msk    (0xfffffUL)               /*!< MDR_BKP RTC_PRL_TMR2: Value (Bitfield-Mask: 0xfffff)  */
/* =====================================================  RTC_ALRM_TMR2  ===================================================== */
#define MDR_BKP_RTC_ALRM_TMR2_Value_Pos   (0UL)                     /*!< MDR_BKP RTC_ALRM_TMR2: Value (Bit 0)                  */
#define MDR_BKP_RTC_ALRM_TMR2_Value_Msk   (0xffffffffUL)            /*!< MDR_BKP RTC_ALRM_TMR2: Value (Bitfield-Mask: 0xffffffff) */
/* ======================================================  RTC_CS_TMR2  ====================================================== */
#define MDR_BKP_RTC_CS_TMR2_OWF_Pos       (0UL)                     /*!< MDR_BKP RTC_CS_TMR2: OWF (Bit 0)                      */
#define MDR_BKP_RTC_CS_TMR2_OWF_Msk       (0x1UL)                   /*!< MDR_BKP RTC_CS_TMR2: OWF (Bitfield-Mask: 0x01)        */
#define MDR_BKP_RTC_CS_TMR2_SECF_Pos      (1UL)                     /*!< MDR_BKP RTC_CS_TMR2: SECF (Bit 1)                     */
#define MDR_BKP_RTC_CS_TMR2_SECF_Msk      (0x2UL)                   /*!< MDR_BKP RTC_CS_TMR2: SECF (Bitfield-Mask: 0x01)       */
#define MDR_BKP_RTC_CS_TMR2_ALRF_Pos      (2UL)                     /*!< MDR_BKP RTC_CS_TMR2: ALRF (Bit 2)                     */
#define MDR_BKP_RTC_CS_TMR2_ALRF_Msk      (0x4UL)                   /*!< MDR_BKP RTC_CS_TMR2: ALRF (Bitfield-Mask: 0x01)       */
#define MDR_BKP_RTC_CS_TMR2_OWF_IE_Pos    (3UL)                     /*!< MDR_BKP RTC_CS_TMR2: OWF_IE (Bit 3)                   */
#define MDR_BKP_RTC_CS_TMR2_OWF_IE_Msk    (0x8UL)                   /*!< MDR_BKP RTC_CS_TMR2: OWF_IE (Bitfield-Mask: 0x01)     */
#define MDR_BKP_RTC_CS_TMR2_SECF_IE_Pos   (4UL)                     /*!< MDR_BKP RTC_CS_TMR2: SECF_IE (Bit 4)                  */
#define MDR_BKP_RTC_CS_TMR2_SECF_IE_Msk   (0x10UL)                  /*!< MDR_BKP RTC_CS_TMR2: SECF_IE (Bitfield-Mask: 0x01)    */
#define MDR_BKP_RTC_CS_TMR2_ALRF_IE_Pos   (5UL)                     /*!< MDR_BKP RTC_CS_TMR2: ALRF_IE (Bit 5)                  */
#define MDR_BKP_RTC_CS_TMR2_ALRF_IE_Msk   (0x20UL)                  /*!< MDR_BKP RTC_CS_TMR2: ALRF_IE (Bitfield-Mask: 0x01)    */
#define MDR_BKP_RTC_CS_TMR2_WEC_Pos       (6UL)                     /*!< MDR_BKP RTC_CS_TMR2: WEC (Bit 6)                      */
#define MDR_BKP_RTC_CS_TMR2_WEC_Msk       (0x40UL)                  /*!< MDR_BKP RTC_CS_TMR2: WEC (Bitfield-Mask: 0x01)        */
#define MDR_BKP_RTC_CS_TMR2_CLR_ERRx_Pos  (7UL)                     /*!< MDR_BKP RTC_CS_TMR2: CLR_ERRx (Bit 7)                 */
#define MDR_BKP_RTC_CS_TMR2_CLR_ERRx_Msk  (0x80UL)                  /*!< MDR_BKP RTC_CS_TMR2: CLR_ERRx (Bitfield-Mask: 0x01)   */
#define MDR_BKP_RTC_CS_TMR2_ERR_CNT_Pos   (8UL)                     /*!< MDR_BKP RTC_CS_TMR2: ERR_CNT (Bit 8)                  */
#define MDR_BKP_RTC_CS_TMR2_ERR_CNT_Msk   (0x100UL)                 /*!< MDR_BKP RTC_CS_TMR2: ERR_CNT (Bitfield-Mask: 0x01)    */
#define MDR_BKP_RTC_CS_TMR2_ERR_DIV_Pos   (9UL)                     /*!< MDR_BKP RTC_CS_TMR2: ERR_DIV (Bit 9)                  */
#define MDR_BKP_RTC_CS_TMR2_ERR_DIV_Msk   (0x200UL)                 /*!< MDR_BKP RTC_CS_TMR2: ERR_DIV (Bitfield-Mask: 0x01)    */
#define MDR_BKP_RTC_CS_TMR2_ERR_CM_Pos    (10UL)                    /*!< MDR_BKP RTC_CS_TMR2: ERR_CM (Bit 10)                  */
#define MDR_BKP_RTC_CS_TMR2_ERR_CM_Msk    (0x400UL)                 /*!< MDR_BKP RTC_CS_TMR2: ERR_CM (Bitfield-Mask: 0x01)     */
#define MDR_BKP_RTC_CS_TMR2_ERR_CC_Pos    (11UL)                    /*!< MDR_BKP RTC_CS_TMR2: ERR_CC (Bit 11)                  */
#define MDR_BKP_RTC_CS_TMR2_ERR_CC_Msk    (0x800UL)                 /*!< MDR_BKP RTC_CS_TMR2: ERR_CC (Bitfield-Mask: 0x01)     */
#define MDR_BKP_RTC_CS_TMR2_ERR_CNTx_Pos  (12UL)                    /*!< MDR_BKP RTC_CS_TMR2: ERR_CNTx (Bit 12)                */
#define MDR_BKP_RTC_CS_TMR2_ERR_CNTx_Msk  (0x1000UL)                /*!< MDR_BKP RTC_CS_TMR2: ERR_CNTx (Bitfield-Mask: 0x01)   */
#define MDR_BKP_RTC_CS_TMR2_ERR_DIVx_Pos  (13UL)                    /*!< MDR_BKP RTC_CS_TMR2: ERR_DIVx (Bit 13)                */
#define MDR_BKP_RTC_CS_TMR2_ERR_DIVx_Msk  (0x2000UL)                /*!< MDR_BKP RTC_CS_TMR2: ERR_DIVx (Bitfield-Mask: 0x01)   */
#define MDR_BKP_RTC_CS_TMR2_ERR_CMx_Pos   (14UL)                    /*!< MDR_BKP RTC_CS_TMR2: ERR_CMx (Bit 14)                 */
#define MDR_BKP_RTC_CS_TMR2_ERR_CMx_Msk   (0x4000UL)                /*!< MDR_BKP RTC_CS_TMR2: ERR_CMx (Bitfield-Mask: 0x01)    */
#define MDR_BKP_RTC_CS_TMR2_ERR_IE_Pos    (15UL)                    /*!< MDR_BKP RTC_CS_TMR2: ERR_IE (Bit 15)                  */
#define MDR_BKP_RTC_CS_TMR2_ERR_IE_Msk    (0x8000UL)                /*!< MDR_BKP RTC_CS_TMR2: ERR_IE (Bitfield-Mask: 0x01)     */


/* =========================================================================================================================== */
/* ================                                         MDR_SRAM                                          ================ */
/* =========================================================================================================================== */

