StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* ==========================================================  KEY  ========================================================== */
/* =========================================================  CNTR  ========================================================== */
#define MDR_SRAM_CNTR_WAITCYCL_Pos        (0UL)                     /*!< MDR_SRAM CNTR: WAITCYCL (Bit 0)                       */
#define MDR_SRAM_CNTR_WAITCYCL_Msk        (0xfUL)                   /*!< MDR_SRAM CNTR: WAITCYCL (Bitfield-Mask: 0x0f)         */
#define MDR_SRAM_CNTR_REG_ACCESS_Pos      (4UL)                     /*!< MDR_SRAM CNTR: REG_ACCESS (Bit 4)                     */
#define MDR_SRAM_CNTR_REG_ACCESS_Msk      (0x10UL)                  /*!< MDR_SRAM CNTR: REG_ACCESS (Bitfield-Mask: 0x01)       */
#define MDR_SRAM_CNTR_CLK_Pos             (5UL)                     /*!< MDR_SRAM CNTR: CLK (Bit 5)                            */
#define MDR_SRAM_CNTR_CLK_Msk             (0x20UL)                  /*!< MDR_SRAM CNTR: CLK (Bitfield-Mask: 0x01)              */
#define MDR_SRAM_CNTR_OE_Pos              (7UL)                     /*!< MDR_SRAM CNTR: OE (Bit 7)                             */
#define MDR_SRAM_CNTR_OE_Msk              (0x80UL)                  /*!< MDR_SRAM CNTR: OE (Bitfield-Mask: 0x01)               */
#define MDR_SRAM_CNTR_WE_x00_Pos          (9UL)                     /*!< MDR_SRAM CNTR: WE_x00 (Bit 9)                         */
#define MDR_SRAM_CNTR_WE_x00_Msk          (0x200UL)                 /*!< MDR_SRAM CNTR: WE_x00 (Bitfield-Mask: 0x01)           */
#define MDR_SRAM_CNTR_WE_x04_Pos          (10UL)                    /*!< MDR_SRAM CNTR: WE_x04 (Bit 10)                        */
#define MDR_SRAM_CNTR_WE_x04_Msk          (0x400UL)                 /*!< MDR_SRAM CNTR: WE_x04 (Bitfield-Mask: 0x01)           */
#define MDR_SRAM_CNTR_WE_x08_Pos          (11UL)                    /*!< MDR_SRAM CNTR: WE_x08 (Bit 11)                        */
#define MDR_SRAM_CNTR_WE_x08_Msk          (0x800UL)                 /*!< MDR_SRAM CNTR: WE_x08 (Bitfield-Mask: 0x01)           */
#define MDR_SRAM_CNTR_WE_x0C_Pos          (12UL)                    /*!< MDR_SRAM CNTR: WE_x0C (Bit 12)                        */
#define MDR_SRAM_CNTR_WE_x0C_Msk          (0x1000UL)                /*!< MDR_SRAM CNTR: WE_x0C (Bitfield-Mask: 0x01)           */
#define MDR_SRAM_CNTR_WE_ECC_Pos          (13UL)                    /*!< MDR_SRAM CNTR: WE_ECC (Bit 13)                        */
#define MDR_SRAM_CNTR_WE_ECC_Msk          (0x2000UL)                /*!< MDR_SRAM CNTR: WE_ECC (Bitfield-Mask: 0x01)           */
#define MDR_SRAM_CNTR_CEN_Pos             (14UL)                    /*!< MDR_SRAM CNTR: CEN (Bit 14)                           */
#define MDR_SRAM_CNTR_CEN_Msk             (0x4000UL)                /*!< MDR_SRAM CNTR: CEN (Bitfield-Mask: 0x01)              */
#define MDR_SRAM_CNTR_WECC_Pos            (16UL)                    /*!< MDR_SRAM CNTR: WECC (Bit 16)                          */
#define MDR_SRAM_CNTR_WECC_Msk            (0xff0000UL)              /*!< MDR_SRAM CNTR: WECC (Bitfield-Mask: 0xff)             */
#define MDR_SRAM_CNTR_RECC_Pos            (24UL)                    /*!< MDR_SRAM CNTR: RECC (Bit 24)                          */
#define MDR_SRAM_CNTR_RECC_Msk            (0xff000000UL)            /*!< MDR_SRAM CNTR: RECC (Bitfield-Mask: 0xff)             */
/* ==========================================================  ADR  ========================================================== */
/* =========================================================  WDATA  ========================================================= */
/* =========================================================  RDATA  ========================================================= */
/* =========================================================  ECCCS  ========================================================= */
#define MDR_SRAM_ECCCS_SECC_Pos           (0UL)                     /*!< MDR_SRAM ECCCS: SECC (Bit 0)                          */
#define MDR_SRAM_ECCCS_SECC_Msk           (0x1UL)                   /*!< MDR_SRAM ECCCS: SECC (Bitfield-Mask: 0x01)            */
#define MDR_SRAM_ECCCS_DECC_Pos           (1UL)                     /*!< MDR_SRAM ECCCS: DECC (Bit 1)                          */
#define MDR_SRAM_ECCCS_DECC_Msk           (0x2UL)                   /*!< MDR_SRAM ECCCS: DECC (Bitfield-Mask: 0x01)            */
#define MDR_SRAM_ECCCS_SECC_IE_Pos        (2UL)                     /*!< MDR_SRAM ECCCS: SECC_IE (Bit 2)                       */
#define MDR_SRAM_ECCCS_SECC_IE_Msk        (0x4UL)                   /*!< MDR_SRAM ECCCS: SECC_IE (Bitfield-Mask: 0x01)         */
#define MDR_SRAM_ECCCS_DECC_IE_Pos        (3UL)                     /*!< MDR_SRAM ECCCS: DECC_IE (Bit 3)                       */
#define MDR_SRAM_ECCCS_DECC_IE_Msk        (0x8UL)                   /*!< MDR_SRAM ECCCS: DECC_IE (Bitfield-Mask: 0x01)         */
#define MDR_SRAM_ECCCS_FIX_SECC_Pos       (4UL)                     /*!< MDR_SRAM ECCCS: FIX_SECC (Bit 4)                      */
#define MDR_SRAM_ECCCS_FIX_SECC_Msk       (0x10UL)                  /*!< MDR_SRAM ECCCS: FIX_SECC (Bitfield-Mask: 0x01)        */
#define MDR_SRAM_ECCCS_FIX_DECC_Pos       (5UL)                     /*!< MDR_SRAM ECCCS: FIX_DECC (Bit 5)                      */
#define MDR_SRAM_ECCCS_FIX_DECC_Msk       (0x20UL)                  /*!< MDR_SRAM ECCCS: FIX_DECC (Bitfield-Mask: 0x01)        */
#define MDR_SRAM_ECCCS_CLR_SECNT_Pos      (6UL)                     /*!< MDR_SRAM ECCCS: CLR_SECNT (Bit 6)                     */
#define MDR_SRAM_ECCCS_CLR_SECNT_Msk      (0x40UL)                  /*!< MDR_SRAM ECCCS: CLR_SECNT (Bitfield-Mask: 0x01)       */
#define MDR_SRAM_ECCCS_CLR_DECNT_Pos      (7UL)                     /*!< MDR_SRAM ECCCS: CLR_DECNT (Bit 7)                     */
#define MDR_SRAM_ECCCS_CLR_DECNT_Msk      (0x80UL)                  /*!< MDR_SRAM ECCCS: CLR_DECNT (Bitfield-Mask: 0x01)       */
#define MDR_SRAM_ECCCS_ECC_DECNT_Pos      (8UL)                     /*!< MDR_SRAM ECCCS: ECC_DECNT (Bit 8)                     */
#define MDR_SRAM_ECCCS_ECC_DECNT_Msk      (0xff00UL)                /*!< MDR_SRAM ECCCS: ECC_DECNT (Bitfield-Mask: 0xff)       */
#define MDR_SRAM_ECCCS_ECC_SECNT_Pos      (16UL)                    /*!< MDR_SRAM ECCCS: ECC_SECNT (Bit 16)                    */
#define MDR_SRAM_ECCCS_ECC_SECNT_Msk      (0xffff0000UL)            /*!< MDR_SRAM ECCCS: ECC_SECNT (Bitfield-Mask: 0xffff)     */
/* ========================================================  ECCADR  ========================================================= */
/* ========================================================  ECCDATA  ======================================================== */
/* ========================================================  ECCECC  ========================================================= */
/* ======================================================  TEST_TUNING  ====================================================== */
#define MDR_SRAM_TEST_TUNING_SRAM_TIMEOUT_Pos (0UL)                 /*!< MDR_SRAM TEST_TUNING: SRAM_TIMEOUT (Bit 0)            */
#define MDR_SRAM_TEST_TUNING_SRAM_TIMEOUT_Msk (0x7UL)               /*!< MDR_SRAM TEST_TUNING: SRAM_TIMEOUT (Bitfield-Mask: 0x07) */
#define MDR_SRAM_TEST_TUNING_TE_Pos       (4UL)                     /*!< MDR_SRAM TEST_TUNING: TE (Bit 4)                      */
#define MDR_SRAM_TEST_TUNING_TE_Msk       (0x30UL)                  /*!< MDR_SRAM TEST_TUNING: TE (Bitfield-Mask: 0x03)        */
#define MDR_SRAM_TEST_TUNING_TIME_TUNING_Pos (8UL)                  /*!< MDR_SRAM TEST_TUNING: TIME_TUNING (Bit 8)             */
#define MDR_SRAM_TEST_TUNING_TIME_TUNING_Msk (0x700UL)              /*!< MDR_SRAM TEST_TUNING: TIME_TUNING (Bitfield-Mask: 0x07) */
#define MDR_SRAM_TEST_TUNING_REPL_TUNING_Pos (16UL)                 /*!< MDR_SRAM TEST_TUNING: REPL_TUNING (Bit 16)            */
#define MDR_SRAM_TEST_TUNING_REPL_TUNING_Msk (0xf0000UL)            /*!< MDR_SRAM TEST_TUNING: REPL_TUNING (Bitfield-Mask: 0x0f) */


/* =========================================================================================================================== */
/* ================                                         MDR_PORTA                                         ================ */
/* =========================================================================================================================== */

