StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* ==========================================================  KEY  ========================================================== */
/* =========================================================  RXTX  ========================================================== */
#define MDR_PORTA_RXTX_Pin__Pos           (0UL)                     /*!< MDR_PORTA RXTX: Pin_ (Bit 0)                          */
#define MDR_PORTA_RXTX_Pin__Msk           (0x1UL)                   /*!< MDR_PORTA RXTX: Pin_ (Bitfield-Mask: 0x01)            */
/* =======================================================  RXTX_Set  ======================================================== */
#define MDR_PORTA_RXTX_Set_Pin__Pos       (0UL)                     /*!< MDR_PORTA RXTX_Set: Pin_ (Bit 0)                      */
#define MDR_PORTA_RXTX_Set_Pin__Msk       (0x1UL)                   /*!< MDR_PORTA RXTX_Set: Pin_ (Bitfield-Mask: 0x01)        */
/* ======================================================  RXTX_Clear  ======================================================= */
#define MDR_PORTA_RXTX_Clear_Pin__Pos     (0UL)                     /*!< MDR_PORTA RXTX_Clear: Pin_ (Bit 0)                    */
#define MDR_PORTA_RXTX_Clear_Pin__Msk     (0x1UL)                   /*!< MDR_PORTA RXTX_Clear: Pin_ (Bitfield-Mask: 0x01)      */
/* ==========================================================  OE  =========================================================== */
#define MDR_PORTA_OE_Pin__Pos             (0UL)                     /*!< MDR_PORTA OE: Pin_ (Bit 0)                            */
#define MDR_PORTA_OE_Pin__Msk             (0x1UL)                   /*!< MDR_PORTA OE: Pin_ (Bitfield-Mask: 0x01)              */
/* ========================================================  OE_Set  ========================================================= */
#define MDR_PORTA_OE_Set_Pin__Pos         (0UL)                     /*!< MDR_PORTA OE_Set: Pin_ (Bit 0)                        */
#define MDR_PORTA_OE_Set_Pin__Msk         (0x1UL)                   /*!< MDR_PORTA OE_Set: Pin_ (Bitfield-Mask: 0x01)          */
/* =======================================================  OE_Clear  ======================================================== */
#define MDR_PORTA_OE_Clear_Pin__Pos       (0UL)                     /*!< MDR_PORTA OE_Clear: Pin_ (Bit 0)                      */
#define MDR_PORTA_OE_Clear_Pin__Msk       (0x1UL)                   /*!< MDR_PORTA OE_Clear: Pin_ (Bitfield-Mask: 0x01)        */
/* =========================================================  FUNC0  ========================================================= */
#define MDR_PORTA_FUNC0_Func_Pin__Pos     (0UL)                     /*!< MDR_PORTA FUNC0: Func_Pin_ (Bit 0)                    */
#define MDR_PORTA_FUNC0_Func_Pin__Msk     (0xfUL)                   /*!< MDR_PORTA FUNC0: Func_Pin_ (Bitfield-Mask: 0x0f)      */
/* =========================================================  FUNC1  ========================================================= */
#define MDR_PORTA_FUNC1_Func_Pin__Pos     (0UL)                     /*!< MDR_PORTA FUNC1: Func_Pin_ (Bit 0)                    */
#define MDR_PORTA_FUNC1_Func_Pin__Msk     (0xfUL)                   /*!< MDR_PORTA FUNC1: Func_Pin_ (Bitfield-Mask: 0x0f)      */
/* =========================================================  FUNC2  ========================================================= */
#define MDR_PORTA_FUNC2_Func_Pin__Pos     (0UL)                     /*!< MDR_PORTA FUNC2: Func_Pin_ (Bit 0)                    */
#define MDR_PORTA_FUNC2_Func_Pin__Msk     (0xfUL)                   /*!< MDR_PORTA FUNC2: Func_Pin_ (Bitfield-Mask: 0x0f)      */
/* =========================================================  FUNC3  ========================================================= */
#define MDR_PORTA_FUNC3_Func_Pin__Pos     (0UL)                     /*!< MDR_PORTA FUNC3: Func_Pin_ (Bit 0)                    */
#define MDR_PORTA_FUNC3_Func_Pin__Msk     (0xfUL)                   /*!< MDR_PORTA FUNC3: Func_Pin_ (Bitfield-Mask: 0x0f)      */
/* =======================================================  FUNC0_Set  ======================================================= */
#define MDR_PORTA_FUNC0_Set_Func_Pin__Pos (0UL)                     /*!< MDR_PORTA FUNC0_Set: Func_Pin_ (Bit 0)                */
#define MDR_PORTA_FUNC0_Set_Func_Pin__Msk (0xfUL)                   /*!< MDR_PORTA FUNC0_Set: Func_Pin_ (Bitfield-Mask: 0x0f)  */
/* =======================================================  FUNC1_Set  ======================================================= */
#define MDR_PORTA_FUNC1_Set_Func_Pin__Pos (0UL)                     /*!< MDR_PORTA FUNC1_Set: Func_Pin_ (Bit 0)                */
#define MDR_PORTA_FUNC1_Set_Func_Pin__Msk (0xfUL)                   /*!< MDR_PORTA FUNC1_Set: Func_Pin_ (Bitfield-Mask: 0x0f)  */
/* =======================================================  FUNC2_Set  ======================================================= */
#define MDR_PORTA_FUNC2_Set_Func_Pin__Pos (0UL)                     /*!< MDR_PORTA FUNC2_Set: Func_Pin_ (Bit 0)                */
#define MDR_PORTA_FUNC2_Set_Func_Pin__Msk (0xfUL)                   /*!< MDR_PORTA FUNC2_Set: Func_Pin_ (Bitfield-Mask: 0x0f)  */
/* =======================================================  FUNC3_Set  ======================================================= */
#define MDR_PORTA_FUNC3_Set_Func_Pin__Pos (0UL)                     /*!< MDR_PORTA FUNC3_Set: Func_Pin_ (Bit 0)                */
#define MDR_PORTA_FUNC3_Set_Func_Pin__Msk (0xfUL)                   /*!< MDR_PORTA FUNC3_Set: Func_Pin_ (Bitfield-Mask: 0x0f)  */
/* ======================================================  FUNC0_Clear  ====================================================== */
#define MDR_PORTA_FUNC0_Clear_Func_Pin__Pos (0UL)                   /*!< MDR_PORTA FUNC0_Clear: Func_Pin_ (Bit 0)              */
#define MDR_PORTA_FUNC0_Clear_Func_Pin__Msk (0xfUL)                 /*!< MDR_PORTA FUNC0_Clear: Func_Pin_ (Bitfield-Mask: 0x0f) */
/* ======================================================  FUNC1_Clear  ====================================================== */
#define MDR_PORTA_FUNC1_Clear_Func_Pin__Pos (0UL)                   /*!< MDR_PORTA FUNC1_Clear: Func_Pin_ (Bit 0)              */
#define MDR_PORTA_FUNC1_Clear_Func_Pin__Msk (0xfUL)                 /*!< MDR_PORTA FUNC1_Clear: Func_Pin_ (Bitfield-Mask: 0x0f) */
/* ======================================================  FUNC2_Clear  ====================================================== */
#define MDR_PORTA_FUNC2_Clear_Func_Pin__Pos (0UL)                   /*!< MDR_PORTA FUNC2_Clear: Func_Pin_ (Bit 0)              */
#define MDR_PORTA_FUNC2_Clear_Func_Pin__Msk (0xfUL)                 /*!< MDR_PORTA FUNC2_Clear: Func_Pin_ (Bitfield-Mask: 0x0f) */
/* ======================================================  FUNC3_Clear  ====================================================== */
#define MDR_PORTA_FUNC3_Clear_Func_Pin__Pos (0UL)                   /*!< MDR_PORTA FUNC3_Clear: Func_Pin_ (Bit 0)              */
#define MDR_PORTA_FUNC3_Clear_Func_Pin__Msk (0xfUL)                 /*!< MDR_PORTA FUNC3_Clear: Func_Pin_ (Bitfield-Mask: 0x0f) */
/* ========================================================  ANALOG  ========================================================= */
#define MDR_PORTA_ANALOG_Pin__Pos         (0UL)                     /*!< MDR_PORTA ANALOG: Pin_ (Bit 0)                        */
#define MDR_PORTA_ANALOG_Pin__Msk         (0x1UL)                   /*!< MDR_PORTA ANALOG: Pin_ (Bitfield-Mask: 0x01)          */
/* ======================================================  ANALOG_Set  ======================================================= */
#define MDR_PORTA_ANALOG_Set_Pin__Pos     (0UL)                     /*!< MDR_PORTA ANALOG_Set: Pin_ (Bit 0)                    */
#define MDR_PORTA_ANALOG_Set_Pin__Msk     (0x1UL)                   /*!< MDR_PORTA ANALOG_Set: Pin_ (Bitfield-Mask: 0x01)      */
/* =====================================================  ANALOG_Clear  ====================================================== */
#define MDR_PORTA_ANALOG_Clear_Pin__Pos   (0UL)                     /*!< MDR_PORTA ANALOG_Clear: Pin_ (Bit 0)                  */
#define MDR_PORTA_ANALOG_Clear_Pin__Msk   (0x1UL)                   /*!< MDR_PORTA ANALOG_Clear: Pin_ (Bitfield-Mask: 0x01)    */
/* ========================================================  PULLUP  ========================================================= */
#define MDR_PORTA_PULLUP_Pin__Pos         (0UL)                     /*!< MDR_PORTA PULLUP: Pin_ (Bit 0)                        */
#define MDR_PORTA_PULLUP_Pin__Msk         (0x1UL)                   /*!< MDR_PORTA PULLUP: Pin_ (Bitfield-Mask: 0x01)          */
/* ======================================================  PULLUP_Set  ======================================================= */
#define MDR_PORTA_PULLUP_Set_Pin__Pos     (0UL)                     /*!< MDR_PORTA PULLUP_Set: Pin_ (Bit 0)                    */
#define MDR_PORTA_PULLUP_Set_Pin__Msk     (0x1UL)                   /*!< MDR_PORTA PULLUP_Set: Pin_ (Bitfield-Mask: 0x01)      */
/* =====================================================  PULLUP_Clear  ====================================================== */
#define MDR_PORTA_PULLUP_Clear_Pin__Pos   (0UL)                     /*!< MDR_PORTA PULLUP_Clear: Pin_ (Bit 0)                  */
#define MDR_PORTA_PULLUP_Clear_Pin__Msk   (0x1UL)                   /*!< MDR_PORTA PULLUP_Clear: Pin_ (Bitfield-Mask: 0x01)    */
/* =======================================================  PULLDOWN  ======================================================== */
#define MDR_PORTA_PULLDOWN_Pin__Pos       (0UL)                     /*!< MDR_PORTA PULLDOWN: Pin_ (Bit 0)                      */
#define MDR_PORTA_PULLDOWN_Pin__Msk       (0x1UL)                   /*!< MDR_PORTA PULLDOWN: Pin_ (Bitfield-Mask: 0x01)        */
/* =====================================================  PULLDOWN_Set  ====================================================== */
#define MDR_PORTA_PULLDOWN_Set_Pin__Pos   (0UL)                     /*!< MDR_PORTA PULLDOWN_Set: Pin_ (Bit 0)                  */
#define MDR_PORTA_PULLDOWN_Set_Pin__Msk   (0x1UL)                   /*!< MDR_PORTA PULLDOWN_Set: Pin_ (Bitfield-Mask: 0x01)    */
/* ====================================================  PULLDOWN_Clear  ===================================================== */
#define MDR_PORTA_PULLDOWN_Clear_Pin__Pos (0UL)                     /*!< MDR_PORTA PULLDOWN_Clear: Pin_ (Bit 0)                */
#define MDR_PORTA_PULLDOWN_Clear_Pin__Msk (0x1UL)                   /*!< MDR_PORTA PULLDOWN_Clear: Pin_ (Bitfield-Mask: 0x01)  */
/* ==========================================================  PD  =========================================================== */
#define MDR_PORTA_PD_Pin__Pos             (0UL)                     /*!< MDR_PORTA PD: Pin_ (Bit 0)                            */
#define MDR_PORTA_PD_Pin__Msk             (0x1UL)                   /*!< MDR_PORTA PD: Pin_ (Bitfield-Mask: 0x01)              */
/* ========================================================  PD_Set  ========================================================= */
#define MDR_PORTA_PD_Set_Pin__Pos         (0UL)                     /*!< MDR_PORTA PD_Set: Pin_ (Bit 0)                        */
#define MDR_PORTA_PD_Set_Pin__Msk         (0x1UL)                   /*!< MDR_PORTA PD_Set: Pin_ (Bitfield-Mask: 0x01)          */
/* =======================================================  PD_Clear  ======================================================== */
#define MDR_PORTA_PD_Clear_Pin__Pos       (0UL)                     /*!< MDR_PORTA PD_Clear: Pin_ (Bit 0)                      */
#define MDR_PORTA_PD_Clear_Pin__Msk       (0x1UL)                   /*!< MDR_PORTA PD_Clear: Pin_ (Bitfield-Mask: 0x01)        */
/* =========================================================  PWR0  ========================================================== */
#define MDR_PORTA_PWR0_Pin__Pos           (0UL)                     /*!< MDR_PORTA PWR0: Pin_ (Bit 0)                          */
#define MDR_PORTA_PWR0_Pin__Msk           (0x3UL)                   /*!< MDR_PORTA PWR0: Pin_ (Bitfield-Mask: 0x03)            */
/* =========================================================  PWR1  ========================================================== */
#define MDR_PORTA_PWR1_Pin__Pos           (0UL)                     /*!< MDR_PORTA PWR1: Pin_ (Bit 0)                          */
#define MDR_PORTA_PWR1_Pin__Msk           (0x3UL)                   /*!< MDR_PORTA PWR1: Pin_ (Bitfield-Mask: 0x03)            */
/* =======================================================  PWR0_Set  ======================================================== */
#define MDR_PORTA_PWR0_Set_Pin__Pos       (0UL)                     /*!< MDR_PORTA PWR0_Set: Pin_ (Bit 0)                      */
#define MDR_PORTA_PWR0_Set_Pin__Msk       (0x3UL)                   /*!< MDR_PORTA PWR0_Set: Pin_ (Bitfield-Mask: 0x03)        */
/* =======================================================  PWR1_Set  ======================================================== */
#define MDR_PORTA_PWR1_Set_Pin__Pos       (0UL)                     /*!< MDR_PORTA PWR1_Set: Pin_ (Bit 0)                      */
#define MDR_PORTA_PWR1_Set_Pin__Msk       (0x3UL)                   /*!< MDR_PORTA PWR1_Set: Pin_ (Bitfield-Mask: 0x03)        */
/* ======================================================  PWR0_Clear  ======================================================= */
#define MDR_PORTA_PWR0_Clear_Pin__Pos     (0UL)                     /*!< MDR_PORTA PWR0_Clear: Pin_ (Bit 0)                    */
#define MDR_PORTA_PWR0_Clear_Pin__Msk     (0x3UL)                   /*!< MDR_PORTA PWR0_Clear: Pin_ (Bitfield-Mask: 0x03)      */
/* ======================================================  PWR1_Clear  ======================================================= */
#define MDR_PORTA_PWR1_Clear_Pin__Pos     (0UL)                     /*!< MDR_PORTA PWR1_Clear: Pin_ (Bit 0)                    */
#define MDR_PORTA_PWR1_Clear_Pin__Msk     (0x3UL)                   /*!< MDR_PORTA PWR1_Clear: Pin_ (Bitfield-Mask: 0x03)      */
/* ==========================================================  CL  =========================================================== */
#define MDR_PORTA_CL_Pin__Pos             (0UL)                     /*!< MDR_PORTA CL: Pin_ (Bit 0)                            */
#define MDR_PORTA_CL_Pin__Msk             (0x1UL)                   /*!< MDR_PORTA CL: Pin_ (Bitfield-Mask: 0x01)              */
/* ========================================================  CL_Set  ========================================================= */
#define MDR_PORTA_CL_Set_Pin__Pos         (0UL)                     /*!< MDR_PORTA CL_Set: Pin_ (Bit 0)                        */
#define MDR_PORTA_CL_Set_Pin__Msk         (0x1UL)                   /*!< MDR_PORTA CL_Set: Pin_ (Bitfield-Mask: 0x01)          */
/* =======================================================  CL_Clear  ======================================================== */
#define MDR_PORTA_CL_Clear_Pin__Pos       (0UL)                     /*!< MDR_PORTA CL_Clear: Pin_ (Bit 0)                      */
#define MDR_PORTA_CL_Clear_Pin__Msk       (0x1UL)                   /*!< MDR_PORTA CL_Clear: Pin_ (Bitfield-Mask: 0x01)        */
/* ==========================================================  IE  =========================================================== */
#define MDR_PORTA_IE_Pin__Pos             (0UL)                     /*!< MDR_PORTA IE: Pin_ (Bit 0)                            */
#define MDR_PORTA_IE_Pin__Msk             (0x1UL)                   /*!< MDR_PORTA IE: Pin_ (Bitfield-Mask: 0x01)              */
/* ========================================================  IE_Set  ========================================================= */
#define MDR_PORTA_IE_Set_Pin__Pos         (0UL)                     /*!< MDR_PORTA IE_Set: Pin_ (Bit 0)                        */
#define MDR_PORTA_IE_Set_Pin__Msk         (0x1UL)                   /*!< MDR_PORTA IE_Set: Pin_ (Bitfield-Mask: 0x01)          */
/* =======================================================  IE_Clear  ======================================================== */
#define MDR_PORTA_IE_Clear_Pin__Pos       (0UL)                     /*!< MDR_PORTA IE_Clear: Pin_ (Bit 0)                      */
#define MDR_PORTA_IE_Clear_Pin__Msk       (0x1UL)                   /*!< MDR_PORTA IE_Clear: Pin_ (Bitfield-Mask: 0x01)        */
/* ==========================================================  IT  =========================================================== */
#define MDR_PORTA_IT_Pin__Pos             (0UL)                     /*!< MDR_PORTA IT: Pin_ (Bit 0)                            */
#define MDR_PORTA_IT_Pin__Msk             (0x1UL)                   /*!< MDR_PORTA IT: Pin_ (Bitfield-Mask: 0x01)              */
/* ========================================================  IT_Set  ========================================================= */
#define MDR_PORTA_IT_Set_Pin__Pos         (0UL)                     /*!< MDR_PORTA IT_Set: Pin_ (Bit 0)                        */
#define MDR_PORTA_IT_Set_Pin__Msk         (0x1UL)                   /*!< MDR_PORTA IT_Set: Pin_ (Bitfield-Mask: 0x01)          */
/* =======================================================  IT_Clear  ======================================================== */
#define MDR_PORTA_IT_Clear_Pin__Pos       (0UL)                     /*!< MDR_PORTA IT_Clear: Pin_ (Bit 0)                      */
#define MDR_PORTA_IT_Clear_Pin__Msk       (0x1UL)                   /*!< MDR_PORTA IT_Clear: Pin_ (Bitfield-Mask: 0x01)        */
/* ==========================================================  IR  =========================================================== */
#define MDR_PORTA_IR_Pin__Pos             (0UL)                     /*!< MDR_PORTA IR: Pin_ (Bit 0)                            */
#define MDR_PORTA_IR_Pin__Msk             (0x1UL)                   /*!< MDR_PORTA IR: Pin_ (Bitfield-Mask: 0x01)              */
/* ========================================================  IR_Set  ========================================================= */
#define MDR_PORTA_IR_Set_Pin__Pos         (0UL)                     /*!< MDR_PORTA IR_Set: Pin_ (Bit 0)                        */
#define MDR_PORTA_IR_Set_Pin__Msk         (0x1UL)                   /*!< MDR_PORTA IR_Set: Pin_ (Bitfield-Mask: 0x01)          */
/* =======================================================  IR_Clear  ======================================================== */
#define MDR_PORTA_IR_Clear_Pin__Pos       (0UL)                     /*!< MDR_PORTA IR_Clear: Pin_ (Bit 0)                      */
#define MDR_PORTA_IR_Clear_Pin__Msk       (0x1UL)                   /*!< MDR_PORTA IR_Clear: Pin_ (Bitfield-Mask: 0x01)        */
/* =========================================================  HCUR  ========================================================== */
#define MDR_PORTA_HCUR_Pin__Pos           (0UL)                     /*!< MDR_PORTA HCUR: Pin_ (Bit 0)                          */
#define MDR_PORTA_HCUR_Pin__Msk           (0x1UL)                   /*!< MDR_PORTA HCUR: Pin_ (Bitfield-Mask: 0x01)            */


/* =========================================================================================================================== */
/* ================                                        MDR_TIMER1                                         ================ */
/* =========================================================================================================================== */

