StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* ==========================================================  CR0  ========================================================== */
#define MDR_SSP1_CR0_DSS_Pos              (0UL)                     /*!< MDR_SSP1 CR0: DSS (Bit 0)                             */
#define MDR_SSP1_CR0_DSS_Msk              (0xfUL)                   /*!< MDR_SSP1 CR0: DSS (Bitfield-Mask: 0x0f)               */
#define MDR_SSP1_CR0_FRF_Pos              (4UL)                     /*!< MDR_SSP1 CR0: FRF (Bit 4)                             */
#define MDR_SSP1_CR0_FRF_Msk              (0x30UL)                  /*!< MDR_SSP1 CR0: FRF (Bitfield-Mask: 0x03)               */
#define MDR_SSP1_CR0_SPO_Pos              (6UL)                     /*!< MDR_SSP1 CR0: SPO (Bit 6)                             */
#define MDR_SSP1_CR0_SPO_Msk              (0x40UL)                  /*!< MDR_SSP1 CR0: SPO (Bitfield-Mask: 0x01)               */
#define MDR_SSP1_CR0_SPH_Pos              (7UL)                     /*!< MDR_SSP1 CR0: SPH (Bit 7)                             */
#define MDR_SSP1_CR0_SPH_Msk              (0x80UL)                  /*!< MDR_SSP1 CR0: SPH (Bitfield-Mask: 0x01)               */
#define MDR_SSP1_CR0_SCR_Pos              (8UL)                     /*!< MDR_SSP1 CR0: SCR (Bit 8)                             */
#define MDR_SSP1_CR0_SCR_Msk              (0xff00UL)                /*!< MDR_SSP1 CR0: SCR (Bitfield-Mask: 0xff)               */
/* ==========================================================  CR1  ========================================================== */
#define MDR_SSP1_CR1_LBM_Pos              (0UL)                     /*!< MDR_SSP1 CR1: LBM (Bit 0)                             */
#define MDR_SSP1_CR1_LBM_Msk              (0x1UL)                   /*!< MDR_SSP1 CR1: LBM (Bitfield-Mask: 0x01)               */
#define MDR_SSP1_CR1_SSE_Pos              (1UL)                     /*!< MDR_SSP1 CR1: SSE (Bit 1)                             */
#define MDR_SSP1_CR1_SSE_Msk              (0x2UL)                   /*!< MDR_SSP1 CR1: SSE (Bitfield-Mask: 0x01)               */
#define MDR_SSP1_CR1_MS_Pos               (2UL)                     /*!< MDR_SSP1 CR1: MS (Bit 2)                              */
#define MDR_SSP1_CR1_MS_Msk               (0x4UL)                   /*!< MDR_SSP1 CR1: MS (Bitfield-Mask: 0x01)                */
#define MDR_SSP1_CR1_SOD_Pos              (3UL)                     /*!< MDR_SSP1 CR1: SOD (Bit 3)                             */
#define MDR_SSP1_CR1_SOD_Msk              (0x8UL)                   /*!< MDR_SSP1 CR1: SOD (Bitfield-Mask: 0x01)               */
/* ==========================================================  DR  =========================================================== */
#define MDR_SSP1_DR_Data_Pos              (0UL)                     /*!< MDR_SSP1 DR: Data (Bit 0)                             */
#define MDR_SSP1_DR_Data_Msk              (0xffffUL)                /*!< MDR_SSP1 DR: Data (Bitfield-Mask: 0xffff)             */
/* ==========================================================  SR  =========================================================== */
#define MDR_SSP1_SR_TFE_Pos               (0UL)                     /*!< MDR_SSP1 SR: TFE (Bit 0)                              */
#define MDR_SSP1_SR_TFE_Msk               (0x1UL)                   /*!< MDR_SSP1 SR: TFE (Bitfield-Mask: 0x01)                */
#define MDR_SSP1_SR_TNF_Pos               (1UL)                     /*!< MDR_SSP1 SR: TNF (Bit 1)                              */
#define MDR_SSP1_SR_TNF_Msk               (0x2UL)                   /*!< MDR_SSP1 SR: TNF (Bitfield-Mask: 0x01)                */
#define MDR_SSP1_SR_RNE_Pos               (2UL)                     /*!< MDR_SSP1 SR: RNE (Bit 2)                              */
#define MDR_SSP1_SR_RNE_Msk               (0x4UL)                   /*!< MDR_SSP1 SR: RNE (Bitfield-Mask: 0x01)                */
#define MDR_SSP1_SR_RFF_Pos               (3UL)                     /*!< MDR_SSP1 SR: RFF (Bit 3)                              */
#define MDR_SSP1_SR_RFF_Msk               (0x8UL)                   /*!< MDR_SSP1 SR: RFF (Bitfield-Mask: 0x01)                */
#define MDR_SSP1_SR_BSY_Pos               (4UL)                     /*!< MDR_SSP1 SR: BSY (Bit 4)                              */
#define MDR_SSP1_SR_BSY_Msk               (0x10UL)                  /*!< MDR_SSP1 SR: BSY (Bitfield-Mask: 0x01)                */
/* =========================================================  CPSR  ========================================================== */
#define MDR_SSP1_CPSR_CPSDVSR_Pos         (0UL)                     /*!< MDR_SSP1 CPSR: CPSDVSR (Bit 0)                        */
#define MDR_SSP1_CPSR_CPSDVSR_Msk         (0xffUL)                  /*!< MDR_SSP1 CPSR: CPSDVSR (Bitfield-Mask: 0xff)          */
/* =========================================================  IMSC  ========================================================== */
#define MDR_SSP1_IMSC_RORIM_Pos           (0UL)                     /*!< MDR_SSP1 IMSC: RORIM (Bit 0)                          */
#define MDR_SSP1_IMSC_RORIM_Msk           (0x1UL)                   /*!< MDR_SSP1 IMSC: RORIM (Bitfield-Mask: 0x01)            */
#define MDR_SSP1_IMSC_RTIM_Pos            (1UL)                     /*!< MDR_SSP1 IMSC: RTIM (Bit 1)                           */
#define MDR_SSP1_IMSC_RTIM_Msk            (0x2UL)                   /*!< MDR_SSP1 IMSC: RTIM (Bitfield-Mask: 0x01)             */
#define MDR_SSP1_IMSC_RXIM_Pos            (2UL)                     /*!< MDR_SSP1 IMSC: RXIM (Bit 2)                           */
#define MDR_SSP1_IMSC_RXIM_Msk            (0x4UL)                   /*!< MDR_SSP1 IMSC: RXIM (Bitfield-Mask: 0x01)             */
#define MDR_SSP1_IMSC_TXIM_Pos            (3UL)                     /*!< MDR_SSP1 IMSC: TXIM (Bit 3)                           */
#define MDR_SSP1_IMSC_TXIM_Msk            (0x8UL)                   /*!< MDR_SSP1 IMSC: TXIM (Bitfield-Mask: 0x01)             */
/* ==========================================================  RIS  ========================================================== */
#define MDR_SSP1_RIS_RORRIS_Pos           (0UL)                     /*!< MDR_SSP1 RIS: RORRIS (Bit 0)                          */
#define MDR_SSP1_RIS_RORRIS_Msk           (0x1UL)                   /*!< MDR_SSP1 RIS: RORRIS (Bitfield-Mask: 0x01)            */
#define MDR_SSP1_RIS_RTRIS_Pos            (1UL)                     /*!< MDR_SSP1 RIS: RTRIS (Bit 1)                           */
#define MDR_SSP1_RIS_RTRIS_Msk            (0x2UL)                   /*!< MDR_SSP1 RIS: RTRIS (Bitfield-Mask: 0x01)             */
#define MDR_SSP1_RIS_RXRIS_Pos            (2UL)                     /*!< MDR_SSP1 RIS: RXRIS (Bit 2)                           */
#define MDR_SSP1_RIS_RXRIS_Msk            (0x4UL)                   /*!< MDR_SSP1 RIS: RXRIS (Bitfield-Mask: 0x01)             */
#define MDR_SSP1_RIS_TXRIS_Pos            (3UL)                     /*!< MDR_SSP1 RIS: TXRIS (Bit 3)                           */
#define MDR_SSP1_RIS_TXRIS_Msk            (0x8UL)                   /*!< MDR_SSP1 RIS: TXRIS (Bitfield-Mask: 0x01)             */
/* ==========================================================  MIS  ========================================================== */
#define MDR_SSP1_MIS_RORMIS_Pos           (0UL)                     /*!< MDR_SSP1 MIS: RORMIS (Bit 0)                          */
#define MDR_SSP1_MIS_RORMIS_Msk           (0x1UL)                   /*!< MDR_SSP1 MIS: RORMIS (Bitfield-Mask: 0x01)            */
#define MDR_SSP1_MIS_RTMIS_Pos            (1UL)                     /*!< MDR_SSP1 MIS: RTMIS (Bit 1)                           */
#define MDR_SSP1_MIS_RTMIS_Msk            (0x2UL)                   /*!< MDR_SSP1 MIS: RTMIS (Bitfield-Mask: 0x01)             */
#define MDR_SSP1_MIS_RXMIS_Pos            (2UL)                     /*!< MDR_SSP1 MIS: RXMIS (Bit 2)                           */
#define MDR_SSP1_MIS_RXMIS_Msk            (0x4UL)                   /*!< MDR_SSP1 MIS: RXMIS (Bitfield-Mask: 0x01)             */
#define MDR_SSP1_MIS_TXMIS_Pos            (3UL)                     /*!< MDR_SSP1 MIS: TXMIS (Bit 3)                           */
#define MDR_SSP1_MIS_TXMIS_Msk            (0x8UL)                   /*!< MDR_SSP1 MIS: TXMIS (Bitfield-Mask: 0x01)             */
/* ==========================================================  ICR  ========================================================== */
#define MDR_SSP1_ICR_RORIC_Pos            (0UL)                     /*!< MDR_SSP1 ICR: RORIC (Bit 0)                           */
#define MDR_SSP1_ICR_RORIC_Msk            (0x1UL)                   /*!< MDR_SSP1 ICR: RORIC (Bitfield-Mask: 0x01)             */
#define MDR_SSP1_ICR_RTIC_Pos             (1UL)                     /*!< MDR_SSP1 ICR: RTIC (Bit 1)                            */
#define MDR_SSP1_ICR_RTIC_Msk             (0x2UL)                   /*!< MDR_SSP1 ICR: RTIC (Bitfield-Mask: 0x01)              */
/* =========================================================  DMACR  ========================================================= */
#define MDR_SSP1_DMACR_RXDMAE_Pos         (0UL)                     /*!< MDR_SSP1 DMACR: RXDMAE (Bit 0)                        */
#define MDR_SSP1_DMACR_RXDMAE_Msk         (0x1UL)                   /*!< MDR_SSP1 DMACR: RXDMAE (Bitfield-Mask: 0x01)          */
#define MDR_SSP1_DMACR_TXDMAE_Pos         (1UL)                     /*!< MDR_SSP1 DMACR: TXDMAE (Bit 1)                        */
#define MDR_SSP1_DMACR_TXDMAE_Msk         (0x2UL)                   /*!< MDR_SSP1 DMACR: TXDMAE (Bitfield-Mask: 0x01)          */


/* =========================================================================================================================== */
/* ================                                         MDR_UART1                                         ================ */
/* =========================================================================================================================== */

