StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
#define MDR_UART1_ICR_OE_IC_Msk           (0x400UL)                 /*!< MDR_UART1 ICR: OE_IC (Bitfield-Mask: 0x01)            */
/* =========================================================  DMACR  ========================================================= */
#define MDR_UART1_DMACR_RXDMAE_Pos        (0UL)                     /*!< MDR_UART1 DMACR: RXDMAE (Bit 0)                       */
#define MDR_UART1_DMACR_RXDMAE_Msk        (0x1UL)                   /*!< MDR_UART1 DMACR: RXDMAE (Bitfield-Mask: 0x01)         */
#define MDR_UART1_DMACR_TXDMAE_Pos        (1UL)                     /*!< MDR_UART1 DMACR: TXDMAE (Bit 1)                       */
#define MDR_UART1_DMACR_TXDMAE_Msk        (0x2UL)                   /*!< MDR_UART1 DMACR: TXDMAE (Bitfield-Mask: 0x01)         */
#define MDR_UART1_DMACR_DMAonErr_Pos      (2UL)                     /*!< MDR_UART1 DMACR: DMAonErr (Bit 2)                     */
#define MDR_UART1_DMACR_DMAonErr_Msk      (0x4UL)                   /*!< MDR_UART1 DMACR: DMAonErr (Bitfield-Mask: 0x01)       */
/* ==========================================================  TCR  ========================================================== */
#define MDR_UART1_TCR_ITEN_Pos            (0UL)                     /*!< MDR_UART1 TCR: ITEN (Bit 0)                           */
#define MDR_UART1_TCR_ITEN_Msk            (0x1UL)                   /*!< MDR_UART1 TCR: ITEN (Bitfield-Mask: 0x01)             */
#define MDR_UART1_TCR_TestFIFO_Pos        (1UL)                     /*!< MDR_UART1 TCR: TestFIFO (Bit 1)                       */
#define MDR_UART1_TCR_TestFIFO_Msk        (0x2UL)                   /*!< MDR_UART1 TCR: TestFIFO (Bitfield-Mask: 0x01)         */
#define MDR_UART1_TCR_SIRTest_Pos         (2UL)                     /*!< MDR_UART1 TCR: SIRTest (Bit 2)                        */
#define MDR_UART1_TCR_SIRTest_Msk         (0x4UL)                   /*!< MDR_UART1 TCR: SIRTest (Bitfield-Mask: 0x01)          */


/* =========================================================================================================================== */
/* ================                                          MDR_DMA                                          ================ */
/* =========================================================================================================================== */

/* ========================================================  STATUS  ========================================================= */
#define MDR_DMA_STATUS_Enable_Pos         (0UL)                     /*!< MDR_DMA STATUS: Enable (Bit 0)                        */
#define MDR_DMA_STATUS_Enable_Msk         (0x1UL)                   /*!< MDR_DMA STATUS: Enable (Bitfield-Mask: 0x01)          */
#define MDR_DMA_STATUS_State_Pos          (4UL)                     /*!< MDR_DMA STATUS: State (Bit 4)                         */
#define MDR_DMA_STATUS_State_Msk          (0xf0UL)                  /*!< MDR_DMA STATUS: State (Bitfield-Mask: 0x0f)           */
#define MDR_DMA_STATUS_Chnls_minus1_Pos   (16UL)                    /*!< MDR_DMA STATUS: Chnls_minus1 (Bit 16)                 */
#define MDR_DMA_STATUS_Chnls_minus1_Msk   (0x1f0000UL)              /*!< MDR_DMA STATUS: Chnls_minus1 (Bitfield-Mask: 0x1f)    */
#define MDR_DMA_STATUS_test_status_Pos    (28UL)                    /*!< MDR_DMA STATUS: test_status (Bit 28)                  */
#define MDR_DMA_STATUS_test_status_Msk    (0x10000000UL)            /*!< MDR_DMA STATUS: test_status (Bitfield-Mask: 0x01)     */
/* ==========================================================  CFG  ========================================================== */
#define MDR_DMA_CFG_Enable_Pos            (0UL)                     /*!< MDR_DMA CFG: Enable (Bit 0)                           */
#define MDR_DMA_CFG_Enable_Msk            (0x1UL)                   /*!< MDR_DMA CFG: Enable (Bitfield-Mask: 0x01)             */
#define MDR_DMA_CFG_Privileged_Pos        (5UL)                     /*!< MDR_DMA CFG: Privileged (Bit 5)                       */
#define MDR_DMA_CFG_Privileged_Msk        (0x20UL)                  /*!< MDR_DMA CFG: Privileged (Bitfield-Mask: 0x01)         */
#define MDR_DMA_CFG_Bufferable_Pos        (6UL)                     /*!< MDR_DMA CFG: Bufferable (Bit 6)                       */
#define MDR_DMA_CFG_Bufferable_Msk        (0x40UL)                  /*!< MDR_DMA CFG: Bufferable (Bitfield-Mask: 0x01)         */
#define MDR_DMA_CFG_Cachable_Pos          (7UL)                     /*!< MDR_DMA CFG: Cachable (Bit 7)                         */
#define MDR_DMA_CFG_Cachable_Msk          (0x80UL)                  /*!< MDR_DMA CFG: Cachable (Bitfield-Mask: 0x01)           */
/* =====================================================  CTRL_BASE_PTR  ===================================================== */
#define MDR_DMA_CTRL_BASE_PTR_Addr_Hi_Pos (10UL)                    /*!< MDR_DMA CTRL_BASE_PTR: Addr_Hi (Bit 10)               */
#define MDR_DMA_CTRL_BASE_PTR_Addr_Hi_Msk (0xfffffc00UL)            /*!< MDR_DMA CTRL_BASE_PTR: Addr_Hi (Bitfield-Mask: 0x3fffff) */
/* ===================================================  ALT_CTRL_BASE_PTR  =================================================== */
#define MDR_DMA_ALT_CTRL_BASE_PTR_Addr_Pos (0UL)                    /*!< MDR_DMA ALT_CTRL_BASE_PTR: Addr (Bit 0)               */
#define MDR_DMA_ALT_CTRL_BASE_PTR_Addr_Msk (0xffffffffUL)           /*!< MDR_DMA ALT_CTRL_BASE_PTR: Addr (Bitfield-Mask: 0xffffffff) */
/* ===================================================  WAITONREQ_STATUS  ==================================================== */
#define MDR_DMA_WAITONREQ_STATUS_Ch__Pos  (0UL)                     /*!< MDR_DMA WAITONREQ_STATUS: Ch_ (Bit 0)                 */
#define MDR_DMA_WAITONREQ_STATUS_Ch__Msk  (0x1UL)                   /*!< MDR_DMA WAITONREQ_STATUS: Ch_ (Bitfield-Mask: 0x01)   */
/* ====================================================  CHNL_SW_REQUEST  ==================================================== */
#define MDR_DMA_CHNL_SW_REQUEST_Ch__Pos   (0UL)                     /*!< MDR_DMA CHNL_SW_REQUEST: Ch_ (Bit 0)                  */
#define MDR_DMA_CHNL_SW_REQUEST_Ch__Msk   (0x1UL)                   /*!< MDR_DMA CHNL_SW_REQUEST: Ch_ (Bitfield-Mask: 0x01)    */
/* ===================================================  CHNL_USEBURST_SET  =================================================== */
#define MDR_DMA_CHNL_USEBURST_SET_Ch__Pos (0UL)                     /*!< MDR_DMA CHNL_USEBURST_SET: Ch_ (Bit 0)                */
#define MDR_DMA_CHNL_USEBURST_SET_Ch__Msk (0x1UL)                   /*!< MDR_DMA CHNL_USEBURST_SET: Ch_ (Bitfield-Mask: 0x01)  */
/* ===================================================  CHNL_USEBURST_CLR  =================================================== */
#define MDR_DMA_CHNL_USEBURST_CLR_Ch__Pos (0UL)                     /*!< MDR_DMA CHNL_USEBURST_CLR: Ch_ (Bit 0)                */
#define MDR_DMA_CHNL_USEBURST_CLR_Ch__Msk (0x1UL)                   /*!< MDR_DMA CHNL_USEBURST_CLR: Ch_ (Bitfield-Mask: 0x01)  */
/* ===================================================  CHNL_REQ_MASK_SET  =================================================== */
#define MDR_DMA_CHNL_REQ_MASK_SET_Ch__Pos (0UL)                     /*!< MDR_DMA CHNL_REQ_MASK_SET: Ch_ (Bit 0)                */
#define MDR_DMA_CHNL_REQ_MASK_SET_Ch__Msk (0x1UL)                   /*!< MDR_DMA CHNL_REQ_MASK_SET: Ch_ (Bitfield-Mask: 0x01)  */
/* ===================================================  CHNL_REQ_MASK_CLR  =================================================== */
#define MDR_DMA_CHNL_REQ_MASK_CLR_Ch__Pos (0UL)                     /*!< MDR_DMA CHNL_REQ_MASK_CLR: Ch_ (Bit 0)                */
#define MDR_DMA_CHNL_REQ_MASK_CLR_Ch__Msk (0x1UL)                   /*!< MDR_DMA CHNL_REQ_MASK_CLR: Ch_ (Bitfield-Mask: 0x01)  */
/* ====================================================  CHNL_ENABLE_SET  ==================================================== */
#define MDR_DMA_CHNL_ENABLE_SET_Ch__Pos   (0UL)                     /*!< MDR_DMA CHNL_ENABLE_SET: Ch_ (Bit 0)                  */
#define MDR_DMA_CHNL_ENABLE_SET_Ch__Msk   (0x1UL)                   /*!< MDR_DMA CHNL_ENABLE_SET: Ch_ (Bitfield-Mask: 0x01)    */
/* ====================================================  CHNL_ENABLE_CLR  ==================================================== */
#define MDR_DMA_CHNL_ENABLE_CLR_Ch__Pos   (0UL)                     /*!< MDR_DMA CHNL_ENABLE_CLR: Ch_ (Bit 0)                  */
#define MDR_DMA_CHNL_ENABLE_CLR_Ch__Msk   (0x1UL)                   /*!< MDR_DMA CHNL_ENABLE_CLR: Ch_ (Bitfield-Mask: 0x01)    */
/* ===================================================  CHNL_PRI_ALT_SET  ==================================================== */
#define MDR_DMA_CHNL_PRI_ALT_SET_Ch__Pos  (0UL)                     /*!< MDR_DMA CHNL_PRI_ALT_SET: Ch_ (Bit 0)                 */
#define MDR_DMA_CHNL_PRI_ALT_SET_Ch__Msk  (0x1UL)                   /*!< MDR_DMA CHNL_PRI_ALT_SET: Ch_ (Bitfield-Mask: 0x01)   */
/* ===================================================  CHNL_PRI_ALT_CLR  ==================================================== */
#define MDR_DMA_CHNL_PRI_ALT_CLR_Ch__Pos  (0UL)                     /*!< MDR_DMA CHNL_PRI_ALT_CLR: Ch_ (Bit 0)                 */
#define MDR_DMA_CHNL_PRI_ALT_CLR_Ch__Msk  (0x1UL)                   /*!< MDR_DMA CHNL_PRI_ALT_CLR: Ch_ (Bitfield-Mask: 0x01)   */
/* ===================================================  CHNL_PRIORITY_SET  =================================================== */
#define MDR_DMA_CHNL_PRIORITY_SET_Ch__Pos (0UL)                     /*!< MDR_DMA CHNL_PRIORITY_SET: Ch_ (Bit 0)                */
#define MDR_DMA_CHNL_PRIORITY_SET_Ch__Msk (0x1UL)                   /*!< MDR_DMA CHNL_PRIORITY_SET: Ch_ (Bitfield-Mask: 0x01)  */
/* ===================================================  CHNL_PRIORITY_CLR  =================================================== */
#define MDR_DMA_CHNL_PRIORITY_CLR_Ch__Pos (0UL)                     /*!< MDR_DMA CHNL_PRIORITY_CLR: Ch_ (Bit 0)                */
#define MDR_DMA_CHNL_PRIORITY_CLR_Ch__Msk (0x1UL)                   /*!< MDR_DMA CHNL_PRIORITY_CLR: Ch_ (Bitfield-Mask: 0x01)  */
/* ========================================================  ERR_CLR  ======================================================== */
#define MDR_DMA_ERR_CLR_Ch__Pos           (0UL)                     /*!< MDR_DMA ERR_CLR: Ch_ (Bit 0)                          */
#define MDR_DMA_ERR_CLR_Ch__Msk           (0x1UL)                   /*!< MDR_DMA ERR_CLR: Ch_ (Bitfield-Mask: 0x01)            */
/* ========================================================  CHMUX0  ========================================================= */
#define MDR_DMA_CHMUX0_CH0_Sel_Pos        (0UL)                     /*!< MDR_DMA CHMUX0: CH0_Sel (Bit 0)                       */
#define MDR_DMA_CHMUX0_CH0_Sel_Msk        (0xffUL)                  /*!< MDR_DMA CHMUX0: CH0_Sel (Bitfield-Mask: 0xff)         */
#define MDR_DMA_CHMUX0_CH1_Sel_Pos        (8UL)                     /*!< MDR_DMA CHMUX0: CH1_Sel (Bit 8)                       */
#define MDR_DMA_CHMUX0_CH1_Sel_Msk        (0xff00UL)                /*!< MDR_DMA CHMUX0: CH1_Sel (Bitfield-Mask: 0xff)         */
#define MDR_DMA_CHMUX0_CH2_Sel_Pos        (16UL)                    /*!< MDR_DMA CHMUX0: CH2_Sel (Bit 16)                      */
#define MDR_DMA_CHMUX0_CH2_Sel_Msk        (0xff0000UL)              /*!< MDR_DMA CHMUX0: CH2_Sel (Bitfield-Mask: 0xff)         */
#define MDR_DMA_CHMUX0_CH3_Sel_Pos        (24UL)                    /*!< MDR_DMA CHMUX0: CH3_Sel (Bit 24)                      */
#define MDR_DMA_CHMUX0_CH3_Sel_Msk        (0xff000000UL)            /*!< MDR_DMA CHMUX0: CH3_Sel (Bitfield-Mask: 0xff)         */
/* ========================================================  CHMUX1  ========================================================= */
#define MDR_DMA_CHMUX1_CH4_Sel_Pos        (0UL)                     /*!< MDR_DMA CHMUX1: CH4_Sel (Bit 0)                       */
#define MDR_DMA_CHMUX1_CH4_Sel_Msk        (0xffUL)                  /*!< MDR_DMA CHMUX1: CH4_Sel (Bitfield-Mask: 0xff)         */
#define MDR_DMA_CHMUX1_CH5_Sel_Pos        (8UL)                     /*!< MDR_DMA CHMUX1: CH5_Sel (Bit 8)                       */
#define MDR_DMA_CHMUX1_CH5_Sel_Msk        (0xff00UL)                /*!< MDR_DMA CHMUX1: CH5_Sel (Bitfield-Mask: 0xff)         */
#define MDR_DMA_CHMUX1_CH6_Sel_Pos        (16UL)                    /*!< MDR_DMA CHMUX1: CH6_Sel (Bit 16)                      */
#define MDR_DMA_CHMUX1_CH6_Sel_Msk        (0xff0000UL)              /*!< MDR_DMA CHMUX1: CH6_Sel (Bitfield-Mask: 0xff)         */
#define MDR_DMA_CHMUX1_CH7_Sel_Pos        (24UL)                    /*!< MDR_DMA CHMUX1: CH7_Sel (Bit 24)                      */
#define MDR_DMA_CHMUX1_CH7_Sel_Msk        (0xff000000UL)            /*!< MDR_DMA CHMUX1: CH7_Sel (Bitfield-Mask: 0xff)         */
/* ========================================================  CHMUX2  ========================================================= */
#define MDR_DMA_CHMUX2_CH8_Sel_Pos        (0UL)                     /*!< MDR_DMA CHMUX2: CH8_Sel (Bit 0)                       */
#define MDR_DMA_CHMUX2_CH8_Sel_Msk        (0xffUL)                  /*!< MDR_DMA CHMUX2: CH8_Sel (Bitfield-Mask: 0xff)         */
#define MDR_DMA_CHMUX2_CH9_Sel_Pos        (8UL)                     /*!< MDR_DMA CHMUX2: CH9_Sel (Bit 8)                       */
#define MDR_DMA_CHMUX2_CH9_Sel_Msk        (0xff00UL)                /*!< MDR_DMA CHMUX2: CH9_Sel (Bitfield-Mask: 0xff)         */
#define MDR_DMA_CHMUX2_CH10_Sel_Pos       (16UL)                    /*!< MDR_DMA CHMUX2: CH10_Sel (Bit 16)                     */
#define MDR_DMA_CHMUX2_CH10_Sel_Msk       (0xff0000UL)              /*!< MDR_DMA CHMUX2: CH10_Sel (Bitfield-Mask: 0xff)        */
#define MDR_DMA_CHMUX2_CH11_Sel_Pos       (24UL)                    /*!< MDR_DMA CHMUX2: CH11_Sel (Bit 24)                     */
#define MDR_DMA_CHMUX2_CH11_Sel_Msk       (0xff000000UL)            /*!< MDR_DMA CHMUX2: CH11_Sel (Bitfield-Mask: 0xff)        */
/* ========================================================  CHMUX3  ========================================================= */
#define MDR_DMA_CHMUX3_CH12_Sel_Pos       (0UL)                     /*!< MDR_DMA CHMUX3: CH12_Sel (Bit 0)                      */
#define MDR_DMA_CHMUX3_CH12_Sel_Msk       (0xffUL)                  /*!< MDR_DMA CHMUX3: CH12_Sel (Bitfield-Mask: 0xff)        */
#define MDR_DMA_CHMUX3_CH13_Sel_Pos       (8UL)                     /*!< MDR_DMA CHMUX3: CH13_Sel (Bit 8)                      */
#define MDR_DMA_CHMUX3_CH13_Sel_Msk       (0xff00UL)                /*!< MDR_DMA CHMUX3: CH13_Sel (Bitfield-Mask: 0xff)        */
#define MDR_DMA_CHMUX3_CH14_Sel_Pos       (16UL)                    /*!< MDR_DMA CHMUX3: CH14_Sel (Bit 16)                     */
#define MDR_DMA_CHMUX3_CH14_Sel_Msk       (0xff0000UL)              /*!< MDR_DMA CHMUX3: CH14_Sel (Bitfield-Mask: 0xff)        */
#define MDR_DMA_CHMUX3_CH15_Sel_Pos       (24UL)                    /*!< MDR_DMA CHMUX3: CH15_Sel (Bit 24)                     */
#define MDR_DMA_CHMUX3_CH15_Sel_Msk       (0xff000000UL)            /*!< MDR_DMA CHMUX3: CH15_Sel (Bitfield-Mask: 0xff)        */
/* ========================================================  CHMUX4  ========================================================= */
#define MDR_DMA_CHMUX4_CH16_Sel_Pos       (0UL)                     /*!< MDR_DMA CHMUX4: CH16_Sel (Bit 0)                      */
#define MDR_DMA_CHMUX4_CH16_Sel_Msk       (0xffUL)                  /*!< MDR_DMA CHMUX4: CH16_Sel (Bitfield-Mask: 0xff)        */
#define MDR_DMA_CHMUX4_CH17_Sel_Pos       (8UL)                     /*!< MDR_DMA CHMUX4: CH17_Sel (Bit 8)                      */
#define MDR_DMA_CHMUX4_CH17_Sel_Msk       (0xff00UL)                /*!< MDR_DMA CHMUX4: CH17_Sel (Bitfield-Mask: 0xff)        */
#define MDR_DMA_CHMUX4_CH18_Sel_Pos       (16UL)                    /*!< MDR_DMA CHMUX4: CH18_Sel (Bit 16)                     */
#define MDR_DMA_CHMUX4_CH18_Sel_Msk       (0xff0000UL)              /*!< MDR_DMA CHMUX4: CH18_Sel (Bitfield-Mask: 0xff)        */
#define MDR_DMA_CHMUX4_CH19_Sel_Pos       (24UL)                    /*!< MDR_DMA CHMUX4: CH19_Sel (Bit 24)                     */
#define MDR_DMA_CHMUX4_CH19_Sel_Msk       (0xff000000UL)            /*!< MDR_DMA CHMUX4: CH19_Sel (Bitfield-Mask: 0xff)        */
/* ========================================================  CHMUX5  ========================================================= */
#define MDR_DMA_CHMUX5_CH20_Sel_Pos       (0UL)                     /*!< MDR_DMA CHMUX5: CH20_Sel (Bit 0)                      */
#define MDR_DMA_CHMUX5_CH20_Sel_Msk       (0xffUL)                  /*!< MDR_DMA CHMUX5: CH20_Sel (Bitfield-Mask: 0xff)        */
#define MDR_DMA_CHMUX5_CH21_Sel_Pos       (8UL)                     /*!< MDR_DMA CHMUX5: CH21_Sel (Bit 8)                      */
#define MDR_DMA_CHMUX5_CH21_Sel_Msk       (0xff00UL)                /*!< MDR_DMA CHMUX5: CH21_Sel (Bitfield-Mask: 0xff)        */
#define MDR_DMA_CHMUX5_CH22_Sel_Pos       (16UL)                    /*!< MDR_DMA CHMUX5: CH22_Sel (Bit 16)                     */
#define MDR_DMA_CHMUX5_CH22_Sel_Msk       (0xff0000UL)              /*!< MDR_DMA CHMUX5: CH22_Sel (Bitfield-Mask: 0xff)        */
#define MDR_DMA_CHMUX5_CH23_Sel_Pos       (24UL)                    /*!< MDR_DMA CHMUX5: CH23_Sel (Bit 24)                     */
#define MDR_DMA_CHMUX5_CH23_Sel_Msk       (0xff000000UL)            /*!< MDR_DMA CHMUX5: CH23_Sel (Bitfield-Mask: 0xff)        */
/* ========================================================  CHMUX6  ========================================================= */
#define MDR_DMA_CHMUX6_CH24_Sel_Pos       (0UL)                     /*!< MDR_DMA CHMUX6: CH24_Sel (Bit 0)                      */
#define MDR_DMA_CHMUX6_CH24_Sel_Msk       (0xffUL)                  /*!< MDR_DMA CHMUX6: CH24_Sel (Bitfield-Mask: 0xff)        */
#define MDR_DMA_CHMUX6_CH25_Sel_Pos       (8UL)                     /*!< MDR_DMA CHMUX6: CH25_Sel (Bit 8)                      */
#define MDR_DMA_CHMUX6_CH25_Sel_Msk       (0xff00UL)                /*!< MDR_DMA CHMUX6: CH25_Sel (Bitfield-Mask: 0xff)        */
#define MDR_DMA_CHMUX6_CH26_Sel_Pos       (16UL)                    /*!< MDR_DMA CHMUX6: CH26_Sel (Bit 16)                     */
#define MDR_DMA_CHMUX6_CH26_Sel_Msk       (0xff0000UL)              /*!< MDR_DMA CHMUX6: CH26_Sel (Bitfield-Mask: 0xff)        */
#define MDR_DMA_CHMUX6_CH27_Sel_Pos       (24UL)                    /*!< MDR_DMA CHMUX6: CH27_Sel (Bit 24)                     */
#define MDR_DMA_CHMUX6_CH27_Sel_Msk       (0xff000000UL)            /*!< MDR_DMA CHMUX6: CH27_Sel (Bitfield-Mask: 0xff)        */
/* ========================================================  CHMUX7  ========================================================= */
#define MDR_DMA_CHMUX7_CH28_Sel_Pos       (0UL)                     /*!< MDR_DMA CHMUX7: CH28_Sel (Bit 0)                      */
#define MDR_DMA_CHMUX7_CH28_Sel_Msk       (0xffUL)                  /*!< MDR_DMA CHMUX7: CH28_Sel (Bitfield-Mask: 0xff)        */
#define MDR_DMA_CHMUX7_CH29_Sel_Pos       (8UL)                     /*!< MDR_DMA CHMUX7: CH29_Sel (Bit 8)                      */
#define MDR_DMA_CHMUX7_CH29_Sel_Msk       (0xff00UL)                /*!< MDR_DMA CHMUX7: CH29_Sel (Bitfield-Mask: 0xff)        */
#define MDR_DMA_CHMUX7_CH30_Sel_Pos       (16UL)                    /*!< MDR_DMA CHMUX7: CH30_Sel (Bit 16)                     */
#define MDR_DMA_CHMUX7_CH30_Sel_Msk       (0xff0000UL)              /*!< MDR_DMA CHMUX7: CH30_Sel (Bitfield-Mask: 0xff)        */
#define MDR_DMA_CHMUX7_CH31_Sel_Pos       (24UL)                    /*!< MDR_DMA CHMUX7: CH31_Sel (Bit 24)                     */
#define MDR_DMA_CHMUX7_CH31_Sel_Msk       (0xff000000UL)            /*!< MDR_DMA CHMUX7: CH31_Sel (Bitfield-Mask: 0xff)        */

/** @} */ /* End of group PosMask_peripherals */


/* =========================================================================================================================== */
/* ================                           Enumerated Values Peripheral Section                            ================ */
/* =========================================================================================================================== */


/** @addtogroup EnumValue_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                       MDR_RST_CLOCK                                       ================ */
/* =========================================================================================================================== */

/* ==========================================================  KEY  ========================================================== */
/* ========================================================  MAX_CLK  ======================================================== */
/* ==========================================  MDR_RST_CLOCK MAX_CLK Select [0..3]  ========================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_MAX_CLK_Select                                              */
  MDR_RST_CLOCK_MAX_CLK_Select_HSI     = 0,     /*!< HSI : MAX_CLOCK is HSI                                                    */
  MDR_RST_CLOCK_MAX_CLK_Select_HSI_div2 = 1,    /*!< HSI_div2 : MAX_CLOCK is HSI/2                                             */
  MDR_RST_CLOCK_MAX_CLK_Select_HSE0    = 2,     /*!< HSE0 : MAX_CLOCK is HSE0                                                  */
  MDR_RST_CLOCK_MAX_CLK_Select_HSE0_div2 = 3,   /*!< HSE0_div2 : MAX_CLOCK is HSE0/2                                           */
  MDR_RST_CLOCK_MAX_CLK_Select_HSE1    = 4,     /*!< HSE1 : MAX_CLOCK is HSE1                                                  */
  MDR_RST_CLOCK_MAX_CLK_Select_HSE1_div2 = 5,   /*!< HSE1_div2 : MAX_CLOCK is HSE1/2                                           */
  MDR_RST_CLOCK_MAX_CLK_Select_LSI     = 6,     /*!< LSI : MAX_CLOCK is LSI                                                    */
  MDR_RST_CLOCK_MAX_CLK_Select_LSE     = 7,     /*!< LSE : MAX_CLOCK is LSE                                                    */
  MDR_RST_CLOCK_MAX_CLK_Select_PLL0    = 8,     /*!< PLL0 : MAX_CLOCK is PLL0                                                  */
  MDR_RST_CLOCK_MAX_CLK_Select_PLL1    = 9,     /*!< PLL1 : MAX_CLOCK is PLL1                                                  */
  MDR_RST_CLOCK_MAX_CLK_Select_PLL2    = 10,    /*!< PLL2 : MAX_CLOCK is PLL2                                                  */
} MDR_RST_CLOCK_MAX_CLK_Select_Enum;

/* ========================================================  CPU_CLK  ======================================================== */
/* =====================================  MDR_RST_CLOCK CPU_CLK EN_CHK_EVENT0 [16..16]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_CPU_CLK_EN_CHK_EVENT0                                       */
  MDR_RST_CLOCK_CPU_CLK_EN_CHK_EVENT0_Off = 0,  /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_CPU_CLK_EN_CHK_EVENT0_On = 1,   /*!< On : Enable                                                               */
} MDR_RST_CLOCK_CPU_CLK_EN_CHK_EVENT0_Enum;

