StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* =====================================  MDR_RST_CLOCK PER0_CLK PortB_CLK_EN [14..14]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER0_CLK_PortB_CLK_EN                                       */
  MDR_RST_CLOCK_PER0_CLK_PortB_CLK_EN_Off = 0,  /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_PER0_CLK_PortB_CLK_EN_On = 1,   /*!< On : Enable                                                               */
} MDR_RST_CLOCK_PER0_CLK_PortB_CLK_EN_Enum;

/* =====================================  MDR_RST_CLOCK PER0_CLK PortC_CLK_EN [15..15]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER0_CLK_PortC_CLK_EN                                       */
  MDR_RST_CLOCK_PER0_CLK_PortC_CLK_EN_Off = 0,  /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_PER0_CLK_PortC_CLK_EN_On = 1,   /*!< On : Enable                                                               */
} MDR_RST_CLOCK_PER0_CLK_PortC_CLK_EN_Enum;

/* =====================================  MDR_RST_CLOCK PER0_CLK PortD_CLK_EN [16..16]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER0_CLK_PortD_CLK_EN                                       */
  MDR_RST_CLOCK_PER0_CLK_PortD_CLK_EN_Off = 0,  /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_PER0_CLK_PortD_CLK_EN_On = 1,   /*!< On : Enable                                                               */
} MDR_RST_CLOCK_PER0_CLK_PortD_CLK_EN_Enum;

/* =====================================  MDR_RST_CLOCK PER0_CLK PortE_CLK_EN [17..17]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER0_CLK_PortE_CLK_EN                                       */
  MDR_RST_CLOCK_PER0_CLK_PortE_CLK_EN_Off = 0,  /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_PER0_CLK_PortE_CLK_EN_On = 1,   /*!< On : Enable                                                               */
} MDR_RST_CLOCK_PER0_CLK_PortE_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER0_CLK SPW1_CLK_EN [21..21]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER0_CLK_SPW1_CLK_EN                                        */
  MDR_RST_CLOCK_PER0_CLK_SPW1_CLK_EN_Off = 0,   /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_PER0_CLK_SPW1_CLK_EN_On = 1,    /*!< On : Enable                                                               */
} MDR_RST_CLOCK_PER0_CLK_SPW1_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER0_CLK TIM1_CLK_EN [23..23]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER0_CLK_TIM1_CLK_EN                                        */
  MDR_RST_CLOCK_PER0_CLK_TIM1_CLK_EN_Off = 0,   /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_PER0_CLK_TIM1_CLK_EN_On = 1,    /*!< On : Enable                                                               */
} MDR_RST_CLOCK_PER0_CLK_TIM1_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER0_CLK TIM2_CLK_EN [24..24]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER0_CLK_TIM2_CLK_EN                                        */
  MDR_RST_CLOCK_PER0_CLK_TIM2_CLK_EN_Off = 0,   /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_PER0_CLK_TIM2_CLK_EN_On = 1,    /*!< On : Enable                                                               */
} MDR_RST_CLOCK_PER0_CLK_TIM2_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER0_CLK TIM3_CLK_EN [25..25]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER0_CLK_TIM3_CLK_EN                                        */
  MDR_RST_CLOCK_PER0_CLK_TIM3_CLK_EN_Off = 0,   /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_PER0_CLK_TIM3_CLK_EN_On = 1,    /*!< On : Enable                                                               */
} MDR_RST_CLOCK_PER0_CLK_TIM3_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER0_CLK TIM4_CLK_EN [26..26]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER0_CLK_TIM4_CLK_EN                                        */
  MDR_RST_CLOCK_PER0_CLK_TIM4_CLK_EN_Off = 0,   /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_PER0_CLK_TIM4_CLK_EN_On = 1,    /*!< On : Enable                                                               */
} MDR_RST_CLOCK_PER0_CLK_TIM4_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER0_CLK CAN1_CLK_EN [29..29]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER0_CLK_CAN1_CLK_EN                                        */
  MDR_RST_CLOCK_PER0_CLK_CAN1_CLK_EN_Off = 0,   /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_PER0_CLK_CAN1_CLK_EN_On = 1,    /*!< On : Enable                                                               */
} MDR_RST_CLOCK_PER0_CLK_CAN1_CLK_EN_Enum;

/* =======================================================  PER1_CLK  ======================================================== */
/* =======================================  MDR_RST_CLOCK PER1_CLK SSP1_CLK_EN [2..2]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER1_CLK_SSP1_CLK_EN                                        */
  MDR_RST_CLOCK_PER1_CLK_SSP1_CLK_EN_Off = 0,   /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_PER1_CLK_SSP1_CLK_EN_On = 1,    /*!< On : Enable                                                               */
} MDR_RST_CLOCK_PER1_CLK_SSP1_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER1_CLK UART1_CLK_EN [6..6]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER1_CLK_UART1_CLK_EN                                       */
  MDR_RST_CLOCK_PER1_CLK_UART1_CLK_EN_Off = 0,  /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_PER1_CLK_UART1_CLK_EN_On = 1,   /*!< On : Enable                                                               */
} MDR_RST_CLOCK_PER1_CLK_UART1_CLK_EN_Enum;

