StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* ======================================  MDR_RST_CLOCK PER1_CLK UART2_CLK_EN [7..7]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER1_CLK_UART2_CLK_EN                                       */
  MDR_RST_CLOCK_PER1_CLK_UART2_CLK_EN_Off = 0,  /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_PER1_CLK_UART2_CLK_EN_On = 1,   /*!< On : Enable                                                               */
} MDR_RST_CLOCK_PER1_CLK_UART2_CLK_EN_Enum;

/* ====================================  MDR_RST_CLOCK PER1_CLK ARINK_RX_CLK_EN [11..11]  ==================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER1_CLK_ARINK_RX_CLK_EN                                    */
  MDR_RST_CLOCK_PER1_CLK_ARINK_RX_CLK_EN_Off = 0,/*!< Off : Disable                                                            */
  MDR_RST_CLOCK_PER1_CLK_ARINK_RX_CLK_EN_On = 1,/*!< On : Enable                                                               */
} MDR_RST_CLOCK_PER1_CLK_ARINK_RX_CLK_EN_Enum;

/* ====================================  MDR_RST_CLOCK PER1_CLK ARINK_TX_CLK_EN [13..13]  ==================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER1_CLK_ARINK_TX_CLK_EN                                    */
  MDR_RST_CLOCK_PER1_CLK_ARINK_TX_CLK_EN_Off = 0,/*!< Off : Disable                                                            */
  MDR_RST_CLOCK_PER1_CLK_ARINK_TX_CLK_EN_On = 1,/*!< On : Enable                                                               */
} MDR_RST_CLOCK_PER1_CLK_ARINK_TX_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER1_CLK MIL1_CLK_EN [19..19]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER1_CLK_MIL1_CLK_EN                                        */
  MDR_RST_CLOCK_PER1_CLK_MIL1_CLK_EN_Off = 0,   /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_PER1_CLK_MIL1_CLK_EN_On = 1,    /*!< On : Enable                                                               */
} MDR_RST_CLOCK_PER1_CLK_MIL1_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER1_CLK MIL2_CLK_EN [21..21]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER1_CLK_MIL2_CLK_EN                                        */
  MDR_RST_CLOCK_PER1_CLK_MIL2_CLK_EN_Off = 0,   /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_PER1_CLK_MIL2_CLK_EN_On = 1,    /*!< On : Enable                                                               */
} MDR_RST_CLOCK_PER1_CLK_MIL2_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER1_CLK ADC1_CLK_EN [23..23]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER1_CLK_ADC1_CLK_EN                                        */
  MDR_RST_CLOCK_PER1_CLK_ADC1_CLK_EN_Off = 0,   /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_PER1_CLK_ADC1_CLK_EN_On = 1,    /*!< On : Enable                                                               */
} MDR_RST_CLOCK_PER1_CLK_ADC1_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER1_CLK ADC2_CLK_EN [24..24]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER1_CLK_ADC2_CLK_EN                                        */
  MDR_RST_CLOCK_PER1_CLK_ADC2_CLK_EN_Off = 0,   /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_PER1_CLK_ADC2_CLK_EN_On = 1,    /*!< On : Enable                                                               */
} MDR_RST_CLOCK_PER1_CLK_ADC2_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER1_CLK DAC1_CLK_EN [25..25]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER1_CLK_DAC1_CLK_EN                                        */
  MDR_RST_CLOCK_PER1_CLK_DAC1_CLK_EN_Off = 0,   /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_PER1_CLK_DAC1_CLK_EN_On = 1,    /*!< On : Enable                                                               */
} MDR_RST_CLOCK_PER1_CLK_DAC1_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER1_CLK DAC2_CLK_EN [26..26]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER1_CLK_DAC2_CLK_EN                                        */
  MDR_RST_CLOCK_PER1_CLK_DAC2_CLK_EN_Off = 0,   /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_PER1_CLK_DAC2_CLK_EN_On = 1,    /*!< On : Enable                                                               */
} MDR_RST_CLOCK_PER1_CLK_DAC2_CLK_EN_Enum;

/* =======================================================  CPU_CHK0  ======================================================== */
/* =======================================================  CPU_CHK1  ======================================================== */
/* =======================================================  CPU_CHK2  ======================================================== */
/* =======================================================  CPU_STAT  ======================================================== */
/* ========================================  MDR_RST_CLOCK CPU_STAT EVENT0 [16..16]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_CPU_STAT_EVENT0                                             */
  MDR_RST_CLOCK_CPU_STAT_EVENT0_Off    = 0,     /*!< Off : Inactive                                                            */
  MDR_RST_CLOCK_CPU_STAT_EVENT0_On     = 1,     /*!< On : Active                                                               */
} MDR_RST_CLOCK_CPU_STAT_EVENT0_Enum;

