StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* =====================================  MDR_RST_CLOCK LSI_CLK CLR_CHK_EVENT3 [26..26]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_LSI_CLK_CLR_CHK_EVENT3                                      */
  MDR_RST_CLOCK_LSI_CLK_CLR_CHK_EVENT3_Inactive = 0,/*!< Inactive : No action                                                  */
  MDR_RST_CLOCK_LSI_CLK_CLR_CHK_EVENT3_Clear = 1,/*!< Clear : Clear level                                                      */
} MDR_RST_CLOCK_LSI_CLK_CLR_CHK_EVENT3_Enum;

/* =======================================================  LSI_CHK0  ======================================================== */
/* =======================================================  LSI_CHK1  ======================================================== */
/* =======================================================  LSI_CHK2  ======================================================== */
/* =======================================================  LSI_STAT  ======================================================== */
/* ========================================  MDR_RST_CLOCK LSI_STAT EVENT0 [16..16]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_LSI_STAT_EVENT0                                             */
  MDR_RST_CLOCK_LSI_STAT_EVENT0_Off    = 0,     /*!< Off : Inactive                                                            */
  MDR_RST_CLOCK_LSI_STAT_EVENT0_On     = 1,     /*!< On : Active                                                               */
} MDR_RST_CLOCK_LSI_STAT_EVENT0_Enum;

/* ========================================  MDR_RST_CLOCK LSI_STAT EVENT1 [17..17]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_LSI_STAT_EVENT1                                             */
  MDR_RST_CLOCK_LSI_STAT_EVENT1_Off    = 0,     /*!< Off : Inactive                                                            */
  MDR_RST_CLOCK_LSI_STAT_EVENT1_On     = 1,     /*!< On : Active                                                               */
} MDR_RST_CLOCK_LSI_STAT_EVENT1_Enum;

/* ========================================  MDR_RST_CLOCK LSI_STAT EVENT2 [18..18]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_LSI_STAT_EVENT2                                             */
  MDR_RST_CLOCK_LSI_STAT_EVENT2_Off    = 0,     /*!< Off : Inactive                                                            */
  MDR_RST_CLOCK_LSI_STAT_EVENT2_On     = 1,     /*!< On : Active                                                               */
} MDR_RST_CLOCK_LSI_STAT_EVENT2_Enum;

/* ========================================  MDR_RST_CLOCK LSI_STAT EVENT3 [19..19]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_LSI_STAT_EVENT3                                             */
  MDR_RST_CLOCK_LSI_STAT_EVENT3_Off    = 0,     /*!< Off : Inactive                                                            */
  MDR_RST_CLOCK_LSI_STAT_EVENT3_On     = 1,     /*!< On : Active                                                               */
} MDR_RST_CLOCK_LSI_STAT_EVENT3_Enum;

/* =========================================  MDR_RST_CLOCK LSI_STAT READY [20..20]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_LSI_STAT_READY                                              */
  MDR_RST_CLOCK_LSI_STAT_READY_Off     = 0,     /*!< Off : Clock not Ready                                                     */
  MDR_RST_CLOCK_LSI_STAT_READY_On      = 1,     /*!< On : Clock Ready                                                          */
} MDR_RST_CLOCK_LSI_STAT_READY_Enum;

/* =======================================================  HSI_STAT  ======================================================== */
/* =========================================  MDR_RST_CLOCK HSI_STAT READY [20..20]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_HSI_STAT_READY                                              */
  MDR_RST_CLOCK_HSI_STAT_READY_Off     = 0,     /*!< Off : Clock not Ready                                                     */
  MDR_RST_CLOCK_HSI_STAT_READY_On      = 1,     /*!< On : Clock Ready                                                          */
} MDR_RST_CLOCK_HSI_STAT_READY_Enum;

/* ========================================================  LSE_CLK  ======================================================== */
/* =====================================  MDR_RST_CLOCK LSE_CLK EN_CHK_EVENT0 [16..16]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_LSE_CLK_EN_CHK_EVENT0                                       */
  MDR_RST_CLOCK_LSE_CLK_EN_CHK_EVENT0_Off = 0,  /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_LSE_CLK_EN_CHK_EVENT0_On = 1,   /*!< On : Enable                                                               */
} MDR_RST_CLOCK_LSE_CLK_EN_CHK_EVENT0_Enum;

/* =====================================  MDR_RST_CLOCK LSE_CLK EN_CHK_EVENT1 [17..17]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_LSE_CLK_EN_CHK_EVENT1                                       */
  MDR_RST_CLOCK_LSE_CLK_EN_CHK_EVENT1_Off = 0,  /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_LSE_CLK_EN_CHK_EVENT1_On = 1,   /*!< On : Enable                                                               */
} MDR_RST_CLOCK_LSE_CLK_EN_CHK_EVENT1_Enum;

/* =====================================  MDR_RST_CLOCK LSE_CLK EN_CHK_EVENT2 [18..18]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_LSE_CLK_EN_CHK_EVENT2                                       */
  MDR_RST_CLOCK_LSE_CLK_EN_CHK_EVENT2_Off = 0,  /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_LSE_CLK_EN_CHK_EVENT2_On = 1,   /*!< On : Enable                                                               */
} MDR_RST_CLOCK_LSE_CLK_EN_CHK_EVENT2_Enum;

/* =====================================  MDR_RST_CLOCK LSE_CLK EN_CHK_EVENT3 [19..19]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_LSE_CLK_EN_CHK_EVENT3                                       */
  MDR_RST_CLOCK_LSE_CLK_EN_CHK_EVENT3_Off = 0,  /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_LSE_CLK_EN_CHK_EVENT3_On = 1,   /*!< On : Enable                                                               */
} MDR_RST_CLOCK_LSE_CLK_EN_CHK_EVENT3_Enum;

