StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* =====================================  MDR_RST_CLOCK PLL2_CLK EN_CHK_EVENT2 [18..18]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL2_CLK_EN_CHK_EVENT2                                      */
  MDR_RST_CLOCK_PLL2_CLK_EN_CHK_EVENT2_Off = 0, /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_PLL2_CLK_EN_CHK_EVENT2_On = 1,  /*!< On : Enable                                                               */
} MDR_RST_CLOCK_PLL2_CLK_EN_CHK_EVENT2_Enum;

/* =====================================  MDR_RST_CLOCK PLL2_CLK EN_CHK_EVENT3 [19..19]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL2_CLK_EN_CHK_EVENT3                                      */
  MDR_RST_CLOCK_PLL2_CLK_EN_CHK_EVENT3_Off = 0, /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_PLL2_CLK_EN_CHK_EVENT3_On = 1,  /*!< On : Enable                                                               */
} MDR_RST_CLOCK_PLL2_CLK_EN_CHK_EVENT3_Enum;

/* ========================================  MDR_RST_CLOCK PLL2_CLK EN_CHK [20..20]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL2_CLK_EN_CHK                                             */
  MDR_RST_CLOCK_PLL2_CLK_EN_CHK_Off    = 0,     /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_PLL2_CLK_EN_CHK_On     = 1,     /*!< On : Enable                                                               */
} MDR_RST_CLOCK_PLL2_CLK_EN_CHK_Enum;

/* ==================================  MDR_RST_CLOCK PLL2_CLK CLR_CHK_SHIFT_REG0 [21..21]  =================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_SHIFT_REG0                                 */
  MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_SHIFT_REG0_Inactive = 0,/*!< Inactive : No action                                             */
  MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_SHIFT_REG0_Clear = 1,/*!< Clear : Clear level                                                 */
} MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_SHIFT_REG0_Enum;

/* ==================================  MDR_RST_CLOCK PLL2_CLK CLR_CHK_SHIFT_REG1 [22..22]  =================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_SHIFT_REG1                                 */
  MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_SHIFT_REG1_Inactive = 0,/*!< Inactive : No action                                             */
  MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_SHIFT_REG1_Clear = 1,/*!< Clear : Clear level                                                 */
} MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_SHIFT_REG1_Enum;

/* ====================================  MDR_RST_CLOCK PLL2_CLK CLR_CHK_EVENT0 [23..23]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_EVENT0                                     */
  MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_EVENT0_Inactive = 0,/*!< Inactive : No action                                                 */
  MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_EVENT0_Clear = 1,/*!< Clear : Clear level                                                     */
} MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_EVENT0_Enum;

/* ====================================  MDR_RST_CLOCK PLL2_CLK CLR_CHK_EVENT1 [24..24]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_EVENT1                                     */
  MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_EVENT1_Inactive = 0,/*!< Inactive : No action                                                 */
  MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_EVENT1_Clear = 1,/*!< Clear : Clear level                                                     */
} MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_EVENT1_Enum;

/* ====================================  MDR_RST_CLOCK PLL2_CLK CLR_CHK_EVENT2 [25..25]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_EVENT2                                     */
  MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_EVENT2_Inactive = 0,/*!< Inactive : No action                                                 */
  MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_EVENT2_Clear = 1,/*!< Clear : Clear level                                                     */
} MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_EVENT2_Enum;

/* ====================================  MDR_RST_CLOCK PLL2_CLK CLR_CHK_EVENT3 [26..26]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_EVENT3                                     */
  MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_EVENT3_Inactive = 0,/*!< Inactive : No action                                                 */
  MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_EVENT3_Clear = 1,/*!< Clear : Clear level                                                     */
} MDR_RST_CLOCK_PLL2_CLK_CLR_CHK_EVENT3_Enum;

/* ========================================  MDR_RST_CLOCK PLL2_CLK PLL_ON [27..27]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL2_CLK_PLL_ON                                             */
  MDR_RST_CLOCK_PLL2_CLK_PLL_ON_Off    = 0,     /*!< Off : Disable                                                             */
  MDR_RST_CLOCK_PLL2_CLK_PLL_ON_On     = 1,     /*!< On : Enable                                                               */
} MDR_RST_CLOCK_PLL2_CLK_PLL_ON_Enum;

/* ========================================  MDR_RST_CLOCK PLL2_CLK PLL_RLD [28..28]  ======================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL2_CLK_PLL_RLD                                            */
  MDR_RST_CLOCK_PLL2_CLK_PLL_RLD_Inactive = 0,  /*!< Inactive : Inactive state                                                 */
  MDR_RST_CLOCK_PLL2_CLK_PLL_RLD_Reload = 1,    /*!< Reload : Reload PLL                                                       */
} MDR_RST_CLOCK_PLL2_CLK_PLL_RLD_Enum;

/* ========================================  MDR_RST_CLOCK PLL2_CLK SELECT [29..31]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL2_CLK_SELECT                                             */
  MDR_RST_CLOCK_PLL2_CLK_SELECT_HSI    = 0,     /*!< HSI : HSI signal                                                          */
  MDR_RST_CLOCK_PLL2_CLK_SELECT_HSI_div2 = 1,   /*!< HSI_div2 : HSI/2 signal                                                   */
  MDR_RST_CLOCK_PLL2_CLK_SELECT_HSE0   = 2,     /*!< HSE0 : HSE0 signal                                                        */
  MDR_RST_CLOCK_PLL2_CLK_SELECT_HSE0_div2 = 3,  /*!< HSE0_div2 : HSE0/2 signal                                                 */
  MDR_RST_CLOCK_PLL2_CLK_SELECT_HSE1   = 4,     /*!< HSE1 : HSE1 signal                                                        */
  MDR_RST_CLOCK_PLL2_CLK_SELECT_HSE1_div2 = 5,  /*!< HSE1_div2 : HSE1/2 signal                                                 */
} MDR_RST_CLOCK_PLL2_CLK_SELECT_Enum;

/* =======================================================  PLL2_CHK0  ======================================================= */
/* =======================================================  PLL2_CHK1  ======================================================= */
/* =======================================================  PLL2_CHK2  ======================================================= */
/* =======================================================  PLL2_STAT  ======================================================= */
/* ========================================  MDR_RST_CLOCK PLL2_STAT EVENT0 [16..16]  ======================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL2_STAT_EVENT0                                            */
  MDR_RST_CLOCK_PLL2_STAT_EVENT0_Off   = 0,     /*!< Off : Inactive                                                            */
  MDR_RST_CLOCK_PLL2_STAT_EVENT0_On    = 1,     /*!< On : Active                                                               */
} MDR_RST_CLOCK_PLL2_STAT_EVENT0_Enum;

/* ========================================  MDR_RST_CLOCK PLL2_STAT EVENT1 [17..17]  ======================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL2_STAT_EVENT1                                            */
  MDR_RST_CLOCK_PLL2_STAT_EVENT1_Off   = 0,     /*!< Off : Inactive                                                            */
  MDR_RST_CLOCK_PLL2_STAT_EVENT1_On    = 1,     /*!< On : Active                                                               */
} MDR_RST_CLOCK_PLL2_STAT_EVENT1_Enum;

/* ========================================  MDR_RST_CLOCK PLL2_STAT EVENT2 [18..18]  ======================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL2_STAT_EVENT2                                            */
  MDR_RST_CLOCK_PLL2_STAT_EVENT2_Off   = 0,     /*!< Off : Inactive                                                            */
  MDR_RST_CLOCK_PLL2_STAT_EVENT2_On    = 1,     /*!< On : Active                                                               */
} MDR_RST_CLOCK_PLL2_STAT_EVENT2_Enum;

/* ========================================  MDR_RST_CLOCK PLL2_STAT EVENT3 [19..19]  ======================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL2_STAT_EVENT3                                            */
  MDR_RST_CLOCK_PLL2_STAT_EVENT3_Off   = 0,     /*!< Off : Inactive                                                            */
  MDR_RST_CLOCK_PLL2_STAT_EVENT3_On    = 1,     /*!< On : Active                                                               */
} MDR_RST_CLOCK_PLL2_STAT_EVENT3_Enum;

/* ========================================  MDR_RST_CLOCK PLL2_STAT READY [20..20]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL2_STAT_READY                                             */
  MDR_RST_CLOCK_PLL2_STAT_READY_Off    = 0,     /*!< Off : Clock not Ready                                                     */
  MDR_RST_CLOCK_PLL2_STAT_READY_On     = 1,     /*!< On : Clock Ready                                                          */
} MDR_RST_CLOCK_PLL2_STAT_READY_Enum;

/* =======================================================  CAN1_CLK  ======================================================== */
/* ========================================  MDR_RST_CLOCK CAN1_CLK CLK_EN [16..16]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_CAN1_CLK_CLK_EN                                             */
  MDR_RST_CLOCK_CAN1_CLK_CLK_EN_Off    = 0,     /*!< Off : Clock Off                                                           */
  MDR_RST_CLOCK_CAN1_CLK_CLK_EN_On     = 1,     /*!< On : Clock On                                                             */
} MDR_RST_CLOCK_CAN1_CLK_CLK_EN_Enum;

/* =======================================================  TIM1_CLK  ======================================================== */
/* ========================================  MDR_RST_CLOCK TIM1_CLK CLK_EN [16..16]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_TIM1_CLK_CLK_EN                                             */
  MDR_RST_CLOCK_TIM1_CLK_CLK_EN_Off    = 0,     /*!< Off : Clock Off                                                           */
  MDR_RST_CLOCK_TIM1_CLK_CLK_EN_On     = 1,     /*!< On : Clock On                                                             */
} MDR_RST_CLOCK_TIM1_CLK_CLK_EN_Enum;

