StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* =======================================================  TIM2_CLK  ======================================================== */
/* ========================================  MDR_RST_CLOCK TIM2_CLK CLK_EN [16..16]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_TIM2_CLK_CLK_EN                                             */
  MDR_RST_CLOCK_TIM2_CLK_CLK_EN_Off    = 0,     /*!< Off : Clock Off                                                           */
  MDR_RST_CLOCK_TIM2_CLK_CLK_EN_On     = 1,     /*!< On : Clock On                                                             */
} MDR_RST_CLOCK_TIM2_CLK_CLK_EN_Enum;

/* =======================================================  TIM3_CLK  ======================================================== */
/* ========================================  MDR_RST_CLOCK TIM3_CLK CLK_EN [16..16]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_TIM3_CLK_CLK_EN                                             */
  MDR_RST_CLOCK_TIM3_CLK_CLK_EN_Off    = 0,     /*!< Off : Clock Off                                                           */
  MDR_RST_CLOCK_TIM3_CLK_CLK_EN_On     = 1,     /*!< On : Clock On                                                             */
} MDR_RST_CLOCK_TIM3_CLK_CLK_EN_Enum;

/* =======================================================  TIM4_CLK  ======================================================== */
/* ========================================  MDR_RST_CLOCK TIM4_CLK CLK_EN [16..16]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_TIM4_CLK_CLK_EN                                             */
  MDR_RST_CLOCK_TIM4_CLK_CLK_EN_Off    = 0,     /*!< Off : Clock Off                                                           */
  MDR_RST_CLOCK_TIM4_CLK_CLK_EN_On     = 1,     /*!< On : Clock On                                                             */
} MDR_RST_CLOCK_TIM4_CLK_CLK_EN_Enum;

/* ========================================================  ETH_CLK  ======================================================== */
/* =========================================  MDR_RST_CLOCK ETH_CLK CLK_EN [16..16]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_ETH_CLK_CLK_EN                                              */
  MDR_RST_CLOCK_ETH_CLK_CLK_EN_Off     = 0,     /*!< Off : Clock Off                                                           */
  MDR_RST_CLOCK_ETH_CLK_CLK_EN_On      = 1,     /*!< On : Clock On                                                             */
} MDR_RST_CLOCK_ETH_CLK_CLK_EN_Enum;

/* =========================================  MDR_RST_CLOCK ETH_CLK SELECT [28..31]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_ETH_CLK_SELECT                                              */
  MDR_RST_CLOCK_ETH_CLK_SELECT_HSI     = 0,     /*!< HSI : Clock Source                                                        */
  MDR_RST_CLOCK_ETH_CLK_SELECT_HSE0    = 1,     /*!< HSE0 : Clock Source                                                       */
  MDR_RST_CLOCK_ETH_CLK_SELECT_HSE1    = 2,     /*!< HSE1 : Clock Source                                                       */
  MDR_RST_CLOCK_ETH_CLK_SELECT_LSI     = 3,     /*!< LSI : Clock Source                                                        */
  MDR_RST_CLOCK_ETH_CLK_SELECT_LSE     = 4,     /*!< LSE : Clock Source                                                        */
  MDR_RST_CLOCK_ETH_CLK_SELECT_PLL0    = 5,     /*!< PLL0 : Clock Source                                                       */
  MDR_RST_CLOCK_ETH_CLK_SELECT_PLL1    = 6,     /*!< PLL1 : Clock Source                                                       */
  MDR_RST_CLOCK_ETH_CLK_SELECT_PLL2    = 7,     /*!< PLL2 : Clock Source                                                       */
  MDR_RST_CLOCK_ETH_CLK_SELECT_MAX_CLK = 13,    /*!< MAX_CLK : Clock Source                                                    */
} MDR_RST_CLOCK_ETH_CLK_SELECT_Enum;

/* =======================================================  SPW1_CLK  ======================================================== */
/* ========================================  MDR_RST_CLOCK SPW1_CLK CLK_EN [16..16]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_SPW1_CLK_CLK_EN                                             */
  MDR_RST_CLOCK_SPW1_CLK_CLK_EN_Off    = 0,     /*!< Off : Clock Off                                                           */
  MDR_RST_CLOCK_SPW1_CLK_CLK_EN_On     = 1,     /*!< On : Clock On                                                             */
} MDR_RST_CLOCK_SPW1_CLK_CLK_EN_Enum;

/* =======================================================  UART1_CLK  ======================================================= */
/* ========================================  MDR_RST_CLOCK UART1_CLK CLK_EN [16..16]  ======================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_UART1_CLK_CLK_EN                                            */
  MDR_RST_CLOCK_UART1_CLK_CLK_EN_Off   = 0,     /*!< Off : Clock Off                                                           */
  MDR_RST_CLOCK_UART1_CLK_CLK_EN_On    = 1,     /*!< On : Clock On                                                             */
} MDR_RST_CLOCK_UART1_CLK_CLK_EN_Enum;

/* ========================================  MDR_RST_CLOCK UART1_CLK SELECT [28..31]  ======================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_UART1_CLK_SELECT                                            */
  MDR_RST_CLOCK_UART1_CLK_SELECT_HSI   = 0,     /*!< HSI : Clock Source                                                        */
  MDR_RST_CLOCK_UART1_CLK_SELECT_HSE0  = 1,     /*!< HSE0 : Clock Source                                                       */
  MDR_RST_CLOCK_UART1_CLK_SELECT_HSE1  = 2,     /*!< HSE1 : Clock Source                                                       */
  MDR_RST_CLOCK_UART1_CLK_SELECT_LSI   = 3,     /*!< LSI : Clock Source                                                        */
  MDR_RST_CLOCK_UART1_CLK_SELECT_LSE   = 4,     /*!< LSE : Clock Source                                                        */
  MDR_RST_CLOCK_UART1_CLK_SELECT_PLL0  = 5,     /*!< PLL0 : Clock Source                                                       */
  MDR_RST_CLOCK_UART1_CLK_SELECT_PLL1  = 6,     /*!< PLL1 : Clock Source                                                       */
  MDR_RST_CLOCK_UART1_CLK_SELECT_PLL2  = 7,     /*!< PLL2 : Clock Source                                                       */
  MDR_RST_CLOCK_UART1_CLK_SELECT_MAX_CLK = 13,  /*!< MAX_CLK : Clock Source                                                    */
} MDR_RST_CLOCK_UART1_CLK_SELECT_Enum;

/* =======================================================  UART2_CLK  ======================================================= */
/* ========================================  MDR_RST_CLOCK UART2_CLK CLK_EN [16..16]  ======================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_UART2_CLK_CLK_EN                                            */
  MDR_RST_CLOCK_UART2_CLK_CLK_EN_Off   = 0,     /*!< Off : Clock Off                                                           */
  MDR_RST_CLOCK_UART2_CLK_CLK_EN_On    = 1,     /*!< On : Clock On                                                             */
} MDR_RST_CLOCK_UART2_CLK_CLK_EN_Enum;

/* ========================================  MDR_RST_CLOCK UART2_CLK SELECT [28..31]  ======================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_UART2_CLK_SELECT                                            */
  MDR_RST_CLOCK_UART2_CLK_SELECT_HSI   = 0,     /*!< HSI : Clock Source                                                        */
  MDR_RST_CLOCK_UART2_CLK_SELECT_HSE0  = 1,     /*!< HSE0 : Clock Source                                                       */
  MDR_RST_CLOCK_UART2_CLK_SELECT_HSE1  = 2,     /*!< HSE1 : Clock Source                                                       */
  MDR_RST_CLOCK_UART2_CLK_SELECT_LSI   = 3,     /*!< LSI : Clock Source                                                        */
  MDR_RST_CLOCK_UART2_CLK_SELECT_LSE   = 4,     /*!< LSE : Clock Source                                                        */
  MDR_RST_CLOCK_UART2_CLK_SELECT_PLL0  = 5,     /*!< PLL0 : Clock Source                                                       */
  MDR_RST_CLOCK_UART2_CLK_SELECT_PLL1  = 6,     /*!< PLL1 : Clock Source                                                       */
  MDR_RST_CLOCK_UART2_CLK_SELECT_PLL2  = 7,     /*!< PLL2 : Clock Source                                                       */
  MDR_RST_CLOCK_UART2_CLK_SELECT_MAX_CLK = 13,  /*!< MAX_CLK : Clock Source                                                    */
} MDR_RST_CLOCK_UART2_CLK_SELECT_Enum;

/* =======================================================  SSP1_CLK  ======================================================== */
/* ========================================  MDR_RST_CLOCK SSP1_CLK CLK_EN [16..16]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_SSP1_CLK_CLK_EN                                             */
  MDR_RST_CLOCK_SSP1_CLK_CLK_EN_Off    = 0,     /*!< Off : Clock Off                                                           */
  MDR_RST_CLOCK_SSP1_CLK_CLK_EN_On     = 1,     /*!< On : Clock On                                                             */
} MDR_RST_CLOCK_SSP1_CLK_CLK_EN_Enum;

/* ========================================  MDR_RST_CLOCK SSP1_CLK SELECT [28..31]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_SSP1_CLK_SELECT                                             */
  MDR_RST_CLOCK_SSP1_CLK_SELECT_HSI    = 0,     /*!< HSI : Clock Source                                                        */
  MDR_RST_CLOCK_SSP1_CLK_SELECT_HSE0   = 1,     /*!< HSE0 : Clock Source                                                       */
  MDR_RST_CLOCK_SSP1_CLK_SELECT_HSE1   = 2,     /*!< HSE1 : Clock Source                                                       */
  MDR_RST_CLOCK_SSP1_CLK_SELECT_LSI    = 3,     /*!< LSI : Clock Source                                                        */
  MDR_RST_CLOCK_SSP1_CLK_SELECT_LSE    = 4,     /*!< LSE : Clock Source                                                        */
  MDR_RST_CLOCK_SSP1_CLK_SELECT_PLL0   = 5,     /*!< PLL0 : Clock Source                                                       */
  MDR_RST_CLOCK_SSP1_CLK_SELECT_PLL1   = 6,     /*!< PLL1 : Clock Source                                                       */
  MDR_RST_CLOCK_SSP1_CLK_SELECT_PLL2   = 7,     /*!< PLL2 : Clock Source                                                       */
  MDR_RST_CLOCK_SSP1_CLK_SELECT_MAX_CLK = 13,   /*!< MAX_CLK : Clock Source                                                    */
} MDR_RST_CLOCK_SSP1_CLK_SELECT_Enum;

