StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* =======================================================  DAC2_CLK  ======================================================== */
/* ========================================  MDR_RST_CLOCK DAC2_CLK CLK_EN [16..16]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_DAC2_CLK_CLK_EN                                             */
  MDR_RST_CLOCK_DAC2_CLK_CLK_EN_Off    = 0,     /*!< Off : Clock Off                                                           */
  MDR_RST_CLOCK_DAC2_CLK_CLK_EN_On     = 1,     /*!< On : Clock On                                                             */
} MDR_RST_CLOCK_DAC2_CLK_CLK_EN_Enum;

/* ========================================  MDR_RST_CLOCK DAC2_CLK SELECT [28..31]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_DAC2_CLK_SELECT                                             */
  MDR_RST_CLOCK_DAC2_CLK_SELECT_HSI    = 0,     /*!< HSI : Clock Source                                                        */
  MDR_RST_CLOCK_DAC2_CLK_SELECT_HSE0   = 1,     /*!< HSE0 : Clock Source                                                       */
  MDR_RST_CLOCK_DAC2_CLK_SELECT_HSE1   = 2,     /*!< HSE1 : Clock Source                                                       */
  MDR_RST_CLOCK_DAC2_CLK_SELECT_LSI    = 3,     /*!< LSI : Clock Source                                                        */
  MDR_RST_CLOCK_DAC2_CLK_SELECT_LSE    = 4,     /*!< LSE : Clock Source                                                        */
  MDR_RST_CLOCK_DAC2_CLK_SELECT_PLL0   = 5,     /*!< PLL0 : Clock Source                                                       */
  MDR_RST_CLOCK_DAC2_CLK_SELECT_PLL1   = 6,     /*!< PLL1 : Clock Source                                                       */
  MDR_RST_CLOCK_DAC2_CLK_SELECT_PLL2   = 7,     /*!< PLL2 : Clock Source                                                       */
  MDR_RST_CLOCK_DAC2_CLK_SELECT_MAX_CLK = 13,   /*!< MAX_CLK : Clock Source                                                    */
} MDR_RST_CLOCK_DAC2_CLK_SELECT_Enum;

/* ========================================================  RTC_CLK  ======================================================== */
/* =========================================  MDR_RST_CLOCK RTC_CLK CLK_EN [16..16]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_RTC_CLK_CLK_EN                                              */
  MDR_RST_CLOCK_RTC_CLK_CLK_EN_Off     = 0,     /*!< Off : Clock Off                                                           */
  MDR_RST_CLOCK_RTC_CLK_CLK_EN_On      = 1,     /*!< On : Clock On                                                             */
} MDR_RST_CLOCK_RTC_CLK_CLK_EN_Enum;

/* =========================================  MDR_RST_CLOCK RTC_CLK SELECT [28..31]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_RTC_CLK_SELECT                                              */
  MDR_RST_CLOCK_RTC_CLK_SELECT_HSI     = 0,     /*!< HSI : Clock Source                                                        */
  MDR_RST_CLOCK_RTC_CLK_SELECT_HSE0    = 1,     /*!< HSE0 : Clock Source                                                       */
  MDR_RST_CLOCK_RTC_CLK_SELECT_HSE1    = 2,     /*!< HSE1 : Clock Source                                                       */
  MDR_RST_CLOCK_RTC_CLK_SELECT_LSI     = 3,     /*!< LSI : Clock Source                                                        */
  MDR_RST_CLOCK_RTC_CLK_SELECT_LSE     = 4,     /*!< LSE : Clock Source                                                        */
  MDR_RST_CLOCK_RTC_CLK_SELECT_PLL0    = 5,     /*!< PLL0 : Clock Source                                                       */
  MDR_RST_CLOCK_RTC_CLK_SELECT_PLL1    = 6,     /*!< PLL1 : Clock Source                                                       */
  MDR_RST_CLOCK_RTC_CLK_SELECT_PLL2    = 7,     /*!< PLL2 : Clock Source                                                       */
  MDR_RST_CLOCK_RTC_CLK_SELECT_MAX_CLK = 13,    /*!< MAX_CLK : Clock Source                                                    */
} MDR_RST_CLOCK_RTC_CLK_SELECT_Enum;



/* =========================================================================================================================== */
/* ================                                          MDR_BKP                                          ================ */
/* =========================================================================================================================== */

/* ==========================================================  REG  ========================================================== */
/* ==========================================================  KEY  ========================================================== */
/* ======================================================  REG_60_TMR0  ====================================================== */
/* ============================================  MDR_BKP REG_60_TMR0 FPOR [7..7]  ============================================ */
typedef enum {                                  /*!< MDR_BKP_REG_60_TMR0_FPOR                                                  */
  MDR_BKP_REG_60_TMR0_FPOR_Bootloader  = 0,     /*!< Bootloader : Bootloader active                                            */
  MDR_BKP_REG_60_TMR0_FPOR_Completed   = 1,     /*!< Completed : Bootloader completed                                          */
} MDR_BKP_REG_60_TMR0_FPOR_Enum;

/* =========================================  MDR_BKP REG_60_TMR0 S_UccReset [8..8]  ========================================= */
typedef enum {                                  /*!< MDR_BKP_REG_60_TMR0_S_UccReset                                            */
  MDR_BKP_REG_60_TMR0_S_UccReset_Off   = 0,     /*!< Off : Event Inactive                                                      */
  MDR_BKP_REG_60_TMR0_S_UccReset_On    = 1,     /*!< On : Event Active                                                         */
} MDR_BKP_REG_60_TMR0_S_UccReset_Enum;

