StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* =========================================  MDR_BKP REG_63_TMR1 LSI_Trim [16..20]  ========================================= */
typedef enum {                                  /*!< MDR_BKP_REG_63_TMR1_LSI_Trim                                              */
  MDR_BKP_REG_63_TMR1_LSI_Trim_Max8    = 0,     /*!< Max8 : LSI Trim                                                           */
  MDR_BKP_REG_63_TMR1_LSI_Trim_Max7    = 1,     /*!< Max7 : LSI Trim                                                           */
  MDR_BKP_REG_63_TMR1_LSI_Trim_Max6    = 2,     /*!< Max6 : LSI Trim                                                           */
  MDR_BKP_REG_63_TMR1_LSI_Trim_Max5    = 3,     /*!< Max5 : LSI Trim                                                           */
  MDR_BKP_REG_63_TMR1_LSI_Trim_Max4    = 4,     /*!< Max4 : LSI Trim                                                           */
  MDR_BKP_REG_63_TMR1_LSI_Trim_Max3    = 5,     /*!< Max3 : LSI Trim                                                           */
  MDR_BKP_REG_63_TMR1_LSI_Trim_Max2    = 6,     /*!< Max2 : LSI Trim                                                           */
  MDR_BKP_REG_63_TMR1_LSI_Trim_Max1    = 7,     /*!< Max1 : LSI Trim                                                           */
  MDR_BKP_REG_63_TMR1_LSI_Trim_Typical = 8,     /*!< Typical : LSI Default                                                     */
  MDR_BKP_REG_63_TMR1_LSI_Trim_Min1    = 9,     /*!< Min1 : LSI Trim                                                           */
  MDR_BKP_REG_63_TMR1_LSI_Trim_Min2    = 10,    /*!< Min2 : LSI Trim                                                           */
  MDR_BKP_REG_63_TMR1_LSI_Trim_Min3    = 11,    /*!< Min3 : LSI Trim                                                           */
  MDR_BKP_REG_63_TMR1_LSI_Trim_Min4    = 12,    /*!< Min4 : LSI Trim                                                           */
  MDR_BKP_REG_63_TMR1_LSI_Trim_Min5    = 13,    /*!< Min5 : LSI Trim                                                           */
  MDR_BKP_REG_63_TMR1_LSI_Trim_Min6    = 14,    /*!< Min6 : LSI Trim                                                           */
  MDR_BKP_REG_63_TMR1_LSI_Trim_Min7    = 15,    /*!< Min7 : LSI Trim                                                           */
} MDR_BKP_REG_63_TMR1_LSI_Trim_Enum;

/* =========================================  MDR_BKP REG_63_TMR1 LSI_RDY [21..21]  ========================================== */
typedef enum {                                  /*!< MDR_BKP_REG_63_TMR1_LSI_RDY                                               */
  MDR_BKP_REG_63_TMR1_LSI_RDY_Off      = 0,     /*!< Off : Disable                                                             */
  MDR_BKP_REG_63_TMR1_LSI_RDY_On       = 1,     /*!< On : Enable                                                               */
} MDR_BKP_REG_63_TMR1_LSI_RDY_Enum;

/* ==========================================  MDR_BKP REG_63_TMR1 HSI_On [22..22]  ========================================== */
typedef enum {                                  /*!< MDR_BKP_REG_63_TMR1_HSI_On                                                */
  MDR_BKP_REG_63_TMR1_HSI_On_Off       = 0,     /*!< Off : Disable                                                             */
  MDR_BKP_REG_63_TMR1_HSI_On_On        = 1,     /*!< On : Enable                                                               */
} MDR_BKP_REG_63_TMR1_HSI_On_Enum;

/* =========================================  MDR_BKP REG_63_TMR1 HSI_RDY [23..23]  ========================================== */
typedef enum {                                  /*!< MDR_BKP_REG_63_TMR1_HSI_RDY                                               */
  MDR_BKP_REG_63_TMR1_HSI_RDY_Off      = 0,     /*!< Off : Disable                                                             */
  MDR_BKP_REG_63_TMR1_HSI_RDY_On       = 1,     /*!< On : Enable                                                               */
} MDR_BKP_REG_63_TMR1_HSI_RDY_Enum;

/* =========================================  MDR_BKP REG_63_TMR1 STANDBY [30..30]  ========================================== */
typedef enum {                                  /*!< MDR_BKP_REG_63_TMR1_STANDBY                                               */
  MDR_BKP_REG_63_TMR1_STANDBY_Inactive = 0,     /*!< Inactive : No Action                                                      */
  MDR_BKP_REG_63_TMR1_STANDBY_GoStandby = 1,    /*!< GoStandby : Standby power off                                             */
} MDR_BKP_REG_63_TMR1_STANDBY_Enum;

/* =========================================  MDR_BKP REG_63_TMR1 RTC_RST [31..31]  ========================================== */
typedef enum {                                  /*!< MDR_BKP_REG_63_TMR1_RTC_RST                                               */
  MDR_BKP_REG_63_TMR1_RTC_RST_Off      = 0,     /*!< Off : Disable                                                             */
  MDR_BKP_REG_63_TMR1_RTC_RST_On       = 1,     /*!< On : Enable                                                               */
} MDR_BKP_REG_63_TMR1_RTC_RST_Enum;

/* ======================================================  REG_60_TMR2  ====================================================== */
/* ============================================  MDR_BKP REG_60_TMR2 FPOR [7..7]  ============================================ */
typedef enum {                                  /*!< MDR_BKP_REG_60_TMR2_FPOR                                                  */
  MDR_BKP_REG_60_TMR2_FPOR_Bootloader  = 0,     /*!< Bootloader : Bootloader active                                            */
  MDR_BKP_REG_60_TMR2_FPOR_Completed   = 1,     /*!< Completed : Bootloader completed                                          */
} MDR_BKP_REG_60_TMR2_FPOR_Enum;

/* =========================================  MDR_BKP REG_60_TMR2 S_UccReset [8..8]  ========================================= */
typedef enum {                                  /*!< MDR_BKP_REG_60_TMR2_S_UccReset                                            */
  MDR_BKP_REG_60_TMR2_S_UccReset_Off   = 0,     /*!< Off : Event Inactive                                                      */
  MDR_BKP_REG_60_TMR2_S_UccReset_On    = 1,     /*!< On : Event Active                                                         */
} MDR_BKP_REG_60_TMR2_S_UccReset_Enum;

/* ==========================================  MDR_BKP REG_60_TMR2 S_RSTn0 [9..9]  =========================================== */
typedef enum {                                  /*!< MDR_BKP_REG_60_TMR2_S_RSTn0                                               */
  MDR_BKP_REG_60_TMR2_S_RSTn0_Off      = 0,     /*!< Off : Event Inactive                                                      */
  MDR_BKP_REG_60_TMR2_S_RSTn0_On       = 1,     /*!< On : Event Active                                                         */
} MDR_BKP_REG_60_TMR2_S_RSTn0_Enum;

/* ========================================  MDR_BKP REG_60_TMR2 S_FT_Reset [10..10]  ======================================== */
typedef enum {                                  /*!< MDR_BKP_REG_60_TMR2_S_FT_Reset                                            */
  MDR_BKP_REG_60_TMR2_S_FT_Reset_Off   = 0,     /*!< Off : Event Inactive                                                      */
  MDR_BKP_REG_60_TMR2_S_FT_Reset_On    = 1,     /*!< On : Event Active                                                         */
} MDR_BKP_REG_60_TMR2_S_FT_Reset_Enum;

/* =======================================  MDR_BKP REG_60_TMR2 S_WDT_Reset [11..11]  ======================================== */
typedef enum {                                  /*!< MDR_BKP_REG_60_TMR2_S_WDT_Reset                                           */
  MDR_BKP_REG_60_TMR2_S_WDT_Reset_Off  = 0,     /*!< Off : Event Inactive                                                      */
  MDR_BKP_REG_60_TMR2_S_WDT_Reset_On   = 1,     /*!< On : Event Active                                                         */
} MDR_BKP_REG_60_TMR2_S_WDT_Reset_Enum;

