StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* =========================================  MDR_BKP REG_60_TMR2 S_RSTn1 [12..12]  ========================================== */
typedef enum {                                  /*!< MDR_BKP_REG_60_TMR2_S_RSTn1                                               */
  MDR_BKP_REG_60_TMR2_S_RSTn1_Off      = 0,     /*!< Off : Event Inactive                                                      */
  MDR_BKP_REG_60_TMR2_S_RSTn1_On       = 1,     /*!< On : Event Active                                                         */
} MDR_BKP_REG_60_TMR2_S_RSTn1_Enum;

/* =========================================  MDR_BKP REG_60_TMR2 S_OVRSTn [13..13]  ========================================= */
typedef enum {                                  /*!< MDR_BKP_REG_60_TMR2_S_OVRSTn                                              */
  MDR_BKP_REG_60_TMR2_S_OVRSTn_Off     = 0,     /*!< Off : Event Inactive                                                      */
  MDR_BKP_REG_60_TMR2_S_OVRSTn_On      = 1,     /*!< On : Event Active                                                         */
} MDR_BKP_REG_60_TMR2_S_OVRSTn_Enum;

/* ========================================  MDR_BKP REG_60_TMR2 S_SYSRSTn [14..14]  ========================================= */
typedef enum {                                  /*!< MDR_BKP_REG_60_TMR2_S_SYSRSTn                                             */
  MDR_BKP_REG_60_TMR2_S_SYSRSTn_Off    = 0,     /*!< Off : Event Inactive                                                      */
  MDR_BKP_REG_60_TMR2_S_SYSRSTn_On     = 1,     /*!< On : Event Active                                                         */
} MDR_BKP_REG_60_TMR2_S_SYSRSTn_Enum;

/* =======================================  MDR_BKP REG_60_TMR2 JTAG_Enable [15..15]  ======================================== */
typedef enum {                                  /*!< MDR_BKP_REG_60_TMR2_JTAG_Enable                                           */
  MDR_BKP_REG_60_TMR2_JTAG_Enable_On   = 0,     /*!< On : Enabled                                                              */
  MDR_BKP_REG_60_TMR2_JTAG_Enable_Off  = 1,     /*!< Off : Disabled                                                            */
} MDR_BKP_REG_60_TMR2_JTAG_Enable_Enum;

/* =====================================  MDR_BKP REG_60_TMR2 LimEn_LDO_DUcc0 [16..16]  ====================================== */
typedef enum {                                  /*!< MDR_BKP_REG_60_TMR2_LimEn_LDO_DUcc0                                       */
  MDR_BKP_REG_60_TMR2_LimEn_LDO_DUcc0_Off = 0,  /*!< Off : Disable                                                             */
  MDR_BKP_REG_60_TMR2_LimEn_LDO_DUcc0_On = 1,   /*!< On : Enable                                                               */
} MDR_BKP_REG_60_TMR2_LimEn_LDO_DUcc0_Enum;

/* =====================================  MDR_BKP REG_60_TMR2 LimEn_LDO_DUcc1 [17..17]  ====================================== */
typedef enum {                                  /*!< MDR_BKP_REG_60_TMR2_LimEn_LDO_DUcc1                                       */
  MDR_BKP_REG_60_TMR2_LimEn_LDO_DUcc1_Off = 0,  /*!< Off : Disable                                                             */
  MDR_BKP_REG_60_TMR2_LimEn_LDO_DUcc1_On = 1,   /*!< On : Enable                                                               */
} MDR_BKP_REG_60_TMR2_LimEn_LDO_DUcc1_Enum;

/* =====================================  MDR_BKP REG_60_TMR2 LimEn_LDO_DUcc2 [18..18]  ====================================== */
typedef enum {                                  /*!< MDR_BKP_REG_60_TMR2_LimEn_LDO_DUcc2                                       */
  MDR_BKP_REG_60_TMR2_LimEn_LDO_DUcc2_Off = 0,  /*!< Off : Disable                                                             */
  MDR_BKP_REG_60_TMR2_LimEn_LDO_DUcc2_On = 1,   /*!< On : Enable                                                               */
} MDR_BKP_REG_60_TMR2_LimEn_LDO_DUcc2_Enum;

/* =====================================  MDR_BKP REG_60_TMR2 LimEn_LDO_DUcc3 [19..19]  ====================================== */
typedef enum {                                  /*!< MDR_BKP_REG_60_TMR2_LimEn_LDO_DUcc3                                       */
  MDR_BKP_REG_60_TMR2_LimEn_LDO_DUcc3_Off = 0,  /*!< Off : Disable                                                             */
  MDR_BKP_REG_60_TMR2_LimEn_LDO_DUcc3_On = 1,   /*!< On : Enable                                                               */
} MDR_BKP_REG_60_TMR2_LimEn_LDO_DUcc3_Enum;

/* ======================================  MDR_BKP REG_60_TMR2 LimEn_LDO_BUcc [20..20]  ====================================== */
typedef enum {                                  /*!< MDR_BKP_REG_60_TMR2_LimEn_LDO_BUcc                                        */
  MDR_BKP_REG_60_TMR2_LimEn_LDO_BUcc_Off = 0,   /*!< Off : Disable                                                             */
  MDR_BKP_REG_60_TMR2_LimEn_LDO_BUcc_On = 1,    /*!< On : Enable                                                               */
} MDR_BKP_REG_60_TMR2_LimEn_LDO_BUcc_Enum;

/* ======================================  MDR_BKP REG_60_TMR2 LimEn_LDO_PLL [21..21]  ======================================= */
typedef enum {                                  /*!< MDR_BKP_REG_60_TMR2_LimEn_LDO_PLL                                         */
  MDR_BKP_REG_60_TMR2_LimEn_LDO_PLL_Off = 0,    /*!< Off : Disable                                                             */
  MDR_BKP_REG_60_TMR2_LimEn_LDO_PLL_On = 1,     /*!< On : Enable                                                               */
} MDR_BKP_REG_60_TMR2_LimEn_LDO_PLL_Enum;

/* ========================================  MDR_BKP REG_60_TMR2 ERR_REG60x [25..25]  ======================================== */
typedef enum {                                  /*!< MDR_BKP_REG_60_TMR2_ERR_REG60x                                            */
  MDR_BKP_REG_60_TMR2_ERR_REG60x_Off   = 0,     /*!< Off : Event Inactive                                                      */
  MDR_BKP_REG_60_TMR2_ERR_REG60x_On    = 1,     /*!< On : Event Active                                                         */
} MDR_BKP_REG_60_TMR2_ERR_REG60x_Enum;

/* ======================================  MDR_BKP REG_60_TMR2 ERR_REG61x_62x [26..26]  ====================================== */
typedef enum {                                  /*!< MDR_BKP_REG_60_TMR2_ERR_REG61x_62x                                        */
  MDR_BKP_REG_60_TMR2_ERR_REG61x_62x_Off = 0,   /*!< Off : Event Inactive                                                      */
  MDR_BKP_REG_60_TMR2_ERR_REG61x_62x_On = 1,    /*!< On : Event Active                                                         */
} MDR_BKP_REG_60_TMR2_ERR_REG61x_62x_Enum;

