StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* ========================================  MDR_BKP REG_60_TMR2 ERR_REG63x [27..27]  ======================================== */
typedef enum {                                  /*!< MDR_BKP_REG_60_TMR2_ERR_REG63x                                            */
  MDR_BKP_REG_60_TMR2_ERR_REG63x_Off   = 0,     /*!< Off : Event Inactive                                                      */
  MDR_BKP_REG_60_TMR2_ERR_REG63x_On    = 1,     /*!< On : Event Active                                                         */
} MDR_BKP_REG_60_TMR2_ERR_REG63x_Enum;

/* ========================================  MDR_BKP REG_60_TMR2 PORSTn_En [28..28]  ========================================= */
typedef enum {                                  /*!< MDR_BKP_REG_60_TMR2_PORSTn_En                                             */
  MDR_BKP_REG_60_TMR2_PORSTn_En_On     = 0,     /*!< On : Enabled                                                              */
  MDR_BKP_REG_60_TMR2_PORSTn_En_Off    = 1,     /*!< Off : Disabled                                                            */
} MDR_BKP_REG_60_TMR2_PORSTn_En_Enum;

/* ========================================  MDR_BKP REG_60_TMR2 OVRSTn_En [29..29]  ========================================= */
typedef enum {                                  /*!< MDR_BKP_REG_60_TMR2_OVRSTn_En                                             */
  MDR_BKP_REG_60_TMR2_OVRSTn_En_On     = 0,     /*!< On : Enabled                                                              */
  MDR_BKP_REG_60_TMR2_OVRSTn_En_Off    = 1,     /*!< Off : Disabled                                                            */
} MDR_BKP_REG_60_TMR2_OVRSTn_En_Enum;

/* =========================================  MDR_BKP REG_60_TMR2 CLR_ERR [30..30]  ========================================== */
typedef enum {                                  /*!< MDR_BKP_REG_60_TMR2_CLR_ERR                                               */
  MDR_BKP_REG_60_TMR2_CLR_ERR_Inactive = 0,     /*!< Inactive : Disable                                                        */
  MDR_BKP_REG_60_TMR2_CLR_ERR_Clear    = 1,     /*!< Clear : Clear Errors                                                      */
} MDR_BKP_REG_60_TMR2_CLR_ERR_Enum;

/* ========================================  MDR_BKP REG_60_TMR2 ERR_IRQ_EN [31..31]  ======================================== */
typedef enum {                                  /*!< MDR_BKP_REG_60_TMR2_ERR_IRQ_EN                                            */
  MDR_BKP_REG_60_TMR2_ERR_IRQ_EN_Off   = 0,     /*!< Off : Disable                                                             */
  MDR_BKP_REG_60_TMR2_ERR_IRQ_EN_On    = 1,     /*!< On : Enable                                                               */
} MDR_BKP_REG_60_TMR2_ERR_IRQ_EN_Enum;

/* ======================================================  REG_61_TMR2  ====================================================== */
/* ========================================  MDR_BKP REG_61_TMR2 LDO0_SRILow [0..2]  ========================================= */
typedef enum {                                  /*!< MDR_BKP_REG_61_TMR2_LDO0_SRILow                                           */
  MDR_BKP_REG_61_TMR2_LDO0_SRILow_ge10MHz = 0,  /*!< ge10MHz : Extra_I about ~400uA                                            */
  MDR_BKP_REG_61_TMR2_LDO0_SRILow_ge30MHz = 1,  /*!< ge30MHz : Extra_I about ~450uA                                            */
  MDR_BKP_REG_61_TMR2_LDO0_SRILow_ge50MHz = 2,  /*!< ge50MHz : Extra_I about ~550uA                                            */
  MDR_BKP_REG_61_TMR2_LDO0_SRILow_ge100MHz = 3, /*!< ge100MHz : Extra_I about ~650uA                                           */
  MDR_BKP_REG_61_TMR2_LDO0_SRILow_ge1MHz = 4,   /*!< ge1MHz : Extra_I about ~300uA                                             */
  MDR_BKP_REG_61_TMR2_LDO0_SRILow_ge500KHz = 5, /*!< ge500KHz : Extra_I about ~200uA                                           */
  MDR_BKP_REG_61_TMR2_LDO0_SRILow_ge100KHz = 6, /*!< ge100KHz : Extra_I about ~100uA                                           */
  MDR_BKP_REG_61_TMR2_LDO0_SRILow_ge10KHz = 7,  /*!< ge10KHz : Extra_I about ~50uA                                             */
} MDR_BKP_REG_61_TMR2_LDO0_SRILow_Enum;

/* =========================================  MDR_BKP REG_61_TMR2 LDO0_Trim [3..5]  ========================================== */
typedef enum {                                  /*!< MDR_BKP_REG_61_TMR2_LDO0_Trim                                             */
  MDR_BKP_REG_61_TMR2_LDO0_Trim_add_0v01 = 0,   /*!< add_0v01 : LD0 extra voltage +0.01V                                       */
  MDR_BKP_REG_61_TMR2_LDO0_Trim_add_0v05 = 1,   /*!< add_0v05 : LD0 extra voltage +0.05V                                       */
  MDR_BKP_REG_61_TMR2_LDO0_Trim_add_0v1 = 2,    /*!< add_0v1 : LD0 extra voltage +0.1V                                         */
  MDR_BKP_REG_61_TMR2_LDO0_Trim_add_0v15 = 3,   /*!< add_0v15 : LD0 extra voltage +0.15V                                       */
  MDR_BKP_REG_61_TMR2_LDO0_Trim_sub_0v01 = 4,   /*!< sub_0v01 : LD0 extra voltage -0.01V                                       */
  MDR_BKP_REG_61_TMR2_LDO0_Trim_sub_0v05 = 5,   /*!< sub_0v05 : LD0 extra voltage -0.05V                                       */
  MDR_BKP_REG_61_TMR2_LDO0_Trim_sub_0v015 = 6,  /*!< sub_0v015 : LD0 extra voltage -0.10V                                      */
  MDR_BKP_REG_61_TMR2_LDO0_Trim_sub_0v15 = 7,   /*!< sub_0v15 : LD0 extra voltage -0.15V                                       */
} MDR_BKP_REG_61_TMR2_LDO0_Trim_Enum;

/* ==========================================  MDR_BKP REG_61_TMR2 LDO0_En [6..6]  =========================================== */
typedef enum {                                  /*!< MDR_BKP_REG_61_TMR2_LDO0_En                                               */
  MDR_BKP_REG_61_TMR2_LDO0_En_On       = 0,     /*!< On : Enable                                                               */
  MDR_BKP_REG_61_TMR2_LDO0_En_Off      = 1,     /*!< Off : Disable                                                             */
} MDR_BKP_REG_61_TMR2_LDO0_En_Enum;

