StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* ==========================================  MDR_BKP REG_61_TMR2 LDO0_RDY [7..7]  ========================================== */
typedef enum {                                  /*!< MDR_BKP_REG_61_TMR2_LDO0_RDY                                              */
  MDR_BKP_REG_61_TMR2_LDO0_RDY_NotReady = 0,    /*!< NotReady : DUcc not ready                                                 */
  MDR_BKP_REG_61_TMR2_LDO0_RDY_Ready   = 1,     /*!< Ready : DUcc ready                                                        */
} MDR_BKP_REG_61_TMR2_LDO0_RDY_Enum;

/* ========================================  MDR_BKP REG_61_TMR2 LDO1_SRILow [8..10]  ======================================== */
typedef enum {                                  /*!< MDR_BKP_REG_61_TMR2_LDO1_SRILow                                           */
  MDR_BKP_REG_61_TMR2_LDO1_SRILow_ge10MHz = 0,  /*!< ge10MHz : Extra_I about ~400uA                                            */
  MDR_BKP_REG_61_TMR2_LDO1_SRILow_ge30MHz = 1,  /*!< ge30MHz : Extra_I about ~450uA                                            */
  MDR_BKP_REG_61_TMR2_LDO1_SRILow_ge50MHz = 2,  /*!< ge50MHz : Extra_I about ~550uA                                            */
  MDR_BKP_REG_61_TMR2_LDO1_SRILow_ge100MHz = 3, /*!< ge100MHz : Extra_I about ~650uA                                           */
  MDR_BKP_REG_61_TMR2_LDO1_SRILow_ge1MHz = 4,   /*!< ge1MHz : Extra_I about ~300uA                                             */
  MDR_BKP_REG_61_TMR2_LDO1_SRILow_ge500KHz = 5, /*!< ge500KHz : Extra_I about ~200uA                                           */
  MDR_BKP_REG_61_TMR2_LDO1_SRILow_ge100KHz = 6, /*!< ge100KHz : Extra_I about ~100uA                                           */
  MDR_BKP_REG_61_TMR2_LDO1_SRILow_ge10KHz = 7,  /*!< ge10KHz : Extra_I about ~50uA                                             */
} MDR_BKP_REG_61_TMR2_LDO1_SRILow_Enum;

/* ========================================  MDR_BKP REG_61_TMR2 LDO1_Trim [11..13]  ========================================= */
typedef enum {                                  /*!< MDR_BKP_REG_61_TMR2_LDO1_Trim                                             */
  MDR_BKP_REG_61_TMR2_LDO1_Trim_add_0v01 = 0,   /*!< add_0v01 : LD0 extra voltage +0.01V                                       */
  MDR_BKP_REG_61_TMR2_LDO1_Trim_add_0v05 = 1,   /*!< add_0v05 : LD0 extra voltage +0.05V                                       */
  MDR_BKP_REG_61_TMR2_LDO1_Trim_add_0v1 = 2,    /*!< add_0v1 : LD0 extra voltage +0.1V                                         */
  MDR_BKP_REG_61_TMR2_LDO1_Trim_add_0v15 = 3,   /*!< add_0v15 : LD0 extra voltage +0.15V                                       */
  MDR_BKP_REG_61_TMR2_LDO1_Trim_sub_0v01 = 4,   /*!< sub_0v01 : LD0 extra voltage -0.01V                                       */
  MDR_BKP_REG_61_TMR2_LDO1_Trim_sub_0v05 = 5,   /*!< sub_0v05 : LD0 extra voltage -0.05V                                       */
  MDR_BKP_REG_61_TMR2_LDO1_Trim_sub_0v015 = 6,  /*!< sub_0v015 : LD0 extra voltage -0.10V                                      */
  MDR_BKP_REG_61_TMR2_LDO1_Trim_sub_0v15 = 7,   /*!< sub_0v15 : LD0 extra voltage -0.15V                                       */
} MDR_BKP_REG_61_TMR2_LDO1_Trim_Enum;

/* =========================================  MDR_BKP REG_61_TMR2 LDO1_En [14..14]  ========================================== */
typedef enum {                                  /*!< MDR_BKP_REG_61_TMR2_LDO1_En                                               */
  MDR_BKP_REG_61_TMR2_LDO1_En_On       = 0,     /*!< On : Enable                                                               */
  MDR_BKP_REG_61_TMR2_LDO1_En_Off      = 1,     /*!< Off : Disable                                                             */
} MDR_BKP_REG_61_TMR2_LDO1_En_Enum;

/* =========================================  MDR_BKP REG_61_TMR2 LDO1_RDY [15..15]  ========================================= */
typedef enum {                                  /*!< MDR_BKP_REG_61_TMR2_LDO1_RDY                                              */
  MDR_BKP_REG_61_TMR2_LDO1_RDY_NotReady = 0,    /*!< NotReady : DUcc not ready                                                 */
  MDR_BKP_REG_61_TMR2_LDO1_RDY_Ready   = 1,     /*!< Ready : DUcc ready                                                        */
} MDR_BKP_REG_61_TMR2_LDO1_RDY_Enum;

/* =======================================  MDR_BKP REG_61_TMR2 LDO2_SRILow [16..18]  ======================================== */
typedef enum {                                  /*!< MDR_BKP_REG_61_TMR2_LDO2_SRILow                                           */
  MDR_BKP_REG_61_TMR2_LDO2_SRILow_ge10MHz = 0,  /*!< ge10MHz : Extra_I about ~400uA                                            */
  MDR_BKP_REG_61_TMR2_LDO2_SRILow_ge30MHz = 1,  /*!< ge30MHz : Extra_I about ~450uA                                            */
  MDR_BKP_REG_61_TMR2_LDO2_SRILow_ge50MHz = 2,  /*!< ge50MHz : Extra_I about ~550uA                                            */
  MDR_BKP_REG_61_TMR2_LDO2_SRILow_ge100MHz = 3, /*!< ge100MHz : Extra_I about ~650uA                                           */
  MDR_BKP_REG_61_TMR2_LDO2_SRILow_ge1MHz = 4,   /*!< ge1MHz : Extra_I about ~300uA                                             */
  MDR_BKP_REG_61_TMR2_LDO2_SRILow_ge500KHz = 5, /*!< ge500KHz : Extra_I about ~200uA                                           */
  MDR_BKP_REG_61_TMR2_LDO2_SRILow_ge100KHz = 6, /*!< ge100KHz : Extra_I about ~100uA                                           */
  MDR_BKP_REG_61_TMR2_LDO2_SRILow_ge10KHz = 7,  /*!< ge10KHz : Extra_I about ~50uA                                             */
} MDR_BKP_REG_61_TMR2_LDO2_SRILow_Enum;

/* ========================================  MDR_BKP REG_61_TMR2 LDO2_Trim [19..21]  ========================================= */
typedef enum {                                  /*!< MDR_BKP_REG_61_TMR2_LDO2_Trim                                             */
  MDR_BKP_REG_61_TMR2_LDO2_Trim_add_0v01 = 0,   /*!< add_0v01 : LD0 extra voltage +0.01V                                       */
  MDR_BKP_REG_61_TMR2_LDO2_Trim_add_0v05 = 1,   /*!< add_0v05 : LD0 extra voltage +0.05V                                       */
  MDR_BKP_REG_61_TMR2_LDO2_Trim_add_0v1 = 2,    /*!< add_0v1 : LD0 extra voltage +0.1V                                         */
  MDR_BKP_REG_61_TMR2_LDO2_Trim_add_0v15 = 3,   /*!< add_0v15 : LD0 extra voltage +0.15V                                       */
  MDR_BKP_REG_61_TMR2_LDO2_Trim_sub_0v01 = 4,   /*!< sub_0v01 : LD0 extra voltage -0.01V                                       */
  MDR_BKP_REG_61_TMR2_LDO2_Trim_sub_0v05 = 5,   /*!< sub_0v05 : LD0 extra voltage -0.05V                                       */
  MDR_BKP_REG_61_TMR2_LDO2_Trim_sub_0v015 = 6,  /*!< sub_0v015 : LD0 extra voltage -0.10V                                      */
  MDR_BKP_REG_61_TMR2_LDO2_Trim_sub_0v15 = 7,   /*!< sub_0v15 : LD0 extra voltage -0.15V                                       */
} MDR_BKP_REG_61_TMR2_LDO2_Trim_Enum;

/* =========================================  MDR_BKP REG_61_TMR2 LDO2_En [22..22]  ========================================== */
typedef enum {                                  /*!< MDR_BKP_REG_61_TMR2_LDO2_En                                               */
  MDR_BKP_REG_61_TMR2_LDO2_En_On       = 0,     /*!< On : Enable                                                               */
  MDR_BKP_REG_61_TMR2_LDO2_En_Off      = 1,     /*!< Off : Disable                                                             */
} MDR_BKP_REG_61_TMR2_LDO2_En_Enum;

/* =========================================  MDR_BKP REG_61_TMR2 LDO2_RDY [23..23]  ========================================= */
typedef enum {                                  /*!< MDR_BKP_REG_61_TMR2_LDO2_RDY                                              */
  MDR_BKP_REG_61_TMR2_LDO2_RDY_NotReady = 0,    /*!< NotReady : DUcc not ready                                                 */
  MDR_BKP_REG_61_TMR2_LDO2_RDY_Ready   = 1,     /*!< Ready : DUcc ready                                                        */
} MDR_BKP_REG_61_TMR2_LDO2_RDY_Enum;

/* =======================================  MDR_BKP REG_61_TMR2 LDO3_SRILow [24..26]  ======================================== */
typedef enum {                                  /*!< MDR_BKP_REG_61_TMR2_LDO3_SRILow                                           */
  MDR_BKP_REG_61_TMR2_LDO3_SRILow_ge10MHz = 0,  /*!< ge10MHz : Extra_I about ~400uA                                            */
  MDR_BKP_REG_61_TMR2_LDO3_SRILow_ge30MHz = 1,  /*!< ge30MHz : Extra_I about ~450uA                                            */
  MDR_BKP_REG_61_TMR2_LDO3_SRILow_ge50MHz = 2,  /*!< ge50MHz : Extra_I about ~550uA                                            */
  MDR_BKP_REG_61_TMR2_LDO3_SRILow_ge100MHz = 3, /*!< ge100MHz : Extra_I about ~650uA                                           */
  MDR_BKP_REG_61_TMR2_LDO3_SRILow_ge1MHz = 4,   /*!< ge1MHz : Extra_I about ~300uA                                             */
  MDR_BKP_REG_61_TMR2_LDO3_SRILow_ge500KHz = 5, /*!< ge500KHz : Extra_I about ~200uA                                           */
  MDR_BKP_REG_61_TMR2_LDO3_SRILow_ge100KHz = 6, /*!< ge100KHz : Extra_I about ~100uA                                           */
  MDR_BKP_REG_61_TMR2_LDO3_SRILow_ge10KHz = 7,  /*!< ge10KHz : Extra_I about ~50uA                                             */
} MDR_BKP_REG_61_TMR2_LDO3_SRILow_Enum;

