StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* =======================================  MDR_BKP REG_62_TMR2 LDO_PLL_Trim [11..13]  ======================================= */
typedef enum {                                  /*!< MDR_BKP_REG_62_TMR2_LDO_PLL_Trim                                          */
  MDR_BKP_REG_62_TMR2_LDO_PLL_Trim_add_0v01 = 0,/*!< add_0v01 : LD0 extra voltage +0.01V                                       */
  MDR_BKP_REG_62_TMR2_LDO_PLL_Trim_add_0v05 = 1,/*!< add_0v05 : LD0 extra voltage +0.05V                                       */
  MDR_BKP_REG_62_TMR2_LDO_PLL_Trim_add_0v1 = 2, /*!< add_0v1 : LD0 extra voltage +0.1V                                         */
  MDR_BKP_REG_62_TMR2_LDO_PLL_Trim_add_0v15 = 3,/*!< add_0v15 : LD0 extra voltage +0.15V                                       */
  MDR_BKP_REG_62_TMR2_LDO_PLL_Trim_sub_0v01 = 4,/*!< sub_0v01 : LD0 extra voltage -0.01V                                       */
  MDR_BKP_REG_62_TMR2_LDO_PLL_Trim_sub_0v05 = 5,/*!< sub_0v05 : LD0 extra voltage -0.05V                                       */
  MDR_BKP_REG_62_TMR2_LDO_PLL_Trim_sub_0v015 = 6,/*!< sub_0v015 : LD0 extra voltage -0.10V                                     */
  MDR_BKP_REG_62_TMR2_LDO_PLL_Trim_sub_0v15 = 7,/*!< sub_0v15 : LD0 extra voltage -0.15V                                       */
} MDR_BKP_REG_62_TMR2_LDO_PLL_Trim_Enum;

/* ========================================  MDR_BKP REG_62_TMR2 LDO_PLL_En [14..14]  ======================================== */
typedef enum {                                  /*!< MDR_BKP_REG_62_TMR2_LDO_PLL_En                                            */
  MDR_BKP_REG_62_TMR2_LDO_PLL_En_On    = 0,     /*!< On : Enable                                                               */
  MDR_BKP_REG_62_TMR2_LDO_PLL_En_Off   = 1,     /*!< Off : Disable                                                             */
} MDR_BKP_REG_62_TMR2_LDO_PLL_En_Enum;

/* =======================================  MDR_BKP REG_62_TMR2 LDO_PLL_RDY [15..15]  ======================================== */
typedef enum {                                  /*!< MDR_BKP_REG_62_TMR2_LDO_PLL_RDY                                           */
  MDR_BKP_REG_62_TMR2_LDO_PLL_RDY_NotReady = 0, /*!< NotReady : DUcc not ready                                                 */
  MDR_BKP_REG_62_TMR2_LDO_PLL_RDY_Ready = 1,    /*!< Ready : DUcc ready                                                        */
} MDR_BKP_REG_62_TMR2_LDO_PLL_RDY_Enum;

/* =========================================  MDR_BKP REG_62_TMR2 Trim_Ref [28..30]  ========================================= */
typedef enum {                                  /*!< MDR_BKP_REG_62_TMR2_Trim_Ref                                              */
  MDR_BKP_REG_62_TMR2_Trim_Ref_Tr0     = 0,     /*!< Tr0 : Trim                                                                */
  MDR_BKP_REG_62_TMR2_Trim_Ref_Tr1     = 1,     /*!< Tr1 : Trim                                                                */
  MDR_BKP_REG_62_TMR2_Trim_Ref_Tr2     = 2,     /*!< Tr2 : Trim                                                                */
  MDR_BKP_REG_62_TMR2_Trim_Ref_Tr3     = 3,     /*!< Tr3 : Trim                                                                */
  MDR_BKP_REG_62_TMR2_Trim_Ref_Tr4     = 4,     /*!< Tr4 : Trim                                                                */
  MDR_BKP_REG_62_TMR2_Trim_Ref_Tr5     = 5,     /*!< Tr5 : Trim                                                                */
  MDR_BKP_REG_62_TMR2_Trim_Ref_Tr6     = 6,     /*!< Tr6 : Trim                                                                */
  MDR_BKP_REG_62_TMR2_Trim_Ref_Tr7     = 7,     /*!< Tr7 : Trim                                                                */
} MDR_BKP_REG_62_TMR2_Trim_Ref_Enum;

/* ======================================================  REG_63_TMR2  ====================================================== */
/* ===========================================  MDR_BKP REG_63_TMR2 LSE_On [0..0]  =========================================== */
typedef enum {                                  /*!< MDR_BKP_REG_63_TMR2_LSE_On                                                */
  MDR_BKP_REG_63_TMR2_LSE_On_Off       = 0,     /*!< Off : Disable                                                             */
  MDR_BKP_REG_63_TMR2_LSE_On_On        = 1,     /*!< On : Enable                                                               */
} MDR_BKP_REG_63_TMR2_LSE_On_Enum;

/* ==========================================  MDR_BKP REG_63_TMR2 LSE_BYP [1..1]  =========================================== */
typedef enum {                                  /*!< MDR_BKP_REG_63_TMR2_LSE_BYP                                               */
  MDR_BKP_REG_63_TMR2_LSE_BYP_Off      = 0,     /*!< Off : Disable                                                             */
  MDR_BKP_REG_63_TMR2_LSE_BYP_On       = 1,     /*!< On : Enable                                                               */
} MDR_BKP_REG_63_TMR2_LSE_BYP_Enum;

/* ==========================================  MDR_BKP REG_63_TMR2 RTC_Sel [2..3]  =========================================== */
typedef enum {                                  /*!< MDR_BKP_REG_63_TMR2_RTC_Sel                                               */
  MDR_BKP_REG_63_TMR2_RTC_Sel_LSI      = 0,     /*!< LSI : LSI Clock                                                           */
  MDR_BKP_REG_63_TMR2_RTC_Sel_LSE      = 1,     /*!< LSE : LSE Clock                                                           */
  MDR_BKP_REG_63_TMR2_RTC_Sel_RTCCLK   = 2,     /*!< RTCCLK : RTCCLK Clock                                                     */
} MDR_BKP_REG_63_TMR2_RTC_Sel_Enum;

/* ===========================================  MDR_BKP REG_63_TMR2 RTC_En [4..4]  =========================================== */
typedef enum {                                  /*!< MDR_BKP_REG_63_TMR2_RTC_En                                                */
  MDR_BKP_REG_63_TMR2_RTC_En_Off       = 0,     /*!< Off : Disable                                                             */
  MDR_BKP_REG_63_TMR2_RTC_En_On        = 1,     /*!< On : Enable                                                               */
} MDR_BKP_REG_63_TMR2_RTC_En_Enum;

