StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* =========================================  MDR_BKP REG_63_TMR2 LSE_RDY [13..13]  ========================================== */
typedef enum {                                  /*!< MDR_BKP_REG_63_TMR2_LSE_RDY                                               */
  MDR_BKP_REG_63_TMR2_LSE_RDY_Off      = 0,     /*!< Off : Disable                                                             */
  MDR_BKP_REG_63_TMR2_LSE_RDY_On       = 1,     /*!< On : Enable                                                               */
} MDR_BKP_REG_63_TMR2_LSE_RDY_Enum;

/* =======================================  MDR_BKP REG_63_TMR2 LSE_FilterEn [14..14]  ======================================= */
typedef enum {                                  /*!< MDR_BKP_REG_63_TMR2_LSE_FilterEn                                          */
  MDR_BKP_REG_63_TMR2_LSE_FilterEn_Off = 0,     /*!< Off : Disable                                                             */
  MDR_BKP_REG_63_TMR2_LSE_FilterEn_On  = 1,     /*!< On : Enable                                                               */
} MDR_BKP_REG_63_TMR2_LSE_FilterEn_Enum;

/* ==========================================  MDR_BKP REG_63_TMR2 LSI_On [15..15]  ========================================== */
typedef enum {                                  /*!< MDR_BKP_REG_63_TMR2_LSI_On                                                */
  MDR_BKP_REG_63_TMR2_LSI_On_Off       = 0,     /*!< Off : Disable                                                             */
  MDR_BKP_REG_63_TMR2_LSI_On_On        = 1,     /*!< On : Enable                                                               */
} MDR_BKP_REG_63_TMR2_LSI_On_Enum;

/* =========================================  MDR_BKP REG_63_TMR2 LSI_Trim [16..20]  ========================================= */
typedef enum {                                  /*!< MDR_BKP_REG_63_TMR2_LSI_Trim                                              */
  MDR_BKP_REG_63_TMR2_LSI_Trim_Max8    = 0,     /*!< Max8 : LSI Trim                                                           */
  MDR_BKP_REG_63_TMR2_LSI_Trim_Max7    = 1,     /*!< Max7 : LSI Trim                                                           */
  MDR_BKP_REG_63_TMR2_LSI_Trim_Max6    = 2,     /*!< Max6 : LSI Trim                                                           */
  MDR_BKP_REG_63_TMR2_LSI_Trim_Max5    = 3,     /*!< Max5 : LSI Trim                                                           */
  MDR_BKP_REG_63_TMR2_LSI_Trim_Max4    = 4,     /*!< Max4 : LSI Trim                                                           */
  MDR_BKP_REG_63_TMR2_LSI_Trim_Max3    = 5,     /*!< Max3 : LSI Trim                                                           */
  MDR_BKP_REG_63_TMR2_LSI_Trim_Max2    = 6,     /*!< Max2 : LSI Trim                                                           */
  MDR_BKP_REG_63_TMR2_LSI_Trim_Max1    = 7,     /*!< Max1 : LSI Trim                                                           */
  MDR_BKP_REG_63_TMR2_LSI_Trim_Typical = 8,     /*!< Typical : LSI Default                                                     */
  MDR_BKP_REG_63_TMR2_LSI_Trim_Min1    = 9,     /*!< Min1 : LSI Trim                                                           */
  MDR_BKP_REG_63_TMR2_LSI_Trim_Min2    = 10,    /*!< Min2 : LSI Trim                                                           */
  MDR_BKP_REG_63_TMR2_LSI_Trim_Min3    = 11,    /*!< Min3 : LSI Trim                                                           */
  MDR_BKP_REG_63_TMR2_LSI_Trim_Min4    = 12,    /*!< Min4 : LSI Trim                                                           */
  MDR_BKP_REG_63_TMR2_LSI_Trim_Min5    = 13,    /*!< Min5 : LSI Trim                                                           */
  MDR_BKP_REG_63_TMR2_LSI_Trim_Min6    = 14,    /*!< Min6 : LSI Trim                                                           */
  MDR_BKP_REG_63_TMR2_LSI_Trim_Min7    = 15,    /*!< Min7 : LSI Trim                                                           */
} MDR_BKP_REG_63_TMR2_LSI_Trim_Enum;

/* =========================================  MDR_BKP REG_63_TMR2 LSI_RDY [21..21]  ========================================== */
typedef enum {                                  /*!< MDR_BKP_REG_63_TMR2_LSI_RDY                                               */
  MDR_BKP_REG_63_TMR2_LSI_RDY_Off      = 0,     /*!< Off : Disable                                                             */
  MDR_BKP_REG_63_TMR2_LSI_RDY_On       = 1,     /*!< On : Enable                                                               */
} MDR_BKP_REG_63_TMR2_LSI_RDY_Enum;

/* ==========================================  MDR_BKP REG_63_TMR2 HSI_On [22..22]  ========================================== */
typedef enum {                                  /*!< MDR_BKP_REG_63_TMR2_HSI_On                                                */
  MDR_BKP_REG_63_TMR2_HSI_On_Off       = 0,     /*!< Off : Disable                                                             */
  MDR_BKP_REG_63_TMR2_HSI_On_On        = 1,     /*!< On : Enable                                                               */
} MDR_BKP_REG_63_TMR2_HSI_On_Enum;

/* =========================================  MDR_BKP REG_63_TMR2 HSI_RDY [23..23]  ========================================== */
typedef enum {                                  /*!< MDR_BKP_REG_63_TMR2_HSI_RDY                                               */
  MDR_BKP_REG_63_TMR2_HSI_RDY_Off      = 0,     /*!< Off : Disable                                                             */
  MDR_BKP_REG_63_TMR2_HSI_RDY_On       = 1,     /*!< On : Enable                                                               */
} MDR_BKP_REG_63_TMR2_HSI_RDY_Enum;

/* =========================================  MDR_BKP REG_63_TMR2 STANDBY [30..30]  ========================================== */
typedef enum {                                  /*!< MDR_BKP_REG_63_TMR2_STANDBY                                               */
  MDR_BKP_REG_63_TMR2_STANDBY_Inactive = 0,     /*!< Inactive : No Action                                                      */
  MDR_BKP_REG_63_TMR2_STANDBY_GoStandby = 1,    /*!< GoStandby : Standby power off                                             */
} MDR_BKP_REG_63_TMR2_STANDBY_Enum;

