StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* =========================================  MDR_BKP REG_63_TMR2 RTC_RST [31..31]  ========================================== */
typedef enum {                                  /*!< MDR_BKP_REG_63_TMR2_RTC_RST                                               */
  MDR_BKP_REG_63_TMR2_RTC_RST_Off      = 0,     /*!< Off : Disable                                                             */
  MDR_BKP_REG_63_TMR2_RTC_RST_On       = 1,     /*!< On : Enable                                                               */
} MDR_BKP_REG_63_TMR2_RTC_RST_Enum;

/* =====================================================  RTC_CNT_TMR0  ====================================================== */
/* =====================================================  RTC_DIV_TMR0  ====================================================== */
/* =====================================================  RTC_PRL_TMR0  ====================================================== */
/* =====================================================  RTC_ALRM_TMR0  ===================================================== */
/* ======================================================  RTC_CS_TMR0  ====================================================== */
/* ============================================  MDR_BKP RTC_CS_TMR0 OWF [0..0]  ============================================= */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR0_OWF                                                   */
  MDR_BKP_RTC_CS_TMR0_OWF_Off          = 0,     /*!< Off : No Event                                                            */
  MDR_BKP_RTC_CS_TMR0_OWF_On           = 1,     /*!< On : Event                                                                */
} MDR_BKP_RTC_CS_TMR0_OWF_Enum;

/* ============================================  MDR_BKP RTC_CS_TMR0 SECF [1..1]  ============================================ */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR0_SECF                                                  */
  MDR_BKP_RTC_CS_TMR0_SECF_Off         = 0,     /*!< Off : No Event                                                            */
  MDR_BKP_RTC_CS_TMR0_SECF_On          = 1,     /*!< On : Event                                                                */
} MDR_BKP_RTC_CS_TMR0_SECF_Enum;

/* ============================================  MDR_BKP RTC_CS_TMR0 ALRF [2..2]  ============================================ */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR0_ALRF                                                  */
  MDR_BKP_RTC_CS_TMR0_ALRF_Off         = 0,     /*!< Off : No Event                                                            */
  MDR_BKP_RTC_CS_TMR0_ALRF_On          = 1,     /*!< On : Event                                                                */
} MDR_BKP_RTC_CS_TMR0_ALRF_Enum;

/* ===========================================  MDR_BKP RTC_CS_TMR0 OWF_IE [3..3]  =========================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR0_OWF_IE                                                */
  MDR_BKP_RTC_CS_TMR0_OWF_IE_Off       = 0,     /*!< Off : No Event                                                            */
  MDR_BKP_RTC_CS_TMR0_OWF_IE_On        = 1,     /*!< On : Event                                                                */
} MDR_BKP_RTC_CS_TMR0_OWF_IE_Enum;

/* ==========================================  MDR_BKP RTC_CS_TMR0 SECF_IE [4..4]  =========================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR0_SECF_IE                                               */
  MDR_BKP_RTC_CS_TMR0_SECF_IE_Off      = 0,     /*!< Off : No Event                                                            */
  MDR_BKP_RTC_CS_TMR0_SECF_IE_On       = 1,     /*!< On : Event                                                                */
} MDR_BKP_RTC_CS_TMR0_SECF_IE_Enum;

/* ==========================================  MDR_BKP RTC_CS_TMR0 ALRF_IE [5..5]  =========================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR0_ALRF_IE                                               */
  MDR_BKP_RTC_CS_TMR0_ALRF_IE_Off      = 0,     /*!< Off : No Event                                                            */
  MDR_BKP_RTC_CS_TMR0_ALRF_IE_On       = 1,     /*!< On : Event                                                                */
} MDR_BKP_RTC_CS_TMR0_ALRF_IE_Enum;

/* ============================================  MDR_BKP RTC_CS_TMR0 WEC [6..6]  ============================================= */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR0_WEC                                                   */
  MDR_BKP_RTC_CS_TMR0_WEC_Ready        = 0,     /*!< Ready : Registers available                                               */
  MDR_BKP_RTC_CS_TMR0_WEC_Busy         = 1,     /*!< Busy : Registers unavailable                                              */
} MDR_BKP_RTC_CS_TMR0_WEC_Enum;

/* ==========================================  MDR_BKP RTC_CS_TMR0 CLR_ERRx [7..7]  ========================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR0_CLR_ERRx                                              */
  MDR_BKP_RTC_CS_TMR0_CLR_ERRx_Inactive = 0,    /*!< Inactive : No Action                                                      */
  MDR_BKP_RTC_CS_TMR0_CLR_ERRx_Clear   = 1,     /*!< Clear : Clear ERR_x Errors                                                */
} MDR_BKP_RTC_CS_TMR0_CLR_ERRx_Enum;

/* ==========================================  MDR_BKP RTC_CS_TMR0 ERR_CNT [8..8]  =========================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR0_ERR_CNT                                               */
  MDR_BKP_RTC_CS_TMR0_ERR_CNT_Off      = 0,     /*!< Off : No event                                                            */
  MDR_BKP_RTC_CS_TMR0_ERR_CNT_On       = 1,     /*!< On : Event Active                                                         */
} MDR_BKP_RTC_CS_TMR0_ERR_CNT_Enum;

/* ==========================================  MDR_BKP RTC_CS_TMR0 ERR_DIV [9..9]  =========================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR0_ERR_DIV                                               */
  MDR_BKP_RTC_CS_TMR0_ERR_DIV_Off      = 0,     /*!< Off : No event                                                            */
  MDR_BKP_RTC_CS_TMR0_ERR_DIV_On       = 1,     /*!< On : Event Active                                                         */
} MDR_BKP_RTC_CS_TMR0_ERR_DIV_Enum;

/* ==========================================  MDR_BKP RTC_CS_TMR0 ERR_CM [10..10]  ========================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR0_ERR_CM                                                */
  MDR_BKP_RTC_CS_TMR0_ERR_CM_Off       = 0,     /*!< Off : No event                                                            */
  MDR_BKP_RTC_CS_TMR0_ERR_CM_On        = 1,     /*!< On : Event Active                                                         */
} MDR_BKP_RTC_CS_TMR0_ERR_CM_Enum;

/* ==========================================  MDR_BKP RTC_CS_TMR0 ERR_CC [11..11]  ========================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR0_ERR_CC                                                */
  MDR_BKP_RTC_CS_TMR0_ERR_CC_Off       = 0,     /*!< Off : No event                                                            */
  MDR_BKP_RTC_CS_TMR0_ERR_CC_On        = 1,     /*!< On : Event Active                                                         */
} MDR_BKP_RTC_CS_TMR0_ERR_CC_Enum;

/* =========================================  MDR_BKP RTC_CS_TMR0 ERR_CNTx [12..12]  ========================================= */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR0_ERR_CNTx                                              */
  MDR_BKP_RTC_CS_TMR0_ERR_CNTx_Off     = 0,     /*!< Off : No event                                                            */
  MDR_BKP_RTC_CS_TMR0_ERR_CNTx_On      = 1,     /*!< On : Event Active                                                         */
} MDR_BKP_RTC_CS_TMR0_ERR_CNTx_Enum;

