StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* =========================================  MDR_BKP RTC_CS_TMR0 ERR_DIVx [13..13]  ========================================= */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR0_ERR_DIVx                                              */
  MDR_BKP_RTC_CS_TMR0_ERR_DIVx_Off     = 0,     /*!< Off : No event                                                            */
  MDR_BKP_RTC_CS_TMR0_ERR_DIVx_On      = 1,     /*!< On : Event Active                                                         */
} MDR_BKP_RTC_CS_TMR0_ERR_DIVx_Enum;

/* =========================================  MDR_BKP RTC_CS_TMR0 ERR_CMx [14..14]  ========================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR0_ERR_CMx                                               */
  MDR_BKP_RTC_CS_TMR0_ERR_CMx_Off      = 0,     /*!< Off : No event                                                            */
  MDR_BKP_RTC_CS_TMR0_ERR_CMx_On       = 1,     /*!< On : Event Active                                                         */
} MDR_BKP_RTC_CS_TMR0_ERR_CMx_Enum;

/* ==========================================  MDR_BKP RTC_CS_TMR0 ERR_IE [15..15]  ========================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR0_ERR_IE                                                */
  MDR_BKP_RTC_CS_TMR0_ERR_IE_Off       = 0,     /*!< Off : Disable                                                             */
  MDR_BKP_RTC_CS_TMR0_ERR_IE_On        = 1,     /*!< On : Enable                                                               */
} MDR_BKP_RTC_CS_TMR0_ERR_IE_Enum;

/* =====================================================  RTC_CNT_TMR1  ====================================================== */
/* =====================================================  RTC_DIV_TMR1  ====================================================== */
/* =====================================================  RTC_PRL_TMR1  ====================================================== */
/* =====================================================  RTC_ALRM_TMR1  ===================================================== */
/* ======================================================  RTC_CS_TMR1  ====================================================== */
/* ============================================  MDR_BKP RTC_CS_TMR1 OWF [0..0]  ============================================= */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR1_OWF                                                   */
  MDR_BKP_RTC_CS_TMR1_OWF_Off          = 0,     /*!< Off : No Event                                                            */
  MDR_BKP_RTC_CS_TMR1_OWF_On           = 1,     /*!< On : Event                                                                */
} MDR_BKP_RTC_CS_TMR1_OWF_Enum;

/* ============================================  MDR_BKP RTC_CS_TMR1 SECF [1..1]  ============================================ */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR1_SECF                                                  */
  MDR_BKP_RTC_CS_TMR1_SECF_Off         = 0,     /*!< Off : No Event                                                            */
  MDR_BKP_RTC_CS_TMR1_SECF_On          = 1,     /*!< On : Event                                                                */
} MDR_BKP_RTC_CS_TMR1_SECF_Enum;

/* ============================================  MDR_BKP RTC_CS_TMR1 ALRF [2..2]  ============================================ */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR1_ALRF                                                  */
  MDR_BKP_RTC_CS_TMR1_ALRF_Off         = 0,     /*!< Off : No Event                                                            */
  MDR_BKP_RTC_CS_TMR1_ALRF_On          = 1,     /*!< On : Event                                                                */
} MDR_BKP_RTC_CS_TMR1_ALRF_Enum;

/* ===========================================  MDR_BKP RTC_CS_TMR1 OWF_IE [3..3]  =========================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR1_OWF_IE                                                */
  MDR_BKP_RTC_CS_TMR1_OWF_IE_Off       = 0,     /*!< Off : No Event                                                            */
  MDR_BKP_RTC_CS_TMR1_OWF_IE_On        = 1,     /*!< On : Event                                                                */
} MDR_BKP_RTC_CS_TMR1_OWF_IE_Enum;

/* ==========================================  MDR_BKP RTC_CS_TMR1 SECF_IE [4..4]  =========================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR1_SECF_IE                                               */
  MDR_BKP_RTC_CS_TMR1_SECF_IE_Off      = 0,     /*!< Off : No Event                                                            */
  MDR_BKP_RTC_CS_TMR1_SECF_IE_On       = 1,     /*!< On : Event                                                                */
} MDR_BKP_RTC_CS_TMR1_SECF_IE_Enum;

/* ==========================================  MDR_BKP RTC_CS_TMR1 ALRF_IE [5..5]  =========================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR1_ALRF_IE                                               */
  MDR_BKP_RTC_CS_TMR1_ALRF_IE_Off      = 0,     /*!< Off : No Event                                                            */
  MDR_BKP_RTC_CS_TMR1_ALRF_IE_On       = 1,     /*!< On : Event                                                                */
} MDR_BKP_RTC_CS_TMR1_ALRF_IE_Enum;

/* ============================================  MDR_BKP RTC_CS_TMR1 WEC [6..6]  ============================================= */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR1_WEC                                                   */
  MDR_BKP_RTC_CS_TMR1_WEC_Ready        = 0,     /*!< Ready : Registers available                                               */
  MDR_BKP_RTC_CS_TMR1_WEC_Busy         = 1,     /*!< Busy : Registers unavailable                                              */
} MDR_BKP_RTC_CS_TMR1_WEC_Enum;

/* ==========================================  MDR_BKP RTC_CS_TMR1 CLR_ERRx [7..7]  ========================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR1_CLR_ERRx                                              */
  MDR_BKP_RTC_CS_TMR1_CLR_ERRx_Inactive = 0,    /*!< Inactive : No Action                                                      */
  MDR_BKP_RTC_CS_TMR1_CLR_ERRx_Clear   = 1,     /*!< Clear : Clear ERR_x Errors                                                */
} MDR_BKP_RTC_CS_TMR1_CLR_ERRx_Enum;

/* ==========================================  MDR_BKP RTC_CS_TMR1 ERR_CNT [8..8]  =========================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR1_ERR_CNT                                               */
  MDR_BKP_RTC_CS_TMR1_ERR_CNT_Off      = 0,     /*!< Off : No event                                                            */
  MDR_BKP_RTC_CS_TMR1_ERR_CNT_On       = 1,     /*!< On : Event Active                                                         */
} MDR_BKP_RTC_CS_TMR1_ERR_CNT_Enum;

/* ==========================================  MDR_BKP RTC_CS_TMR1 ERR_DIV [9..9]  =========================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR1_ERR_DIV                                               */
  MDR_BKP_RTC_CS_TMR1_ERR_DIV_Off      = 0,     /*!< Off : No event                                                            */
  MDR_BKP_RTC_CS_TMR1_ERR_DIV_On       = 1,     /*!< On : Event Active                                                         */
} MDR_BKP_RTC_CS_TMR1_ERR_DIV_Enum;

/* ==========================================  MDR_BKP RTC_CS_TMR1 ERR_CM [10..10]  ========================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR1_ERR_CM                                                */
  MDR_BKP_RTC_CS_TMR1_ERR_CM_Off       = 0,     /*!< Off : No event                                                            */
  MDR_BKP_RTC_CS_TMR1_ERR_CM_On        = 1,     /*!< On : Event Active                                                         */
} MDR_BKP_RTC_CS_TMR1_ERR_CM_Enum;

