StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* ==========================================  MDR_BKP RTC_CS_TMR1 ERR_CC [11..11]  ========================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR1_ERR_CC                                                */
  MDR_BKP_RTC_CS_TMR1_ERR_CC_Off       = 0,     /*!< Off : No event                                                            */
  MDR_BKP_RTC_CS_TMR1_ERR_CC_On        = 1,     /*!< On : Event Active                                                         */
} MDR_BKP_RTC_CS_TMR1_ERR_CC_Enum;

/* =========================================  MDR_BKP RTC_CS_TMR1 ERR_CNTx [12..12]  ========================================= */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR1_ERR_CNTx                                              */
  MDR_BKP_RTC_CS_TMR1_ERR_CNTx_Off     = 0,     /*!< Off : No event                                                            */
  MDR_BKP_RTC_CS_TMR1_ERR_CNTx_On      = 1,     /*!< On : Event Active                                                         */
} MDR_BKP_RTC_CS_TMR1_ERR_CNTx_Enum;

/* =========================================  MDR_BKP RTC_CS_TMR1 ERR_DIVx [13..13]  ========================================= */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR1_ERR_DIVx                                              */
  MDR_BKP_RTC_CS_TMR1_ERR_DIVx_Off     = 0,     /*!< Off : No event                                                            */
  MDR_BKP_RTC_CS_TMR1_ERR_DIVx_On      = 1,     /*!< On : Event Active                                                         */
} MDR_BKP_RTC_CS_TMR1_ERR_DIVx_Enum;

/* =========================================  MDR_BKP RTC_CS_TMR1 ERR_CMx [14..14]  ========================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR1_ERR_CMx                                               */
  MDR_BKP_RTC_CS_TMR1_ERR_CMx_Off      = 0,     /*!< Off : No event                                                            */
  MDR_BKP_RTC_CS_TMR1_ERR_CMx_On       = 1,     /*!< On : Event Active                                                         */
} MDR_BKP_RTC_CS_TMR1_ERR_CMx_Enum;

/* ==========================================  MDR_BKP RTC_CS_TMR1 ERR_IE [15..15]  ========================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR1_ERR_IE                                                */
  MDR_BKP_RTC_CS_TMR1_ERR_IE_Off       = 0,     /*!< Off : Disable                                                             */
  MDR_BKP_RTC_CS_TMR1_ERR_IE_On        = 1,     /*!< On : Enable                                                               */
} MDR_BKP_RTC_CS_TMR1_ERR_IE_Enum;

/* =====================================================  RTC_CNT_TMR2  ====================================================== */
/* =====================================================  RTC_DIV_TMR2  ====================================================== */
/* =====================================================  RTC_PRL_TMR2  ====================================================== */
/* =====================================================  RTC_ALRM_TMR2  ===================================================== */
/* ======================================================  RTC_CS_TMR2  ====================================================== */
/* ============================================  MDR_BKP RTC_CS_TMR2 OWF [0..0]  ============================================= */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR2_OWF                                                   */
  MDR_BKP_RTC_CS_TMR2_OWF_Off          = 0,     /*!< Off : No Event                                                            */
  MDR_BKP_RTC_CS_TMR2_OWF_On           = 1,     /*!< On : Event                                                                */
} MDR_BKP_RTC_CS_TMR2_OWF_Enum;

/* ============================================  MDR_BKP RTC_CS_TMR2 SECF [1..1]  ============================================ */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR2_SECF                                                  */
  MDR_BKP_RTC_CS_TMR2_SECF_Off         = 0,     /*!< Off : No Event                                                            */
  MDR_BKP_RTC_CS_TMR2_SECF_On          = 1,     /*!< On : Event                                                                */
} MDR_BKP_RTC_CS_TMR2_SECF_Enum;

/* ============================================  MDR_BKP RTC_CS_TMR2 ALRF [2..2]  ============================================ */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR2_ALRF                                                  */
  MDR_BKP_RTC_CS_TMR2_ALRF_Off         = 0,     /*!< Off : No Event                                                            */
  MDR_BKP_RTC_CS_TMR2_ALRF_On          = 1,     /*!< On : Event                                                                */
} MDR_BKP_RTC_CS_TMR2_ALRF_Enum;

/* ===========================================  MDR_BKP RTC_CS_TMR2 OWF_IE [3..3]  =========================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR2_OWF_IE                                                */
  MDR_BKP_RTC_CS_TMR2_OWF_IE_Off       = 0,     /*!< Off : No Event                                                            */
  MDR_BKP_RTC_CS_TMR2_OWF_IE_On        = 1,     /*!< On : Event                                                                */
} MDR_BKP_RTC_CS_TMR2_OWF_IE_Enum;

/* ==========================================  MDR_BKP RTC_CS_TMR2 SECF_IE [4..4]  =========================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR2_SECF_IE                                               */
  MDR_BKP_RTC_CS_TMR2_SECF_IE_Off      = 0,     /*!< Off : No Event                                                            */
  MDR_BKP_RTC_CS_TMR2_SECF_IE_On       = 1,     /*!< On : Event                                                                */
} MDR_BKP_RTC_CS_TMR2_SECF_IE_Enum;

/* ==========================================  MDR_BKP RTC_CS_TMR2 ALRF_IE [5..5]  =========================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR2_ALRF_IE                                               */
  MDR_BKP_RTC_CS_TMR2_ALRF_IE_Off      = 0,     /*!< Off : No Event                                                            */
  MDR_BKP_RTC_CS_TMR2_ALRF_IE_On       = 1,     /*!< On : Event                                                                */
} MDR_BKP_RTC_CS_TMR2_ALRF_IE_Enum;

/* ============================================  MDR_BKP RTC_CS_TMR2 WEC [6..6]  ============================================= */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR2_WEC                                                   */
  MDR_BKP_RTC_CS_TMR2_WEC_Ready        = 0,     /*!< Ready : Registers available                                               */
  MDR_BKP_RTC_CS_TMR2_WEC_Busy         = 1,     /*!< Busy : Registers unavailable                                              */
} MDR_BKP_RTC_CS_TMR2_WEC_Enum;

