StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* ==========================================  MDR_BKP RTC_CS_TMR2 CLR_ERRx [7..7]  ========================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR2_CLR_ERRx                                              */
  MDR_BKP_RTC_CS_TMR2_CLR_ERRx_Inactive = 0,    /*!< Inactive : No Action                                                      */
  MDR_BKP_RTC_CS_TMR2_CLR_ERRx_Clear   = 1,     /*!< Clear : Clear ERR_x Errors                                                */
} MDR_BKP_RTC_CS_TMR2_CLR_ERRx_Enum;

/* ==========================================  MDR_BKP RTC_CS_TMR2 ERR_CNT [8..8]  =========================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR2_ERR_CNT                                               */
  MDR_BKP_RTC_CS_TMR2_ERR_CNT_Off      = 0,     /*!< Off : No event                                                            */
  MDR_BKP_RTC_CS_TMR2_ERR_CNT_On       = 1,     /*!< On : Event Active                                                         */
} MDR_BKP_RTC_CS_TMR2_ERR_CNT_Enum;

/* ==========================================  MDR_BKP RTC_CS_TMR2 ERR_DIV [9..9]  =========================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR2_ERR_DIV                                               */
  MDR_BKP_RTC_CS_TMR2_ERR_DIV_Off      = 0,     /*!< Off : No event                                                            */
  MDR_BKP_RTC_CS_TMR2_ERR_DIV_On       = 1,     /*!< On : Event Active                                                         */
} MDR_BKP_RTC_CS_TMR2_ERR_DIV_Enum;

/* ==========================================  MDR_BKP RTC_CS_TMR2 ERR_CM [10..10]  ========================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR2_ERR_CM                                                */
  MDR_BKP_RTC_CS_TMR2_ERR_CM_Off       = 0,     /*!< Off : No event                                                            */
  MDR_BKP_RTC_CS_TMR2_ERR_CM_On        = 1,     /*!< On : Event Active                                                         */
} MDR_BKP_RTC_CS_TMR2_ERR_CM_Enum;

/* ==========================================  MDR_BKP RTC_CS_TMR2 ERR_CC [11..11]  ========================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR2_ERR_CC                                                */
  MDR_BKP_RTC_CS_TMR2_ERR_CC_Off       = 0,     /*!< Off : No event                                                            */
  MDR_BKP_RTC_CS_TMR2_ERR_CC_On        = 1,     /*!< On : Event Active                                                         */
} MDR_BKP_RTC_CS_TMR2_ERR_CC_Enum;

/* =========================================  MDR_BKP RTC_CS_TMR2 ERR_CNTx [12..12]  ========================================= */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR2_ERR_CNTx                                              */
  MDR_BKP_RTC_CS_TMR2_ERR_CNTx_Off     = 0,     /*!< Off : No event                                                            */
  MDR_BKP_RTC_CS_TMR2_ERR_CNTx_On      = 1,     /*!< On : Event Active                                                         */
} MDR_BKP_RTC_CS_TMR2_ERR_CNTx_Enum;

/* =========================================  MDR_BKP RTC_CS_TMR2 ERR_DIVx [13..13]  ========================================= */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR2_ERR_DIVx                                              */
  MDR_BKP_RTC_CS_TMR2_ERR_DIVx_Off     = 0,     /*!< Off : No event                                                            */
  MDR_BKP_RTC_CS_TMR2_ERR_DIVx_On      = 1,     /*!< On : Event Active                                                         */
} MDR_BKP_RTC_CS_TMR2_ERR_DIVx_Enum;

/* =========================================  MDR_BKP RTC_CS_TMR2 ERR_CMx [14..14]  ========================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR2_ERR_CMx                                               */
  MDR_BKP_RTC_CS_TMR2_ERR_CMx_Off      = 0,     /*!< Off : No event                                                            */
  MDR_BKP_RTC_CS_TMR2_ERR_CMx_On       = 1,     /*!< On : Event Active                                                         */
} MDR_BKP_RTC_CS_TMR2_ERR_CMx_Enum;

/* ==========================================  MDR_BKP RTC_CS_TMR2 ERR_IE [15..15]  ========================================== */
typedef enum {                                  /*!< MDR_BKP_RTC_CS_TMR2_ERR_IE                                                */
  MDR_BKP_RTC_CS_TMR2_ERR_IE_Off       = 0,     /*!< Off : Disable                                                             */
  MDR_BKP_RTC_CS_TMR2_ERR_IE_On        = 1,     /*!< On : Enable                                                               */
} MDR_BKP_RTC_CS_TMR2_ERR_IE_Enum;



/* =========================================================================================================================== */
/* ================                                         MDR_SRAM                                          ================ */
/* =========================================================================================================================== */

/* ==========================================================  KEY  ========================================================== */
/* =========================================================  CNTR  ========================================================== */
/* =============================================  MDR_SRAM CNTR WAITCYCL [0..3]  ============================================= */
typedef enum {                                  /*!< MDR_SRAM_CNTR_WAITCYCL                                                    */
  MDR_SRAM_CNTR_WAITCYCL_Forbiden      = 0,     /*!< Forbiden : Forbiden value                                                 */
  MDR_SRAM_CNTR_WAITCYCL_20MHz83       = 1,     /*!< 20MHz83 : Delay for clock up to 20.83 MHz                                 */
  MDR_SRAM_CNTR_WAITCYCL_41MHz66       = 2,     /*!< 41MHz66 : Delay for clock up to 41.66 MHz                                 */
  MDR_SRAM_CNTR_WAITCYCL_62MHz5        = 3,     /*!< 62MHz5 : Delay for clock up to 62.5 MHz                                   */
  MDR_SRAM_CNTR_WAITCYCL_83MHz33       = 4,     /*!< 83MHz33 : Delay for clock up to 83.33 MHz                                 */
  MDR_SRAM_CNTR_WAITCYCL_100MHz        = 5,     /*!< 100MHz : Delay for clock up to 100 MHz                                    */
} MDR_SRAM_CNTR_WAITCYCL_Enum;

