StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* ============================================  MDR_SRAM CNTR REG_ACCESS [4..4]  ============================================ */
typedef enum {                                  /*!< MDR_SRAM_CNTR_REG_ACCESS                                                  */
  MDR_SRAM_CNTR_REG_ACCESS_Off         = 0,     /*!< Off : Bus access                                                          */
  MDR_SRAM_CNTR_REG_ACCESS_On          = 1,     /*!< On : Access through registers                                             */
} MDR_SRAM_CNTR_REG_ACCESS_Enum;

/* ===============================================  MDR_SRAM CNTR CLK [5..5]  ================================================ */
typedef enum {                                  /*!< MDR_SRAM_CNTR_CLK                                                         */
  MDR_SRAM_CNTR_CLK_Low                = 0,     /*!< Low : Logic 0                                                             */
  MDR_SRAM_CNTR_CLK_High               = 1,     /*!< High : Logic 1                                                            */
} MDR_SRAM_CNTR_CLK_Enum;

/* ================================================  MDR_SRAM CNTR OE [7..7]  ================================================ */
typedef enum {                                  /*!< MDR_SRAM_CNTR_OE                                                          */
  MDR_SRAM_CNTR_OE_ReadEna             = 0,     /*!< ReadEna : Read Enable                                                     */
  MDR_SRAM_CNTR_OE_Ivactive            = 1,     /*!< Ivactive : Read Disable                                                   */
} MDR_SRAM_CNTR_OE_Enum;

/* ==============================================  MDR_SRAM CNTR WE_x00 [9..9]  ============================================== */
typedef enum {                                  /*!< MDR_SRAM_CNTR_WE_x00                                                      */
  MDR_SRAM_CNTR_WE_x00_WriteEna        = 0,     /*!< WriteEna : Write Enable                                                   */
  MDR_SRAM_CNTR_WE_x00_Ivactive        = 1,     /*!< Ivactive : Write Disable                                                  */
} MDR_SRAM_CNTR_WE_x00_Enum;

/* =============================================  MDR_SRAM CNTR WE_x04 [10..10]  ============================================= */
typedef enum {                                  /*!< MDR_SRAM_CNTR_WE_x04                                                      */
  MDR_SRAM_CNTR_WE_x04_WriteEna        = 0,     /*!< WriteEna : Write Enable                                                   */
  MDR_SRAM_CNTR_WE_x04_Ivactive        = 1,     /*!< Ivactive : Write Disable                                                  */
} MDR_SRAM_CNTR_WE_x04_Enum;

/* =============================================  MDR_SRAM CNTR WE_x08 [11..11]  ============================================= */
typedef enum {                                  /*!< MDR_SRAM_CNTR_WE_x08                                                      */
  MDR_SRAM_CNTR_WE_x08_WriteEna        = 0,     /*!< WriteEna : Write Enable                                                   */
  MDR_SRAM_CNTR_WE_x08_Ivactive        = 1,     /*!< Ivactive : Write Disable                                                  */
} MDR_SRAM_CNTR_WE_x08_Enum;

/* =============================================  MDR_SRAM CNTR WE_x0C [12..12]  ============================================= */
typedef enum {                                  /*!< MDR_SRAM_CNTR_WE_x0C                                                      */
  MDR_SRAM_CNTR_WE_x0C_WriteEna        = 0,     /*!< WriteEna : Write Enable                                                   */
  MDR_SRAM_CNTR_WE_x0C_Ivactive        = 1,     /*!< Ivactive : Write Disable                                                  */
} MDR_SRAM_CNTR_WE_x0C_Enum;

/* =============================================  MDR_SRAM CNTR WE_ECC [13..13]  ============================================= */
typedef enum {                                  /*!< MDR_SRAM_CNTR_WE_ECC                                                      */
  MDR_SRAM_CNTR_WE_ECC_WriteEna        = 0,     /*!< WriteEna : Write Enable                                                   */
  MDR_SRAM_CNTR_WE_ECC_Ivactive        = 1,     /*!< Ivactive : Write Disable                                                  */
} MDR_SRAM_CNTR_WE_ECC_Enum;

/* ==============================================  MDR_SRAM CNTR CEN [14..14]  =============================================== */
typedef enum {                                  /*!< MDR_SRAM_CNTR_CEN                                                         */
  MDR_SRAM_CNTR_CEN_Active             = 0,     /*!< Active : Memory selected                                                  */
  MDR_SRAM_CNTR_CEN_Ivactive           = 1,     /*!< Ivactive : Memory not selected                                            */
} MDR_SRAM_CNTR_CEN_Enum;

/* ==========================================================  ADR  ========================================================== */
/* =========================================================  WDATA  ========================================================= */
/* =========================================================  RDATA  ========================================================= */
/* =========================================================  ECCCS  ========================================================= */
/* ==============================================  MDR_SRAM ECCCS SECC [0..0]  =============================================== */
typedef enum {                                  /*!< MDR_SRAM_ECCCS_SECC                                                       */
  MDR_SRAM_ECCCS_SECC_Off              = 0,     /*!< Off : No Event detected                                                   */
  MDR_SRAM_ECCCS_SECC_On               = 1,     /*!< On : Event detected                                                       */
} MDR_SRAM_ECCCS_SECC_Enum;

/* ==============================================  MDR_SRAM ECCCS DECC [1..1]  =============================================== */
typedef enum {                                  /*!< MDR_SRAM_ECCCS_DECC                                                       */
  MDR_SRAM_ECCCS_DECC_Off              = 0,     /*!< Off : No Event detected                                                   */
  MDR_SRAM_ECCCS_DECC_On               = 1,     /*!< On : Event detected                                                       */
} MDR_SRAM_ECCCS_DECC_Enum;

/* =============================================  MDR_SRAM ECCCS SECC_IE [2..2]  ============================================= */
typedef enum {                                  /*!< MDR_SRAM_ECCCS_SECC_IE                                                    */
  MDR_SRAM_ECCCS_SECC_IE_Off           = 0,     /*!< Off : Disable                                                             */
  MDR_SRAM_ECCCS_SECC_IE_On            = 1,     /*!< On : Enable                                                               */
} MDR_SRAM_ECCCS_SECC_IE_Enum;

/* =============================================  MDR_SRAM ECCCS DECC_IE [3..3]  ============================================= */
typedef enum {                                  /*!< MDR_SRAM_ECCCS_DECC_IE                                                    */
  MDR_SRAM_ECCCS_DECC_IE_Off           = 0,     /*!< Off : Disable                                                             */
  MDR_SRAM_ECCCS_DECC_IE_On            = 1,     /*!< On : Enable                                                               */
} MDR_SRAM_ECCCS_DECC_IE_Enum;

