StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* ============================================  MDR_SRAM ECCCS FIX_SECC [4..4]  ============================================= */
typedef enum {                                  /*!< MDR_SRAM_ECCCS_FIX_SECC                                                   */
  MDR_SRAM_ECCCS_FIX_SECC_Off          = 0,     /*!< Off : Disable                                                             */
  MDR_SRAM_ECCCS_FIX_SECC_On           = 1,     /*!< On : Enable                                                               */
} MDR_SRAM_ECCCS_FIX_SECC_Enum;

/* ============================================  MDR_SRAM ECCCS FIX_DECC [5..5]  ============================================= */
typedef enum {                                  /*!< MDR_SRAM_ECCCS_FIX_DECC                                                   */
  MDR_SRAM_ECCCS_FIX_DECC_Off          = 0,     /*!< Off : Disable                                                             */
  MDR_SRAM_ECCCS_FIX_DECC_On           = 1,     /*!< On : Enable                                                               */
} MDR_SRAM_ECCCS_FIX_DECC_Enum;

/* ============================================  MDR_SRAM ECCCS CLR_SECNT [6..6]  ============================================ */
typedef enum {                                  /*!< MDR_SRAM_ECCCS_CLR_SECNT                                                  */
  MDR_SRAM_ECCCS_CLR_SECNT_Inactive    = 0,     /*!< Inactive : No Action                                                      */
  MDR_SRAM_ECCCS_CLR_SECNT_Clear       = 1,     /*!< Clear : Action                                                            */
} MDR_SRAM_ECCCS_CLR_SECNT_Enum;

/* ============================================  MDR_SRAM ECCCS CLR_DECNT [7..7]  ============================================ */
typedef enum {                                  /*!< MDR_SRAM_ECCCS_CLR_DECNT                                                  */
  MDR_SRAM_ECCCS_CLR_DECNT_Inactive    = 0,     /*!< Inactive : No Action                                                      */
  MDR_SRAM_ECCCS_CLR_DECNT_Clear       = 1,     /*!< Clear : Action                                                            */
} MDR_SRAM_ECCCS_CLR_DECNT_Enum;

/* ========================================================  ECCADR  ========================================================= */
/* ========================================================  ECCDATA  ======================================================== */
/* ========================================================  ECCECC  ========================================================= */
/* ======================================================  TEST_TUNING  ====================================================== */
/* =======================================  MDR_SRAM TEST_TUNING SRAM_TIMEOUT [0..2]  ======================================== */
typedef enum {                                  /*!< MDR_SRAM_TEST_TUNING_SRAM_TIMEOUT                                         */
  MDR_SRAM_TEST_TUNING_SRAM_TIMEOUT_Time_HardMax = 0,/*!< Time_HardMax : SRAM Read Timeout                                     */
  MDR_SRAM_TEST_TUNING_SRAM_TIMEOUT_Time_Hard2 = 1,/*!< Time_Hard2 : SRAM Read Timeout                                         */
  MDR_SRAM_TEST_TUNING_SRAM_TIMEOUT_Time_Norm = 2,/*!< Time_Norm : SRAM Read Timeout                                           */
  MDR_SRAM_TEST_TUNING_SRAM_TIMEOUT_Time_Easy1 = 3,/*!< Time_Easy1 : SRAM Read Timeout                                         */
  MDR_SRAM_TEST_TUNING_SRAM_TIMEOUT_Time_Easy2 = 4,/*!< Time_Easy2 : SRAM Read Timeout                                         */
  MDR_SRAM_TEST_TUNING_SRAM_TIMEOUT_Time_Easy3 = 5,/*!< Time_Easy3 : SRAM Read Timeout                                         */
  MDR_SRAM_TEST_TUNING_SRAM_TIMEOUT_Time_Easy4 = 6,/*!< Time_Easy4 : SRAM Read Timeout                                         */
  MDR_SRAM_TEST_TUNING_SRAM_TIMEOUT_Time_EasyMax = 7,/*!< Time_EasyMax : SRAM Read Timeout                                     */
} MDR_SRAM_TEST_TUNING_SRAM_TIMEOUT_Enum;

/* ============================================  MDR_SRAM TEST_TUNING TE [4..5]  ============================================= */
typedef enum {                                  /*!< MDR_SRAM_TEST_TUNING_TE                                                   */
  MDR_SRAM_TEST_TUNING_TE_Off          = 0,     /*!< Off : Normal Operation                                                    */
  MDR_SRAM_TEST_TUNING_TE_Test_1       = 1,     /*!< Test_1 : Test Mode 1                                                      */
  MDR_SRAM_TEST_TUNING_TE_Test_2       = 2,     /*!< Test_2 : Test Mode 2                                                      */
  MDR_SRAM_TEST_TUNING_TE_Test_3       = 3,     /*!< Test_3 : Test Mode 3                                                      */
} MDR_SRAM_TEST_TUNING_TE_Enum;

/* =======================================  MDR_SRAM TEST_TUNING TIME_TUNING [8..10]  ======================================== */
typedef enum {                                  /*!< MDR_SRAM_TEST_TUNING_TIME_TUNING                                          */
  MDR_SRAM_TEST_TUNING_TIME_TUNING_Time_HardMax = 0,/*!< Time_HardMax : Read Timeout                                           */
  MDR_SRAM_TEST_TUNING_TIME_TUNING_Time_Hard2 = 1,/*!< Time_Hard2 : Read Timeout                                               */
  MDR_SRAM_TEST_TUNING_TIME_TUNING_Time_Hard1 = 2,/*!< Time_Hard1 : Read Timeout                                               */
  MDR_SRAM_TEST_TUNING_TIME_TUNING_Time_Norm = 3,/*!< Time_Norm : Read Timeout                                                 */
  MDR_SRAM_TEST_TUNING_TIME_TUNING_Time_Easy1 = 4,/*!< Time_Easy1 : Read Timeout                                               */
  MDR_SRAM_TEST_TUNING_TIME_TUNING_Time_Easy2 = 5,/*!< Time_Easy2 : Read Timeout                                               */
  MDR_SRAM_TEST_TUNING_TIME_TUNING_Time_Easy3 = 6,/*!< Time_Easy3 : Read Timeout                                               */
  MDR_SRAM_TEST_TUNING_TIME_TUNING_Time_EasyMax = 7,/*!< Time_EasyMax : Read Timeout                                           */
} MDR_SRAM_TEST_TUNING_TIME_TUNING_Enum;

/* =======================================  MDR_SRAM TEST_TUNING REPL_TUNING [16..19]  ======================================= */
typedef enum {                                  /*!< MDR_SRAM_TEST_TUNING_REPL_TUNING                                          */
  MDR_SRAM_TEST_TUNING_REPL_TUNING_Repl_EasyMax = 0,/*!< Repl_EasyMax : Read Resistance                                        */
  MDR_SRAM_TEST_TUNING_REPL_TUNING_Repl_Easy1 = 1,/*!< Repl_Easy1 : Read Resistance                                            */
  MDR_SRAM_TEST_TUNING_REPL_TUNING_Repl_Norm = 2,/*!< Repl_Norm : Read Resistance                                              */
  MDR_SRAM_TEST_TUNING_REPL_TUNING_Repl_Hard1 = 3,/*!< Repl_Hard1 : Read Resistance                                            */
  MDR_SRAM_TEST_TUNING_REPL_TUNING_Repl_Hard2 = 4,/*!< Repl_Hard2 : Read Resistance                                            */
  MDR_SRAM_TEST_TUNING_REPL_TUNING_Repl_Hard3 = 5,/*!< Repl_Hard3 : Read Resistance                                            */
  MDR_SRAM_TEST_TUNING_REPL_TUNING_Repl_Hard4 = 6,/*!< Repl_Hard4 : Read Resistance                                            */
  MDR_SRAM_TEST_TUNING_REPL_TUNING_Repl_Hard5 = 7,/*!< Repl_Hard5 : Read Resistance                                            */
  MDR_SRAM_TEST_TUNING_REPL_TUNING_Repl_Hard6 = 8,/*!< Repl_Hard6 : Read Resistance                                            */
  MDR_SRAM_TEST_TUNING_REPL_TUNING_Repl_Hard7 = 9,/*!< Repl_Hard7 : Read Resistance                                            */
  MDR_SRAM_TEST_TUNING_REPL_TUNING_Repl_Hard8 = 10,/*!< Repl_Hard8 : Read Resistance                                           */
  MDR_SRAM_TEST_TUNING_REPL_TUNING_Repl_Hard9 = 11,/*!< Repl_Hard9 : Read Resistance                                           */
  MDR_SRAM_TEST_TUNING_REPL_TUNING_Repl_Hard10 = 12,/*!< Repl_Hard10 : Read Resistance                                         */
  MDR_SRAM_TEST_TUNING_REPL_TUNING_Repl_Hard11 = 13,/*!< Repl_Hard11 : Read Resistance                                         */
  MDR_SRAM_TEST_TUNING_REPL_TUNING_Repl_Hard12 = 14,/*!< Repl_Hard12 : Read Resistance                                         */
  MDR_SRAM_TEST_TUNING_REPL_TUNING_Repl_HardMax = 15,/*!< Repl_HardMax : Read Resistance                                       */
} MDR_SRAM_TEST_TUNING_REPL_TUNING_Enum;



/* =========================================================================================================================== */
/* ================                                         MDR_PORTA                                         ================ */
/* =========================================================================================================================== */

/* ==========================================================  KEY  ========================================================== */
/* =========================================================  RXTX  ========================================================== */
/* ==============================================  MDR_PORTA RXTX Pin_ [0..0]  =============================================== */
typedef enum {                                  /*!< MDR_PORTA_RXTX_Pin_                                                       */
  MDR_PORTA_RXTX_Pin__Low              = 0,     /*!< Low : LOW Level Voltage                                                   */
  MDR_PORTA_RXTX_Pin__High             = 1,     /*!< High : HIGH Level Voltage                                                 */
} MDR_PORTA_RXTX_Pin__Enum;

/* =======================================================  RXTX_Set  ======================================================== */
/* ============================================  MDR_PORTA RXTX_Set Pin_ [0..0]  ============================================= */
typedef enum {                                  /*!< MDR_PORTA_RXTX_Set_Pin_                                                   */
  MDR_PORTA_RXTX_Set_Pin__Off          = 0,     /*!< Off : Do nothing                                                          */
  MDR_PORTA_RXTX_Set_Pin__SET          = 1,     /*!< SET : Set pin                                                             */
} MDR_PORTA_RXTX_Set_Pin__Enum;

