StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* ======================================================  RXTX_Clear  ======================================================= */
/* ===========================================  MDR_PORTA RXTX_Clear Pin_ [0..0]  ============================================ */
typedef enum {                                  /*!< MDR_PORTA_RXTX_Clear_Pin_                                                 */
  MDR_PORTA_RXTX_Clear_Pin__Off        = 0,     /*!< Off : Do nothing                                                          */
  MDR_PORTA_RXTX_Clear_Pin__CLEAR      = 1,     /*!< CLEAR : Clear pin                                                         */
} MDR_PORTA_RXTX_Clear_Pin__Enum;

/* ==========================================================  OE  =========================================================== */
/* ===============================================  MDR_PORTA OE Pin_ [0..0]  ================================================ */
typedef enum {                                  /*!< MDR_PORTA_OE_Pin_                                                         */
  MDR_PORTA_OE_Pin__IN                 = 0,     /*!< IN : Input pin                                                            */
  MDR_PORTA_OE_Pin__OUT                = 1,     /*!< OUT : Output pin                                                          */
} MDR_PORTA_OE_Pin__Enum;

/* ========================================================  OE_Set  ========================================================= */
/* =============================================  MDR_PORTA OE_Set Pin_ [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_PORTA_OE_Set_Pin_                                                     */
  MDR_PORTA_OE_Set_Pin__Off            = 0,     /*!< Off : Do nothing                                                          */
  MDR_PORTA_OE_Set_Pin__SET            = 1,     /*!< SET : Set pin                                                             */
} MDR_PORTA_OE_Set_Pin__Enum;

/* =======================================================  OE_Clear  ======================================================== */
/* ============================================  MDR_PORTA OE_Clear Pin_ [0..0]  ============================================= */
typedef enum {                                  /*!< MDR_PORTA_OE_Clear_Pin_                                                   */
  MDR_PORTA_OE_Clear_Pin__Off          = 0,     /*!< Off : Do nothing                                                          */
  MDR_PORTA_OE_Clear_Pin__CLEAR        = 1,     /*!< CLEAR : Clear pin                                                         */
} MDR_PORTA_OE_Clear_Pin__Enum;

/* =========================================================  FUNC0  ========================================================= */
/* ===========================================  MDR_PORTA FUNC0 Func_Pin_ [0..3]  ============================================ */
typedef enum {                                  /*!< MDR_PORTA_FUNC0_Func_Pin_                                                 */
  MDR_PORTA_FUNC0_Func_Pin__PORT       = 0,     /*!< PORT : User Pin control                                                   */
  MDR_PORTA_FUNC0_Func_Pin__Func_1     = 1,     /*!< Func_1 : Function periph pin control                                      */
  MDR_PORTA_FUNC0_Func_Pin__Func_2     = 2,     /*!< Func_2 : Function periph pin control                                      */
  MDR_PORTA_FUNC0_Func_Pin__Func_3     = 3,     /*!< Func_3 : Function periph pin control                                      */
  MDR_PORTA_FUNC0_Func_Pin__Func_4     = 4,     /*!< Func_4 : Function periph pin control                                      */
  MDR_PORTA_FUNC0_Func_Pin__Func_5     = 5,     /*!< Func_5 : Function periph pin control                                      */
  MDR_PORTA_FUNC0_Func_Pin__Func_6     = 6,     /*!< Func_6 : Function periph pin control                                      */
  MDR_PORTA_FUNC0_Func_Pin__Func_7     = 7,     /*!< Func_7 : Function periph pin control                                      */
  MDR_PORTA_FUNC0_Func_Pin__Func_8     = 8,     /*!< Func_8 : Function periph pin control                                      */
  MDR_PORTA_FUNC0_Func_Pin__Func_9     = 9,     /*!< Func_9 : Function periph pin control                                      */
  MDR_PORTA_FUNC0_Func_Pin__Func_10    = 10,    /*!< Func_10 : Function periph pin control                                     */
  MDR_PORTA_FUNC0_Func_Pin__Func_11    = 11,    /*!< Func_11 : Function periph pin control                                     */
  MDR_PORTA_FUNC0_Func_Pin__Func_12    = 12,    /*!< Func_12 : Function periph pin control                                     */
  MDR_PORTA_FUNC0_Func_Pin__Func_13    = 13,    /*!< Func_13 : Function periph pin control                                     */
  MDR_PORTA_FUNC0_Func_Pin__Func_14    = 14,    /*!< Func_14 : Function periph pin control                                     */
  MDR_PORTA_FUNC0_Func_Pin__Func_15    = 15,    /*!< Func_15 : Function periph pin control                                     */
} MDR_PORTA_FUNC0_Func_Pin__Enum;

/* =========================================================  FUNC1  ========================================================= */
/* ===========================================  MDR_PORTA FUNC1 Func_Pin_ [0..3]  ============================================ */
typedef enum {                                  /*!< MDR_PORTA_FUNC1_Func_Pin_                                                 */
  MDR_PORTA_FUNC1_Func_Pin__PORT       = 0,     /*!< PORT : User Pin control                                                   */
  MDR_PORTA_FUNC1_Func_Pin__Func_1     = 1,     /*!< Func_1 : Function periph pin control                                      */
  MDR_PORTA_FUNC1_Func_Pin__Func_2     = 2,     /*!< Func_2 : Function periph pin control                                      */
  MDR_PORTA_FUNC1_Func_Pin__Func_3     = 3,     /*!< Func_3 : Function periph pin control                                      */
  MDR_PORTA_FUNC1_Func_Pin__Func_4     = 4,     /*!< Func_4 : Function periph pin control                                      */
  MDR_PORTA_FUNC1_Func_Pin__Func_5     = 5,     /*!< Func_5 : Function periph pin control                                      */
  MDR_PORTA_FUNC1_Func_Pin__Func_6     = 6,     /*!< Func_6 : Function periph pin control                                      */
  MDR_PORTA_FUNC1_Func_Pin__Func_7     = 7,     /*!< Func_7 : Function periph pin control                                      */
  MDR_PORTA_FUNC1_Func_Pin__Func_8     = 8,     /*!< Func_8 : Function periph pin control                                      */
  MDR_PORTA_FUNC1_Func_Pin__Func_9     = 9,     /*!< Func_9 : Function periph pin control                                      */
  MDR_PORTA_FUNC1_Func_Pin__Func_10    = 10,    /*!< Func_10 : Function periph pin control                                     */
  MDR_PORTA_FUNC1_Func_Pin__Func_11    = 11,    /*!< Func_11 : Function periph pin control                                     */
  MDR_PORTA_FUNC1_Func_Pin__Func_12    = 12,    /*!< Func_12 : Function periph pin control                                     */
  MDR_PORTA_FUNC1_Func_Pin__Func_13    = 13,    /*!< Func_13 : Function periph pin control                                     */
  MDR_PORTA_FUNC1_Func_Pin__Func_14    = 14,    /*!< Func_14 : Function periph pin control                                     */
  MDR_PORTA_FUNC1_Func_Pin__Func_15    = 15,    /*!< Func_15 : Function periph pin control                                     */
} MDR_PORTA_FUNC1_Func_Pin__Enum;

/* =========================================================  FUNC2  ========================================================= */
/* ===========================================  MDR_PORTA FUNC2 Func_Pin_ [0..3]  ============================================ */
typedef enum {                                  /*!< MDR_PORTA_FUNC2_Func_Pin_                                                 */
  MDR_PORTA_FUNC2_Func_Pin__PORT       = 0,     /*!< PORT : User Pin control                                                   */
  MDR_PORTA_FUNC2_Func_Pin__Func_1     = 1,     /*!< Func_1 : Function periph pin control                                      */
  MDR_PORTA_FUNC2_Func_Pin__Func_2     = 2,     /*!< Func_2 : Function periph pin control                                      */
  MDR_PORTA_FUNC2_Func_Pin__Func_3     = 3,     /*!< Func_3 : Function periph pin control                                      */
  MDR_PORTA_FUNC2_Func_Pin__Func_4     = 4,     /*!< Func_4 : Function periph pin control                                      */
  MDR_PORTA_FUNC2_Func_Pin__Func_5     = 5,     /*!< Func_5 : Function periph pin control                                      */
  MDR_PORTA_FUNC2_Func_Pin__Func_6     = 6,     /*!< Func_6 : Function periph pin control                                      */
  MDR_PORTA_FUNC2_Func_Pin__Func_7     = 7,     /*!< Func_7 : Function periph pin control                                      */
  MDR_PORTA_FUNC2_Func_Pin__Func_8     = 8,     /*!< Func_8 : Function periph pin control                                      */
  MDR_PORTA_FUNC2_Func_Pin__Func_9     = 9,     /*!< Func_9 : Function periph pin control                                      */
  MDR_PORTA_FUNC2_Func_Pin__Func_10    = 10,    /*!< Func_10 : Function periph pin control                                     */
  MDR_PORTA_FUNC2_Func_Pin__Func_11    = 11,    /*!< Func_11 : Function periph pin control                                     */
  MDR_PORTA_FUNC2_Func_Pin__Func_12    = 12,    /*!< Func_12 : Function periph pin control                                     */
  MDR_PORTA_FUNC2_Func_Pin__Func_13    = 13,    /*!< Func_13 : Function periph pin control                                     */
  MDR_PORTA_FUNC2_Func_Pin__Func_14    = 14,    /*!< Func_14 : Function periph pin control                                     */
  MDR_PORTA_FUNC2_Func_Pin__Func_15    = 15,    /*!< Func_15 : Function periph pin control                                     */
} MDR_PORTA_FUNC2_Func_Pin__Enum;

/* =========================================================  FUNC3  ========================================================= */
/* ===========================================  MDR_PORTA FUNC3 Func_Pin_ [0..3]  ============================================ */
typedef enum {                                  /*!< MDR_PORTA_FUNC3_Func_Pin_                                                 */
  MDR_PORTA_FUNC3_Func_Pin__PORT       = 0,     /*!< PORT : User Pin control                                                   */
  MDR_PORTA_FUNC3_Func_Pin__Func_1     = 1,     /*!< Func_1 : Function periph pin control                                      */
  MDR_PORTA_FUNC3_Func_Pin__Func_2     = 2,     /*!< Func_2 : Function periph pin control                                      */
  MDR_PORTA_FUNC3_Func_Pin__Func_3     = 3,     /*!< Func_3 : Function periph pin control                                      */
  MDR_PORTA_FUNC3_Func_Pin__Func_4     = 4,     /*!< Func_4 : Function periph pin control                                      */
  MDR_PORTA_FUNC3_Func_Pin__Func_5     = 5,     /*!< Func_5 : Function periph pin control                                      */
  MDR_PORTA_FUNC3_Func_Pin__Func_6     = 6,     /*!< Func_6 : Function periph pin control                                      */
  MDR_PORTA_FUNC3_Func_Pin__Func_7     = 7,     /*!< Func_7 : Function periph pin control                                      */
  MDR_PORTA_FUNC3_Func_Pin__Func_8     = 8,     /*!< Func_8 : Function periph pin control                                      */
  MDR_PORTA_FUNC3_Func_Pin__Func_9     = 9,     /*!< Func_9 : Function periph pin control                                      */
  MDR_PORTA_FUNC3_Func_Pin__Func_10    = 10,    /*!< Func_10 : Function periph pin control                                     */
  MDR_PORTA_FUNC3_Func_Pin__Func_11    = 11,    /*!< Func_11 : Function periph pin control                                     */
  MDR_PORTA_FUNC3_Func_Pin__Func_12    = 12,    /*!< Func_12 : Function periph pin control                                     */
  MDR_PORTA_FUNC3_Func_Pin__Func_13    = 13,    /*!< Func_13 : Function periph pin control                                     */
  MDR_PORTA_FUNC3_Func_Pin__Func_14    = 14,    /*!< Func_14 : Function periph pin control                                     */
  MDR_PORTA_FUNC3_Func_Pin__Func_15    = 15,    /*!< Func_15 : Function periph pin control                                     */
} MDR_PORTA_FUNC3_Func_Pin__Enum;

/* =======================================================  FUNC0_Set  ======================================================= */
/* =========================================  MDR_PORTA FUNC0_Set Func_Pin_ [0..3]  ========================================== */
typedef enum {                                  /*!< MDR_PORTA_FUNC0_Set_Func_Pin_                                             */
  MDR_PORTA_FUNC0_Set_Func_Pin__PORT   = 0,     /*!< PORT : User Pin control                                                   */
  MDR_PORTA_FUNC0_Set_Func_Pin__Func_1 = 1,     /*!< Func_1 : Function periph pin control                                      */
  MDR_PORTA_FUNC0_Set_Func_Pin__Func_2 = 2,     /*!< Func_2 : Function periph pin control                                      */
  MDR_PORTA_FUNC0_Set_Func_Pin__Func_3 = 3,     /*!< Func_3 : Function periph pin control                                      */
  MDR_PORTA_FUNC0_Set_Func_Pin__Func_4 = 4,     /*!< Func_4 : Function periph pin control                                      */
  MDR_PORTA_FUNC0_Set_Func_Pin__Func_5 = 5,     /*!< Func_5 : Function periph pin control                                      */
  MDR_PORTA_FUNC0_Set_Func_Pin__Func_6 = 6,     /*!< Func_6 : Function periph pin control                                      */
  MDR_PORTA_FUNC0_Set_Func_Pin__Func_7 = 7,     /*!< Func_7 : Function periph pin control                                      */
  MDR_PORTA_FUNC0_Set_Func_Pin__Func_8 = 8,     /*!< Func_8 : Function periph pin control                                      */
  MDR_PORTA_FUNC0_Set_Func_Pin__Func_9 = 9,     /*!< Func_9 : Function periph pin control                                      */
  MDR_PORTA_FUNC0_Set_Func_Pin__Func_10 = 10,   /*!< Func_10 : Function periph pin control                                     */
  MDR_PORTA_FUNC0_Set_Func_Pin__Func_11 = 11,   /*!< Func_11 : Function periph pin control                                     */
  MDR_PORTA_FUNC0_Set_Func_Pin__Func_12 = 12,   /*!< Func_12 : Function periph pin control                                     */
  MDR_PORTA_FUNC0_Set_Func_Pin__Func_13 = 13,   /*!< Func_13 : Function periph pin control                                     */
  MDR_PORTA_FUNC0_Set_Func_Pin__Func_14 = 14,   /*!< Func_14 : Function periph pin control                                     */
  MDR_PORTA_FUNC0_Set_Func_Pin__Func_15 = 15,   /*!< Func_15 : Function periph pin control                                     */
} MDR_PORTA_FUNC0_Set_Func_Pin__Enum;

/* =======================================================  FUNC1_Set  ======================================================= */
/* =========================================  MDR_PORTA FUNC1_Set Func_Pin_ [0..3]  ========================================== */
typedef enum {                                  /*!< MDR_PORTA_FUNC1_Set_Func_Pin_                                             */
  MDR_PORTA_FUNC1_Set_Func_Pin__PORT   = 0,     /*!< PORT : User Pin control                                                   */
  MDR_PORTA_FUNC1_Set_Func_Pin__Func_1 = 1,     /*!< Func_1 : Function periph pin control                                      */
  MDR_PORTA_FUNC1_Set_Func_Pin__Func_2 = 2,     /*!< Func_2 : Function periph pin control                                      */
  MDR_PORTA_FUNC1_Set_Func_Pin__Func_3 = 3,     /*!< Func_3 : Function periph pin control                                      */
  MDR_PORTA_FUNC1_Set_Func_Pin__Func_4 = 4,     /*!< Func_4 : Function periph pin control                                      */
  MDR_PORTA_FUNC1_Set_Func_Pin__Func_5 = 5,     /*!< Func_5 : Function periph pin control                                      */
  MDR_PORTA_FUNC1_Set_Func_Pin__Func_6 = 6,     /*!< Func_6 : Function periph pin control                                      */
  MDR_PORTA_FUNC1_Set_Func_Pin__Func_7 = 7,     /*!< Func_7 : Function periph pin control                                      */
  MDR_PORTA_FUNC1_Set_Func_Pin__Func_8 = 8,     /*!< Func_8 : Function periph pin control                                      */
  MDR_PORTA_FUNC1_Set_Func_Pin__Func_9 = 9,     /*!< Func_9 : Function periph pin control                                      */
  MDR_PORTA_FUNC1_Set_Func_Pin__Func_10 = 10,   /*!< Func_10 : Function periph pin control                                     */
  MDR_PORTA_FUNC1_Set_Func_Pin__Func_11 = 11,   /*!< Func_11 : Function periph pin control                                     */
  MDR_PORTA_FUNC1_Set_Func_Pin__Func_12 = 12,   /*!< Func_12 : Function periph pin control                                     */
  MDR_PORTA_FUNC1_Set_Func_Pin__Func_13 = 13,   /*!< Func_13 : Function periph pin control                                     */
  MDR_PORTA_FUNC1_Set_Func_Pin__Func_14 = 14,   /*!< Func_14 : Function periph pin control                                     */
  MDR_PORTA_FUNC1_Set_Func_Pin__Func_15 = 15,   /*!< Func_15 : Function periph pin control                                     */
} MDR_PORTA_FUNC1_Set_Func_Pin__Enum;

/* =======================================================  FUNC2_Set  ======================================================= */
/* =========================================  MDR_PORTA FUNC2_Set Func_Pin_ [0..3]  ========================================== */
typedef enum {                                  /*!< MDR_PORTA_FUNC2_Set_Func_Pin_                                             */
  MDR_PORTA_FUNC2_Set_Func_Pin__PORT   = 0,     /*!< PORT : User Pin control                                                   */
  MDR_PORTA_FUNC2_Set_Func_Pin__Func_1 = 1,     /*!< Func_1 : Function periph pin control                                      */
  MDR_PORTA_FUNC2_Set_Func_Pin__Func_2 = 2,     /*!< Func_2 : Function periph pin control                                      */
  MDR_PORTA_FUNC2_Set_Func_Pin__Func_3 = 3,     /*!< Func_3 : Function periph pin control                                      */
  MDR_PORTA_FUNC2_Set_Func_Pin__Func_4 = 4,     /*!< Func_4 : Function periph pin control                                      */
  MDR_PORTA_FUNC2_Set_Func_Pin__Func_5 = 5,     /*!< Func_5 : Function periph pin control                                      */
  MDR_PORTA_FUNC2_Set_Func_Pin__Func_6 = 6,     /*!< Func_6 : Function periph pin control                                      */
  MDR_PORTA_FUNC2_Set_Func_Pin__Func_7 = 7,     /*!< Func_7 : Function periph pin control                                      */
  MDR_PORTA_FUNC2_Set_Func_Pin__Func_8 = 8,     /*!< Func_8 : Function periph pin control                                      */
  MDR_PORTA_FUNC2_Set_Func_Pin__Func_9 = 9,     /*!< Func_9 : Function periph pin control                                      */
  MDR_PORTA_FUNC2_Set_Func_Pin__Func_10 = 10,   /*!< Func_10 : Function periph pin control                                     */
  MDR_PORTA_FUNC2_Set_Func_Pin__Func_11 = 11,   /*!< Func_11 : Function periph pin control                                     */
  MDR_PORTA_FUNC2_Set_Func_Pin__Func_12 = 12,   /*!< Func_12 : Function periph pin control                                     */
  MDR_PORTA_FUNC2_Set_Func_Pin__Func_13 = 13,   /*!< Func_13 : Function periph pin control                                     */
  MDR_PORTA_FUNC2_Set_Func_Pin__Func_14 = 14,   /*!< Func_14 : Function periph pin control                                     */
  MDR_PORTA_FUNC2_Set_Func_Pin__Func_15 = 15,   /*!< Func_15 : Function periph pin control                                     */
} MDR_PORTA_FUNC2_Set_Func_Pin__Enum;

