StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* =======================================================  FUNC3_Set  ======================================================= */
/* =========================================  MDR_PORTA FUNC3_Set Func_Pin_ [0..3]  ========================================== */
typedef enum {                                  /*!< MDR_PORTA_FUNC3_Set_Func_Pin_                                             */
  MDR_PORTA_FUNC3_Set_Func_Pin__PORT   = 0,     /*!< PORT : User Pin control                                                   */
  MDR_PORTA_FUNC3_Set_Func_Pin__Func_1 = 1,     /*!< Func_1 : Function periph pin control                                      */
  MDR_PORTA_FUNC3_Set_Func_Pin__Func_2 = 2,     /*!< Func_2 : Function periph pin control                                      */
  MDR_PORTA_FUNC3_Set_Func_Pin__Func_3 = 3,     /*!< Func_3 : Function periph pin control                                      */
  MDR_PORTA_FUNC3_Set_Func_Pin__Func_4 = 4,     /*!< Func_4 : Function periph pin control                                      */
  MDR_PORTA_FUNC3_Set_Func_Pin__Func_5 = 5,     /*!< Func_5 : Function periph pin control                                      */
  MDR_PORTA_FUNC3_Set_Func_Pin__Func_6 = 6,     /*!< Func_6 : Function periph pin control                                      */
  MDR_PORTA_FUNC3_Set_Func_Pin__Func_7 = 7,     /*!< Func_7 : Function periph pin control                                      */
  MDR_PORTA_FUNC3_Set_Func_Pin__Func_8 = 8,     /*!< Func_8 : Function periph pin control                                      */
  MDR_PORTA_FUNC3_Set_Func_Pin__Func_9 = 9,     /*!< Func_9 : Function periph pin control                                      */
  MDR_PORTA_FUNC3_Set_Func_Pin__Func_10 = 10,   /*!< Func_10 : Function periph pin control                                     */
  MDR_PORTA_FUNC3_Set_Func_Pin__Func_11 = 11,   /*!< Func_11 : Function periph pin control                                     */
  MDR_PORTA_FUNC3_Set_Func_Pin__Func_12 = 12,   /*!< Func_12 : Function periph pin control                                     */
  MDR_PORTA_FUNC3_Set_Func_Pin__Func_13 = 13,   /*!< Func_13 : Function periph pin control                                     */
  MDR_PORTA_FUNC3_Set_Func_Pin__Func_14 = 14,   /*!< Func_14 : Function periph pin control                                     */
  MDR_PORTA_FUNC3_Set_Func_Pin__Func_15 = 15,   /*!< Func_15 : Function periph pin control                                     */
} MDR_PORTA_FUNC3_Set_Func_Pin__Enum;

/* ======================================================  FUNC0_Clear  ====================================================== */
/* ========================================  MDR_PORTA FUNC0_Clear Func_Pin_ [0..3]  ========================================= */
typedef enum {                                  /*!< MDR_PORTA_FUNC0_Clear_Func_Pin_                                           */
  MDR_PORTA_FUNC0_Clear_Func_Pin__Inactive = 0, /*!< Inactive : No Action                                                      */
  MDR_PORTA_FUNC0_Clear_Func_Pin__ClrFunc_1 = 1,/*!< ClrFunc_1 : Function periph pin control                                   */
  MDR_PORTA_FUNC0_Clear_Func_Pin__ClrFunc_2 = 2,/*!< ClrFunc_2 : Function periph pin control                                   */
  MDR_PORTA_FUNC0_Clear_Func_Pin__ClrFunc_3 = 3,/*!< ClrFunc_3 : Function periph pin control                                   */
  MDR_PORTA_FUNC0_Clear_Func_Pin__ClrFunc_4 = 4,/*!< ClrFunc_4 : Function periph pin control                                   */
  MDR_PORTA_FUNC0_Clear_Func_Pin__ClrFunc_5 = 5,/*!< ClrFunc_5 : Function periph pin control                                   */
  MDR_PORTA_FUNC0_Clear_Func_Pin__ClrFunc_6 = 6,/*!< ClrFunc_6 : Function periph pin control                                   */
  MDR_PORTA_FUNC0_Clear_Func_Pin__ClrFunc_7 = 7,/*!< ClrFunc_7 : Function periph pin control                                   */
  MDR_PORTA_FUNC0_Clear_Func_Pin__ClrFunc_8 = 8,/*!< ClrFunc_8 : Function periph pin control                                   */
  MDR_PORTA_FUNC0_Clear_Func_Pin__ClrFunc_9 = 9,/*!< ClrFunc_9 : Function periph pin control                                   */
  MDR_PORTA_FUNC0_Clear_Func_Pin__ClrFunc_10 = 10,/*!< ClrFunc_10 : Function periph pin control                                */
  MDR_PORTA_FUNC0_Clear_Func_Pin__ClrFunc_11 = 11,/*!< ClrFunc_11 : Function periph pin control                                */
  MDR_PORTA_FUNC0_Clear_Func_Pin__ClrFunc_12 = 12,/*!< ClrFunc_12 : Function periph pin control                                */
  MDR_PORTA_FUNC0_Clear_Func_Pin__ClrFunc_13 = 13,/*!< ClrFunc_13 : Function periph pin control                                */
  MDR_PORTA_FUNC0_Clear_Func_Pin__ClrFunc_14 = 14,/*!< ClrFunc_14 : Function periph pin control                                */
  MDR_PORTA_FUNC0_Clear_Func_Pin__ClearToPort = 15,/*!< ClearToPort : Set Pin to Port function                                 */
} MDR_PORTA_FUNC0_Clear_Func_Pin__Enum;

/* ======================================================  FUNC1_Clear  ====================================================== */
/* ========================================  MDR_PORTA FUNC1_Clear Func_Pin_ [0..3]  ========================================= */
typedef enum {                                  /*!< MDR_PORTA_FUNC1_Clear_Func_Pin_                                           */
  MDR_PORTA_FUNC1_Clear_Func_Pin__Inactive = 0, /*!< Inactive : No Action                                                      */
  MDR_PORTA_FUNC1_Clear_Func_Pin__ClrFunc_1 = 1,/*!< ClrFunc_1 : Function periph pin control                                   */
  MDR_PORTA_FUNC1_Clear_Func_Pin__ClrFunc_2 = 2,/*!< ClrFunc_2 : Function periph pin control                                   */
  MDR_PORTA_FUNC1_Clear_Func_Pin__ClrFunc_3 = 3,/*!< ClrFunc_3 : Function periph pin control                                   */
  MDR_PORTA_FUNC1_Clear_Func_Pin__ClrFunc_4 = 4,/*!< ClrFunc_4 : Function periph pin control                                   */
  MDR_PORTA_FUNC1_Clear_Func_Pin__ClrFunc_5 = 5,/*!< ClrFunc_5 : Function periph pin control                                   */
  MDR_PORTA_FUNC1_Clear_Func_Pin__ClrFunc_6 = 6,/*!< ClrFunc_6 : Function periph pin control                                   */
  MDR_PORTA_FUNC1_Clear_Func_Pin__ClrFunc_7 = 7,/*!< ClrFunc_7 : Function periph pin control                                   */
  MDR_PORTA_FUNC1_Clear_Func_Pin__ClrFunc_8 = 8,/*!< ClrFunc_8 : Function periph pin control                                   */
  MDR_PORTA_FUNC1_Clear_Func_Pin__ClrFunc_9 = 9,/*!< ClrFunc_9 : Function periph pin control                                   */
  MDR_PORTA_FUNC1_Clear_Func_Pin__ClrFunc_10 = 10,/*!< ClrFunc_10 : Function periph pin control                                */
  MDR_PORTA_FUNC1_Clear_Func_Pin__ClrFunc_11 = 11,/*!< ClrFunc_11 : Function periph pin control                                */
  MDR_PORTA_FUNC1_Clear_Func_Pin__ClrFunc_12 = 12,/*!< ClrFunc_12 : Function periph pin control                                */
  MDR_PORTA_FUNC1_Clear_Func_Pin__ClrFunc_13 = 13,/*!< ClrFunc_13 : Function periph pin control                                */
  MDR_PORTA_FUNC1_Clear_Func_Pin__ClrFunc_14 = 14,/*!< ClrFunc_14 : Function periph pin control                                */
  MDR_PORTA_FUNC1_Clear_Func_Pin__ClearToPort = 15,/*!< ClearToPort : Set Pin to Port function                                 */
} MDR_PORTA_FUNC1_Clear_Func_Pin__Enum;

/* ======================================================  FUNC2_Clear  ====================================================== */
/* ========================================  MDR_PORTA FUNC2_Clear Func_Pin_ [0..3]  ========================================= */
typedef enum {                                  /*!< MDR_PORTA_FUNC2_Clear_Func_Pin_                                           */
  MDR_PORTA_FUNC2_Clear_Func_Pin__Inactive = 0, /*!< Inactive : No Action                                                      */
  MDR_PORTA_FUNC2_Clear_Func_Pin__ClrFunc_1 = 1,/*!< ClrFunc_1 : Function periph pin control                                   */
  MDR_PORTA_FUNC2_Clear_Func_Pin__ClrFunc_2 = 2,/*!< ClrFunc_2 : Function periph pin control                                   */
  MDR_PORTA_FUNC2_Clear_Func_Pin__ClrFunc_3 = 3,/*!< ClrFunc_3 : Function periph pin control                                   */
  MDR_PORTA_FUNC2_Clear_Func_Pin__ClrFunc_4 = 4,/*!< ClrFunc_4 : Function periph pin control                                   */
  MDR_PORTA_FUNC2_Clear_Func_Pin__ClrFunc_5 = 5,/*!< ClrFunc_5 : Function periph pin control                                   */
  MDR_PORTA_FUNC2_Clear_Func_Pin__ClrFunc_6 = 6,/*!< ClrFunc_6 : Function periph pin control                                   */
  MDR_PORTA_FUNC2_Clear_Func_Pin__ClrFunc_7 = 7,/*!< ClrFunc_7 : Function periph pin control                                   */
  MDR_PORTA_FUNC2_Clear_Func_Pin__ClrFunc_8 = 8,/*!< ClrFunc_8 : Function periph pin control                                   */
  MDR_PORTA_FUNC2_Clear_Func_Pin__ClrFunc_9 = 9,/*!< ClrFunc_9 : Function periph pin control                                   */
  MDR_PORTA_FUNC2_Clear_Func_Pin__ClrFunc_10 = 10,/*!< ClrFunc_10 : Function periph pin control                                */
  MDR_PORTA_FUNC2_Clear_Func_Pin__ClrFunc_11 = 11,/*!< ClrFunc_11 : Function periph pin control                                */
  MDR_PORTA_FUNC2_Clear_Func_Pin__ClrFunc_12 = 12,/*!< ClrFunc_12 : Function periph pin control                                */
  MDR_PORTA_FUNC2_Clear_Func_Pin__ClrFunc_13 = 13,/*!< ClrFunc_13 : Function periph pin control                                */
  MDR_PORTA_FUNC2_Clear_Func_Pin__ClrFunc_14 = 14,/*!< ClrFunc_14 : Function periph pin control                                */
  MDR_PORTA_FUNC2_Clear_Func_Pin__ClearToPort = 15,/*!< ClearToPort : Set Pin to Port function                                 */
} MDR_PORTA_FUNC2_Clear_Func_Pin__Enum;

/* ======================================================  FUNC3_Clear  ====================================================== */
/* ========================================  MDR_PORTA FUNC3_Clear Func_Pin_ [0..3]  ========================================= */
typedef enum {                                  /*!< MDR_PORTA_FUNC3_Clear_Func_Pin_                                           */
  MDR_PORTA_FUNC3_Clear_Func_Pin__Inactive = 0, /*!< Inactive : No Action                                                      */
  MDR_PORTA_FUNC3_Clear_Func_Pin__ClrFunc_1 = 1,/*!< ClrFunc_1 : Function periph pin control                                   */
  MDR_PORTA_FUNC3_Clear_Func_Pin__ClrFunc_2 = 2,/*!< ClrFunc_2 : Function periph pin control                                   */
  MDR_PORTA_FUNC3_Clear_Func_Pin__ClrFunc_3 = 3,/*!< ClrFunc_3 : Function periph pin control                                   */
  MDR_PORTA_FUNC3_Clear_Func_Pin__ClrFunc_4 = 4,/*!< ClrFunc_4 : Function periph pin control                                   */
  MDR_PORTA_FUNC3_Clear_Func_Pin__ClrFunc_5 = 5,/*!< ClrFunc_5 : Function periph pin control                                   */
  MDR_PORTA_FUNC3_Clear_Func_Pin__ClrFunc_6 = 6,/*!< ClrFunc_6 : Function periph pin control                                   */
  MDR_PORTA_FUNC3_Clear_Func_Pin__ClrFunc_7 = 7,/*!< ClrFunc_7 : Function periph pin control                                   */
  MDR_PORTA_FUNC3_Clear_Func_Pin__ClrFunc_8 = 8,/*!< ClrFunc_8 : Function periph pin control                                   */
  MDR_PORTA_FUNC3_Clear_Func_Pin__ClrFunc_9 = 9,/*!< ClrFunc_9 : Function periph pin control                                   */
  MDR_PORTA_FUNC3_Clear_Func_Pin__ClrFunc_10 = 10,/*!< ClrFunc_10 : Function periph pin control                                */
  MDR_PORTA_FUNC3_Clear_Func_Pin__ClrFunc_11 = 11,/*!< ClrFunc_11 : Function periph pin control                                */
  MDR_PORTA_FUNC3_Clear_Func_Pin__ClrFunc_12 = 12,/*!< ClrFunc_12 : Function periph pin control                                */
  MDR_PORTA_FUNC3_Clear_Func_Pin__ClrFunc_13 = 13,/*!< ClrFunc_13 : Function periph pin control                                */
  MDR_PORTA_FUNC3_Clear_Func_Pin__ClrFunc_14 = 14,/*!< ClrFunc_14 : Function periph pin control                                */
  MDR_PORTA_FUNC3_Clear_Func_Pin__ClearToPort = 15,/*!< ClearToPort : Set Pin to Port function                                 */
} MDR_PORTA_FUNC3_Clear_Func_Pin__Enum;

/* ========================================================  ANALOG  ========================================================= */
/* =============================================  MDR_PORTA ANALOG Pin_ [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_PORTA_ANALOG_Pin_                                                     */
  MDR_PORTA_ANALOG_Pin__Analog         = 0,     /*!< Analog : Pin Analog signal                                                */
  MDR_PORTA_ANALOG_Pin__Digital        = 1,     /*!< Digital : Pin Digital signal                                              */
} MDR_PORTA_ANALOG_Pin__Enum;

/* ======================================================  ANALOG_Set  ======================================================= */
/* ===========================================  MDR_PORTA ANALOG_Set Pin_ [0..0]  ============================================ */
typedef enum {                                  /*!< MDR_PORTA_ANALOG_Set_Pin_                                                 */
  MDR_PORTA_ANALOG_Set_Pin__Off        = 0,     /*!< Off : Do nothing                                                          */
  MDR_PORTA_ANALOG_Set_Pin__SET        = 1,     /*!< SET : Set pin                                                             */
} MDR_PORTA_ANALOG_Set_Pin__Enum;

/* =====================================================  ANALOG_Clear  ====================================================== */
/* ==========================================  MDR_PORTA ANALOG_Clear Pin_ [0..0]  =========================================== */
typedef enum {                                  /*!< MDR_PORTA_ANALOG_Clear_Pin_                                               */
  MDR_PORTA_ANALOG_Clear_Pin__Off      = 0,     /*!< Off : Do nothing                                                          */
  MDR_PORTA_ANALOG_Clear_Pin__CLEAR    = 1,     /*!< CLEAR : Clear pin                                                         */
} MDR_PORTA_ANALOG_Clear_Pin__Enum;

/* ========================================================  PULLUP  ========================================================= */
/* =============================================  MDR_PORTA PULLUP Pin_ [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_PORTA_PULLUP_Pin_                                                     */
  MDR_PORTA_PULLUP_Pin__Off            = 0,     /*!< Off : No pull selected                                                    */
  MDR_PORTA_PULLUP_Pin__UP             = 1,     /*!< UP : Pin pulled up to VDD                                                 */
} MDR_PORTA_PULLUP_Pin__Enum;

/* ======================================================  PULLUP_Set  ======================================================= */
/* ===========================================  MDR_PORTA PULLUP_Set Pin_ [0..0]  ============================================ */
typedef enum {                                  /*!< MDR_PORTA_PULLUP_Set_Pin_                                                 */
  MDR_PORTA_PULLUP_Set_Pin__Off        = 0,     /*!< Off : Do nothing                                                          */
  MDR_PORTA_PULLUP_Set_Pin__SET        = 1,     /*!< SET : Set pin                                                             */
} MDR_PORTA_PULLUP_Set_Pin__Enum;

/* =====================================================  PULLUP_Clear  ====================================================== */
/* ==========================================  MDR_PORTA PULLUP_Clear Pin_ [0..0]  =========================================== */
typedef enum {                                  /*!< MDR_PORTA_PULLUP_Clear_Pin_                                               */
  MDR_PORTA_PULLUP_Clear_Pin__Off      = 0,     /*!< Off : Do nothing                                                          */
  MDR_PORTA_PULLUP_Clear_Pin__CLEAR    = 1,     /*!< CLEAR : Clear pin                                                         */
} MDR_PORTA_PULLUP_Clear_Pin__Enum;

/* =======================================================  PULLDOWN  ======================================================== */
/* ============================================  MDR_PORTA PULLDOWN Pin_ [0..0]  ============================================= */
typedef enum {                                  /*!< MDR_PORTA_PULLDOWN_Pin_                                                   */
  MDR_PORTA_PULLDOWN_Pin__Off          = 0,     /*!< Off : No pull selected                                                    */
  MDR_PORTA_PULLDOWN_Pin__DOWN         = 1,     /*!< DOWN : Pin pulled up to GND                                               */
} MDR_PORTA_PULLDOWN_Pin__Enum;

/* =====================================================  PULLDOWN_Set  ====================================================== */
/* ==========================================  MDR_PORTA PULLDOWN_Set Pin_ [0..0]  =========================================== */
typedef enum {                                  /*!< MDR_PORTA_PULLDOWN_Set_Pin_                                               */
  MDR_PORTA_PULLDOWN_Set_Pin__Off      = 0,     /*!< Off : Do nothing                                                          */
  MDR_PORTA_PULLDOWN_Set_Pin__SET      = 1,     /*!< SET : Set pin                                                             */
} MDR_PORTA_PULLDOWN_Set_Pin__Enum;

/* ====================================================  PULLDOWN_Clear  ===================================================== */
/* =========================================  MDR_PORTA PULLDOWN_Clear Pin_ [0..0]  ========================================== */
typedef enum {                                  /*!< MDR_PORTA_PULLDOWN_Clear_Pin_                                             */
  MDR_PORTA_PULLDOWN_Clear_Pin__Off    = 0,     /*!< Off : Do nothing                                                          */
  MDR_PORTA_PULLDOWN_Clear_Pin__CLEAR  = 1,     /*!< CLEAR : Clear pin                                                         */
} MDR_PORTA_PULLDOWN_Clear_Pin__Enum;

/* ==========================================================  PD  =========================================================== */
/* ===============================================  MDR_PORTA PD Pin_ [0..0]  ================================================ */
typedef enum {                                  /*!< MDR_PORTA_PD_Pin_                                                         */
  MDR_PORTA_PD_Pin__Driver             = 0,     /*!< Driver : Pull-Push driver                                                 */
  MDR_PORTA_PD_Pin__OpenDrain          = 1,     /*!< OpenDrain : Drain Pulled Up Line                                          */
} MDR_PORTA_PD_Pin__Enum;

/* ========================================================  PD_Set  ========================================================= */
/* =============================================  MDR_PORTA PD_Set Pin_ [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_PORTA_PD_Set_Pin_                                                     */
  MDR_PORTA_PD_Set_Pin__Off            = 0,     /*!< Off : Do nothing                                                          */
  MDR_PORTA_PD_Set_Pin__SET            = 1,     /*!< SET : Set pin                                                             */
} MDR_PORTA_PD_Set_Pin__Enum;

/* =======================================================  PD_Clear  ======================================================== */
/* ============================================  MDR_PORTA PD_Clear Pin_ [0..0]  ============================================= */
typedef enum {                                  /*!< MDR_PORTA_PD_Clear_Pin_                                                   */
  MDR_PORTA_PD_Clear_Pin__Off          = 0,     /*!< Off : Do nothing                                                          */
  MDR_PORTA_PD_Clear_Pin__CLEAR        = 1,     /*!< CLEAR : Clear pin                                                         */
} MDR_PORTA_PD_Clear_Pin__Enum;

