StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* =========================================================  PWR0  ========================================================== */
/* ==============================================  MDR_PORTA PWR0 Pin_ [0..1]  =============================================== */
typedef enum {                                  /*!< MDR_PORTA_PWR0_Pin_                                                       */
  MDR_PORTA_PWR0_Pin__Off              = 0,     /*!< Off : Level switch disabled                                               */
  MDR_PORTA_PWR0_Pin__Slow             = 1,     /*!< Slow : Front ~300ns                                                       */
  MDR_PORTA_PWR0_Pin__Fast             = 2,     /*!< Fast : Front ~100ns                                                       */
  MDR_PORTA_PWR0_Pin__MaxFast          = 3,     /*!< MaxFast : Front ~10ns                                                     */
} MDR_PORTA_PWR0_Pin__Enum;

/* =========================================================  PWR1  ========================================================== */
/* ==============================================  MDR_PORTA PWR1 Pin_ [0..1]  =============================================== */
typedef enum {                                  /*!< MDR_PORTA_PWR1_Pin_                                                       */
  MDR_PORTA_PWR1_Pin__Off              = 0,     /*!< Off : Level switch disabled                                               */
  MDR_PORTA_PWR1_Pin__Slow             = 1,     /*!< Slow : Front ~300ns                                                       */
  MDR_PORTA_PWR1_Pin__Fast             = 2,     /*!< Fast : Front ~100ns                                                       */
  MDR_PORTA_PWR1_Pin__MaxFast          = 3,     /*!< MaxFast : Front ~10ns                                                     */
} MDR_PORTA_PWR1_Pin__Enum;

/* =======================================================  PWR0_Set  ======================================================== */
/* ============================================  MDR_PORTA PWR0_Set Pin_ [0..1]  ============================================= */
typedef enum {                                  /*!< MDR_PORTA_PWR0_Set_Pin_                                                   */
  MDR_PORTA_PWR0_Set_Pin__Off          = 0,     /*!< Off : Level switch disabled                                               */
  MDR_PORTA_PWR0_Set_Pin__Slow         = 1,     /*!< Slow : Front ~300ns                                                       */
  MDR_PORTA_PWR0_Set_Pin__Fast         = 2,     /*!< Fast : Front ~100ns                                                       */
  MDR_PORTA_PWR0_Set_Pin__MaxFast      = 3,     /*!< MaxFast : Front ~10ns                                                     */
} MDR_PORTA_PWR0_Set_Pin__Enum;

/* =======================================================  PWR1_Set  ======================================================== */
/* ============================================  MDR_PORTA PWR1_Set Pin_ [0..1]  ============================================= */
typedef enum {                                  /*!< MDR_PORTA_PWR1_Set_Pin_                                                   */
  MDR_PORTA_PWR1_Set_Pin__Off          = 0,     /*!< Off : Level switch disabled                                               */
  MDR_PORTA_PWR1_Set_Pin__Slow         = 1,     /*!< Slow : Front ~300ns                                                       */
  MDR_PORTA_PWR1_Set_Pin__Fast         = 2,     /*!< Fast : Front ~100ns                                                       */
  MDR_PORTA_PWR1_Set_Pin__MaxFast      = 3,     /*!< MaxFast : Front ~10ns                                                     */
} MDR_PORTA_PWR1_Set_Pin__Enum;

/* ======================================================  PWR0_Clear  ======================================================= */
/* ===========================================  MDR_PORTA PWR0_Clear Pin_ [0..1]  ============================================ */
typedef enum {                                  /*!< MDR_PORTA_PWR0_Clear_Pin_                                                 */
  MDR_PORTA_PWR0_Clear_Pin__Inactive   = 0,     /*!< Inactive : No action                                                      */
  MDR_PORTA_PWR0_Clear_Pin__ClrSlow    = 1,     /*!< ClrSlow : Front ~300ns                                                    */
  MDR_PORTA_PWR0_Clear_Pin__ClrFast    = 2,     /*!< ClrFast : Front ~100ns                                                    */
  MDR_PORTA_PWR0_Clear_Pin__ClrToOff   = 3,     /*!< ClrToOff : Pin Power Off                                                  */
} MDR_PORTA_PWR0_Clear_Pin__Enum;

/* ======================================================  PWR1_Clear  ======================================================= */
/* ===========================================  MDR_PORTA PWR1_Clear Pin_ [0..1]  ============================================ */
typedef enum {                                  /*!< MDR_PORTA_PWR1_Clear_Pin_                                                 */
  MDR_PORTA_PWR1_Clear_Pin__Inactive   = 0,     /*!< Inactive : No action                                                      */
  MDR_PORTA_PWR1_Clear_Pin__ClrSlow    = 1,     /*!< ClrSlow : Front ~300ns                                                    */
  MDR_PORTA_PWR1_Clear_Pin__ClrFast    = 2,     /*!< ClrFast : Front ~100ns                                                    */
  MDR_PORTA_PWR1_Clear_Pin__ClrToOff   = 3,     /*!< ClrToOff : Pin Power Off                                                  */
} MDR_PORTA_PWR1_Clear_Pin__Enum;

/* ==========================================================  CL  =========================================================== */
/* ===============================================  MDR_PORTA CL Pin_ [0..0]  ================================================ */
typedef enum {                                  /*!< MDR_PORTA_CL_Pin_                                                         */
  MDR_PORTA_CL_Pin__Off                = 0,     /*!< Off : Disable                                                             */
  MDR_PORTA_CL_Pin__On                 = 1,     /*!< On : Enable                                                               */
} MDR_PORTA_CL_Pin__Enum;

/* ========================================================  CL_Set  ========================================================= */
/* =============================================  MDR_PORTA CL_Set Pin_ [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_PORTA_CL_Set_Pin_                                                     */
  MDR_PORTA_CL_Set_Pin__Off            = 0,     /*!< Off : Do nothing                                                          */
  MDR_PORTA_CL_Set_Pin__SET            = 1,     /*!< SET : Set pin                                                             */
} MDR_PORTA_CL_Set_Pin__Enum;

/* =======================================================  CL_Clear  ======================================================== */
/* ============================================  MDR_PORTA CL_Clear Pin_ [0..0]  ============================================= */
typedef enum {                                  /*!< MDR_PORTA_CL_Clear_Pin_                                                   */
  MDR_PORTA_CL_Clear_Pin__Off          = 0,     /*!< Off : Do nothing                                                          */
  MDR_PORTA_CL_Clear_Pin__CLEAR        = 1,     /*!< CLEAR : Clear pin                                                         */
} MDR_PORTA_CL_Clear_Pin__Enum;

/* ==========================================================  IE  =========================================================== */
/* ===============================================  MDR_PORTA IE Pin_ [0..0]  ================================================ */
typedef enum {                                  /*!< MDR_PORTA_IE_Pin_                                                         */
  MDR_PORTA_IE_Pin__Off                = 0,     /*!< Off : IRQ disabled                                                        */
  MDR_PORTA_IE_Pin__On                 = 1,     /*!< On : IRQ enable                                                           */
} MDR_PORTA_IE_Pin__Enum;

/* ========================================================  IE_Set  ========================================================= */
/* =============================================  MDR_PORTA IE_Set Pin_ [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_PORTA_IE_Set_Pin_                                                     */
  MDR_PORTA_IE_Set_Pin__Off            = 0,     /*!< Off : Do nothing                                                          */
  MDR_PORTA_IE_Set_Pin__SET            = 1,     /*!< SET : Set pin                                                             */
} MDR_PORTA_IE_Set_Pin__Enum;

/* =======================================================  IE_Clear  ======================================================== */
/* ============================================  MDR_PORTA IE_Clear Pin_ [0..0]  ============================================= */
typedef enum {                                  /*!< MDR_PORTA_IE_Clear_Pin_                                                   */
  MDR_PORTA_IE_Clear_Pin__Off          = 0,     /*!< Off : Do nothing                                                          */
  MDR_PORTA_IE_Clear_Pin__CLEAR        = 1,     /*!< CLEAR : Clear pin                                                         */
} MDR_PORTA_IE_Clear_Pin__Enum;

/* ==========================================================  IT  =========================================================== */
/* ===============================================  MDR_PORTA IT Pin_ [0..0]  ================================================ */
typedef enum {                                  /*!< MDR_PORTA_IT_Pin_                                                         */
  MDR_PORTA_IT_Pin__Low                = 0,     /*!< Low : IRQ by low level                                                    */
  MDR_PORTA_IT_Pin__HIGH               = 1,     /*!< HIGH : IRQ by High level                                                  */
} MDR_PORTA_IT_Pin__Enum;

/* ========================================================  IT_Set  ========================================================= */
/* =============================================  MDR_PORTA IT_Set Pin_ [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_PORTA_IT_Set_Pin_                                                     */
  MDR_PORTA_IT_Set_Pin__Off            = 0,     /*!< Off : Do nothing                                                          */
  MDR_PORTA_IT_Set_Pin__SET            = 1,     /*!< SET : Set pin                                                             */
} MDR_PORTA_IT_Set_Pin__Enum;

/* =======================================================  IT_Clear  ======================================================== */
/* ============================================  MDR_PORTA IT_Clear Pin_ [0..0]  ============================================= */
typedef enum {                                  /*!< MDR_PORTA_IT_Clear_Pin_                                                   */
  MDR_PORTA_IT_Clear_Pin__Off          = 0,     /*!< Off : Do nothing                                                          */
  MDR_PORTA_IT_Clear_Pin__CLEAR        = 1,     /*!< CLEAR : Clear pin                                                         */
} MDR_PORTA_IT_Clear_Pin__Enum;

