StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* ==========================================================  IR  =========================================================== */
/* ===============================================  MDR_PORTA IR Pin_ [0..0]  ================================================ */
typedef enum {                                  /*!< MDR_PORTA_IR_Pin_                                                         */
  MDR_PORTA_IR_Pin__Off                = 0,     /*!< Off : Inactive IRQ request                                                */
  MDR_PORTA_IR_Pin__On                 = 1,     /*!< On : Active IRQ request                                                   */
} MDR_PORTA_IR_Pin__Enum;

/* ========================================================  IR_Set  ========================================================= */
/* =============================================  MDR_PORTA IR_Set Pin_ [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_PORTA_IR_Set_Pin_                                                     */
  MDR_PORTA_IR_Set_Pin__Off            = 0,     /*!< Off : Do nothing                                                          */
  MDR_PORTA_IR_Set_Pin__SET            = 1,     /*!< SET : Set pin                                                             */
} MDR_PORTA_IR_Set_Pin__Enum;

/* =======================================================  IR_Clear  ======================================================== */
/* ============================================  MDR_PORTA IR_Clear Pin_ [0..0]  ============================================= */
typedef enum {                                  /*!< MDR_PORTA_IR_Clear_Pin_                                                   */
  MDR_PORTA_IR_Clear_Pin__Off          = 0,     /*!< Off : Do nothing                                                          */
  MDR_PORTA_IR_Clear_Pin__CLEAR        = 1,     /*!< CLEAR : Clear pin                                                         */
} MDR_PORTA_IR_Clear_Pin__Enum;

/* =========================================================  HCUR  ========================================================== */
/* ==============================================  MDR_PORTA HCUR Pin_ [0..0]  =============================================== */
typedef enum {                                  /*!< MDR_PORTA_HCUR_Pin_                                                       */
  MDR_PORTA_HCUR_Pin__Off              = 0,     /*!< Off : Overcurrent is inactive                                             */
  MDR_PORTA_HCUR_Pin__On               = 1,     /*!< On : Overcurrent is active                                                */
} MDR_PORTA_HCUR_Pin__Enum;



/* =========================================================================================================================== */
/* ================                                        MDR_TIMER1                                         ================ */
/* =========================================================================================================================== */

/* ==========================================================  CNT  ========================================================== */
/* ==========================================================  PSG  ========================================================== */
/* ==========================================================  ARR  ========================================================== */
/* =========================================================  CNTRL  ========================================================= */
/* ============================================  MDR_TIMER1 CNTRL CNT_EN [0..0]  ============================================= */
typedef enum {                                  /*!< MDR_TIMER1_CNTRL_CNT_EN                                                   */
  MDR_TIMER1_CNTRL_CNT_EN_Off          = 0,     /*!< Off : Disabled                                                            */
  MDR_TIMER1_CNTRL_CNT_EN_On           = 1,     /*!< On : Enabled                                                              */
} MDR_TIMER1_CNTRL_CNT_EN_Enum;

/* ============================================  MDR_TIMER1 CNTRL ARRB_EN [1..1]  ============================================ */
typedef enum {                                  /*!< MDR_TIMER1_CNTRL_ARRB_EN                                                  */
  MDR_TIMER1_CNTRL_ARRB_EN_Immediately = 0,     /*!< Immediately : Immediately update                                          */
  MDR_TIMER1_CNTRL_ARRB_EN_OnCompleted = 1,     /*!< OnCompleted : Update ARR when active period of CNT finished               */
} MDR_TIMER1_CNTRL_ARRB_EN_Enum;

/* ============================================  MDR_TIMER1 CNTRL WR_CMPL [2..2]  ============================================ */
typedef enum {                                  /*!< MDR_TIMER1_CNTRL_WR_CMPL                                                  */
  MDR_TIMER1_CNTRL_WR_CMPL_Ready       = 0,     /*!< Ready : Ready to write                                                    */
  MDR_TIMER1_CNTRL_WR_CMPL_BUSY        = 1,     /*!< BUSY : Writing not completed                                              */
} MDR_TIMER1_CNTRL_WR_CMPL_Enum;

/* ==============================================  MDR_TIMER1 CNTRL DIR [3..3]  ============================================== */
typedef enum {                                  /*!< MDR_TIMER1_CNTRL_DIR                                                      */
  MDR_TIMER1_CNTRL_DIR_UP              = 0,     /*!< UP : CNT counts from 0 to ARR                                             */
  MDR_TIMER1_CNTRL_DIR_DOWN            = 1,     /*!< DOWN : CNT counts from ARR to 0                                           */
} MDR_TIMER1_CNTRL_DIR_Enum;

/* =============================================  MDR_TIMER1 CNTRL FDTS [4..5]  ============================================== */
typedef enum {                                  /*!< MDR_TIMER1_CNTRL_FDTS                                                     */
  MDR_TIMER1_CNTRL_FDTS_TIM_CLK_div1   = 0,     /*!< TIM_CLK_div1 : TIM_Clock to FDTS scale                                    */
  MDR_TIMER1_CNTRL_FDTS_TIM_CLK_div2   = 1,     /*!< TIM_CLK_div2 : TIM_Clock to FDTS scale                                    */
  MDR_TIMER1_CNTRL_FDTS_TIM_CLK_div4   = 2,     /*!< TIM_CLK_div4 : TIM_Clock to FDTS scale                                    */
  MDR_TIMER1_CNTRL_FDTS_TIM_CLK_div8   = 3,     /*!< TIM_CLK_div8 : TIM_Clock to FDTS scale                                    */
} MDR_TIMER1_CNTRL_FDTS_Enum;

/* ===========================================  MDR_TIMER1 CNTRL CNT_MODE [6..7]  ============================================ */
typedef enum {                                  /*!< MDR_TIMER1_CNTRL_CNT_MODE                                                 */
  MDR_TIMER1_CNTRL_CNT_MODE_DIR_TIM_CLK = 0,    /*!< DIR_TIM_CLK : Count TIM_Clock pulses with DIR direction                   */
  MDR_TIMER1_CNTRL_CNT_MODE_UpDown_TIM_CLK = 1, /*!< UpDown_TIM_CLK : Count TIM_Clock pulses UP and Down                       */
  MDR_TIMER1_CNTRL_CNT_MODE_DIR_ExtEvents = 2,  /*!< DIR_ExtEvents : Count External Events with DIR direction                  */
} MDR_TIMER1_CNTRL_CNT_MODE_Enum;

/* ==========================================  MDR_TIMER1 CNTRL EVENT_SEL [8..11]  =========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CNTRL_EVENT_SEL                                                */
  MDR_TIMER1_CNTRL_EVENT_SEL_Rise_TIM_CLK = 0,  /*!< Rise_TIM_CLK : CNT counts from 0 to ARR                                   */
  MDR_TIMER1_CNTRL_EVENT_SEL_CNT_eq_ARR_TIM1 = 1,/*!< CNT_eq_ARR_TIM1 : CNT gets ARR in Timer1                                 */
  MDR_TIMER1_CNTRL_EVENT_SEL_CNT_eq_ARR_TIM2 = 2,/*!< CNT_eq_ARR_TIM2 : CNT gets ARR in Timer2                                 */
  MDR_TIMER1_CNTRL_EVENT_SEL_CNT_eq_ARR_TIM3 = 3,/*!< CNT_eq_ARR_TIM3 : CNT gets ARR in Timer3                                 */
  MDR_TIMER1_CNTRL_EVENT_SEL_Event_Ch1 = 4,     /*!< Event_Ch1 : Event in Channel1                                             */
  MDR_TIMER1_CNTRL_EVENT_SEL_Event_Ch2 = 5,     /*!< Event_Ch2 : Event in Channel2                                             */
  MDR_TIMER1_CNTRL_EVENT_SEL_Event_Ch3 = 6,     /*!< Event_Ch3 : Event in Channel3                                             */
  MDR_TIMER1_CNTRL_EVENT_SEL_Event_Ch4 = 7,     /*!< Event_Ch4 : Event in Channel4                                             */
  MDR_TIMER1_CNTRL_EVENT_SEL_Rise_ETR  = 8,     /*!< Rise_ETR : Rise front in ETR pin                                          */
  MDR_TIMER1_CNTRL_EVENT_SEL_Fall_ETR  = 9,     /*!< Fall_ETR : Fall front in ETR pin                                          */
  MDR_TIMER1_CNTRL_EVENT_SEL_CNT_eq_ARR_TIM4 = 10,/*!< CNT_eq_ARR_TIM4 : CNT gets ARR in Timer4                                */
} MDR_TIMER1_CNTRL_EVENT_SEL_Enum;

/* =========================================================  CCR1  ========================================================== */
/* =========================================================  CCR2  ========================================================== */
/* =========================================================  CCR3  ========================================================== */
/* =========================================================  CCR4  ========================================================== */
/* =======================================================  CH1_CNTRL  ======================================================= */
/* ==========================================  MDR_TIMER1 CH1_CNTRL CHFLTR [0..3]  =========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH1_CNTRL_CHFLTR                                               */
  MDR_TIMER1_CH1_CNTRL_CHFLTR_TIM_CLK  = 0,     /*!< TIM_CLK : Filter Value                                                    */
  MDR_TIMER1_CH1_CNTRL_CHFLTR_2_TIM_CLK = 1,    /*!< 2_TIM_CLK : Filter Value                                                  */
  MDR_TIMER1_CH1_CNTRL_CHFLTR_4_TIM_CLK = 2,    /*!< 4_TIM_CLK : Filter Value                                                  */
  MDR_TIMER1_CH1_CNTRL_CHFLTR_8_TIM_CLK = 3,    /*!< 8_TIM_CLK : Filter Value                                                  */
  MDR_TIMER1_CH1_CNTRL_CHFLTR_6_FDTS_div2 = 4,  /*!< 6_FDTS_div2 : Filter Value                                                */
  MDR_TIMER1_CH1_CNTRL_CHFLTR_8_FDTS_div2 = 5,  /*!< 8_FDTS_div2 : Filter Value                                                */
  MDR_TIMER1_CH1_CNTRL_CHFLTR_6_FDTS_div4 = 6,  /*!< 6_FDTS_div4 : Filter Value                                                */
  MDR_TIMER1_CH1_CNTRL_CHFLTR_8_FDTS_div4 = 7,  /*!< 8_FDTS_div4 : Filter Value                                                */
  MDR_TIMER1_CH1_CNTRL_CHFLTR_6_FDTS_div8 = 8,  /*!< 6_FDTS_div8 : Filter Value                                                */
  MDR_TIMER1_CH1_CNTRL_CHFLTR_8_FDTS_div8 = 9,  /*!< 8_FDTS_div8 : Filter Value                                                */
  MDR_TIMER1_CH1_CNTRL_CHFLTR_5_FDTS_div16 = 10,/*!< 5_FDTS_div16 : Filter Value                                               */
  MDR_TIMER1_CH1_CNTRL_CHFLTR_6_FDTS_div16 = 11,/*!< 6_FDTS_div16 : Filter Value                                               */
  MDR_TIMER1_CH1_CNTRL_CHFLTR_8_FDTS_div16 = 12,/*!< 8_FDTS_div16 : Filter Value                                               */
  MDR_TIMER1_CH1_CNTRL_CHFLTR_5_FDTS_div32 = 13,/*!< 5_FDTS_div32 : Filter Value                                               */
  MDR_TIMER1_CH1_CNTRL_CHFLTR_6_FDTS_div32 = 14,/*!< 6_FDTS_div32 : Filter Value                                               */
  MDR_TIMER1_CH1_CNTRL_CHFLTR_8_FDTS_div32 = 15,/*!< 8_FDTS_div32 : Filter Value                                               */
} MDR_TIMER1_CH1_CNTRL_CHFLTR_Enum;

/* ===========================================  MDR_TIMER1 CH1_CNTRL CHSEL [4..5]  =========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH1_CNTRL_CHSEL                                                */
  MDR_TIMER1_CH1_CNTRL_CHSEL_Rise_Pin  = 0,     /*!< Rise_Pin : Capture Event Select                                           */
  MDR_TIMER1_CH1_CNTRL_CHSEL_Fall_Pin  = 1,     /*!< Fall_Pin : Capture Event Select                                           */
  MDR_TIMER1_CH1_CNTRL_CHSEL_Rise_NextCH = 2,   /*!< Rise_NextCH : Capture Event Select                                        */
  MDR_TIMER1_CH1_CNTRL_CHSEL_Rise_NextNextCH = 3,/*!< Rise_NextNextCH : Capture Event Select                                   */
} MDR_TIMER1_CH1_CNTRL_CHSEL_Enum;

/* ===========================================  MDR_TIMER1 CH1_CNTRL CHPSC [6..7]  =========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH1_CNTRL_CHPSC                                                */
  MDR_TIMER1_CH1_CNTRL_CHPSC_EveryEvent = 0,    /*!< EveryEvent : Pass event for capture                                       */
  MDR_TIMER1_CH1_CNTRL_CHPSC_Events_div2 = 1,   /*!< Events_div2 : Pass event for capture                                      */
  MDR_TIMER1_CH1_CNTRL_CHPSC_Events_div4 = 2,   /*!< Events_div4 : Pass event for capture                                      */
  MDR_TIMER1_CH1_CNTRL_CHPSC_Events_div8 = 3,   /*!< Events_div8 : Pass event for capture                                      */
} MDR_TIMER1_CH1_CNTRL_CHPSC_Enum;

/* ===========================================  MDR_TIMER1 CH1_CNTRL OCCE [8..8]  ============================================ */
typedef enum {                                  /*!< MDR_TIMER1_CH1_CNTRL_OCCE                                                 */
  MDR_TIMER1_CH1_CNTRL_OCCE_Off        = 0,     /*!< Off : Disabled                                                            */
  MDR_TIMER1_CH1_CNTRL_OCCE_On         = 1,     /*!< On : Enabled                                                              */
} MDR_TIMER1_CH1_CNTRL_OCCE_Enum;

/* ===========================================  MDR_TIMER1 CH1_CNTRL OCCM [9..11]  =========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH1_CNTRL_OCCM                                                 */
  MDR_TIMER1_CH1_CNTRL_OCCM_Ref_0      = 0,     /*!< Ref_0 : Ref signal for output                                             */
  MDR_TIMER1_CH1_CNTRL_OCCM_Ref_1_eqCCRx = 1,   /*!< Ref_1_eqCCRx : Ref signal for output                                      */
  MDR_TIMER1_CH1_CNTRL_OCCM_Ref_0_eqCCRx = 2,   /*!< Ref_0_eqCCRx : Ref signal for output                                      */
  MDR_TIMER1_CH1_CNTRL_OCCM_Ref_sw_eqCCRx = 3,  /*!< Ref_sw_eqCCRx : Ref signal for output                                     */
  MDR_TIMER1_CH1_CNTRL_OCCM_Ref0       = 4,     /*!< Ref0 : Ref signal for output                                              */
  MDR_TIMER1_CH1_CNTRL_OCCM_Ref_1      = 5,     /*!< Ref_1 : Ref signal for output                                             */
  MDR_TIMER1_CH1_CNTRL_OCCM_Ref_nDir_inCCRs = 6,/*!< Ref_nDir_inCCRs : Ref signal for output                                   */
  MDR_TIMER1_CH1_CNTRL_OCCM_Ref_Dir_inCCRs = 7, /*!< Ref_Dir_inCCRs : Ref signal for output                                    */
} MDR_TIMER1_CH1_CNTRL_OCCM_Enum;

/* ==========================================  MDR_TIMER1 CH1_CNTRL BRKEN [12..12]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH1_CNTRL_BRKEN                                                */
  MDR_TIMER1_CH1_CNTRL_BRKEN_Off       = 0,     /*!< Off : Disabled                                                            */
  MDR_TIMER1_CH1_CNTRL_BRKEN_On        = 1,     /*!< On : Enabled                                                              */
} MDR_TIMER1_CH1_CNTRL_BRKEN_Enum;

/* ==========================================  MDR_TIMER1 CH1_CNTRL ETREN [13..13]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH1_CNTRL_ETREN                                                */
  MDR_TIMER1_CH1_CNTRL_ETREN_Off       = 0,     /*!< Off : Disabled                                                            */
  MDR_TIMER1_CH1_CNTRL_ETREN_On        = 1,     /*!< On : Enabled                                                              */
} MDR_TIMER1_CH1_CNTRL_ETREN_Enum;

/* =========================================  MDR_TIMER1 CH1_CNTRL WR_CMPL [14..14]  ========================================= */
typedef enum {                                  /*!< MDR_TIMER1_CH1_CNTRL_WR_CMPL                                              */
  MDR_TIMER1_CH1_CNTRL_WR_CMPL_Ready   = 0,     /*!< Ready : Ready to write                                                    */
  MDR_TIMER1_CH1_CNTRL_WR_CMPL_BUSY    = 1,     /*!< BUSY : Writing not completed                                              */
} MDR_TIMER1_CH1_CNTRL_WR_CMPL_Enum;

/* ========================================  MDR_TIMER1 CH1_CNTRL CAP_nPWM [15..15]  ========================================= */
typedef enum {                                  /*!< MDR_TIMER1_CH1_CNTRL_CAP_nPWM                                             */
  MDR_TIMER1_CH1_CNTRL_CAP_nPWM_PWM    = 0,     /*!< PWM : PWM output                                                          */
  MDR_TIMER1_CH1_CNTRL_CAP_nPWM_CAPTURE = 1,    /*!< CAPTURE : Capture input signal                                            */
} MDR_TIMER1_CH1_CNTRL_CAP_nPWM_Enum;

