StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* ========================================================  CH1_DTG  ======================================================== */
/* =============================================  MDR_TIMER1 CH1_DTG DTG [0..3]  ============================================= */
typedef enum {                                  /*!< MDR_TIMER1_CH1_DTG_DTG                                                    */
  MDR_TIMER1_CH1_DTG_DTG_x0            = 0,     /*!< x0 : Prescaler DTG                                                        */
  MDR_TIMER1_CH1_DTG_DTG_x1            = 1,     /*!< x1 : Prescaler DTG                                                        */
  MDR_TIMER1_CH1_DTG_DTG_x2            = 2,     /*!< x2 : Prescaler DTG                                                        */
  MDR_TIMER1_CH1_DTG_DTG_x3            = 3,     /*!< x3 : Prescaler DTG                                                        */
  MDR_TIMER1_CH1_DTG_DTG_x4            = 4,     /*!< x4 : Prescaler DTG                                                        */
  MDR_TIMER1_CH1_DTG_DTG_x5            = 5,     /*!< x5 : Prescaler DTG                                                        */
  MDR_TIMER1_CH1_DTG_DTG_x6            = 6,     /*!< x6 : Prescaler DTG                                                        */
  MDR_TIMER1_CH1_DTG_DTG_x7            = 7,     /*!< x7 : Prescaler DTG                                                        */
  MDR_TIMER1_CH1_DTG_DTG_x8            = 8,     /*!< x8 : Prescaler DTG                                                        */
  MDR_TIMER1_CH1_DTG_DTG_x9            = 9,     /*!< x9 : Prescaler DTG                                                        */
  MDR_TIMER1_CH1_DTG_DTG_x10           = 10,    /*!< x10 : Prescaler DTG                                                       */
  MDR_TIMER1_CH1_DTG_DTG_x11           = 11,    /*!< x11 : Prescaler DTG                                                       */
  MDR_TIMER1_CH1_DTG_DTG_x12           = 12,    /*!< x12 : Prescaler DTG                                                       */
  MDR_TIMER1_CH1_DTG_DTG_x13           = 13,    /*!< x13 : Prescaler DTG                                                       */
  MDR_TIMER1_CH1_DTG_DTG_x14           = 14,    /*!< x14 : Prescaler DTG                                                       */
  MDR_TIMER1_CH1_DTG_DTG_x15           = 15,    /*!< x15 : Prescaler DTG                                                       */
} MDR_TIMER1_CH1_DTG_DTG_Enum;

/* ============================================  MDR_TIMER1 CH1_DTG EDTS [4..4]  ============================================= */
typedef enum {                                  /*!< MDR_TIMER1_CH1_DTG_EDTS                                                   */
  MDR_TIMER1_CH1_DTG_EDTS_TIM_Clock    = 0,     /*!< TIM_Clock : Pin IN                                                        */
  MDR_TIMER1_CH1_DTG_EDTS_FDTS         = 1,     /*!< FDTS : Pin OUT                                                            */
} MDR_TIMER1_CH1_DTG_EDTS_Enum;

/* ========================================================  CH2_DTG  ======================================================== */
/* =============================================  MDR_TIMER1 CH2_DTG DTG [0..3]  ============================================= */
typedef enum {                                  /*!< MDR_TIMER1_CH2_DTG_DTG                                                    */
  MDR_TIMER1_CH2_DTG_DTG_x0            = 0,     /*!< x0 : Prescaler DTG                                                        */
  MDR_TIMER1_CH2_DTG_DTG_x1            = 1,     /*!< x1 : Prescaler DTG                                                        */
  MDR_TIMER1_CH2_DTG_DTG_x2            = 2,     /*!< x2 : Prescaler DTG                                                        */
  MDR_TIMER1_CH2_DTG_DTG_x3            = 3,     /*!< x3 : Prescaler DTG                                                        */
  MDR_TIMER1_CH2_DTG_DTG_x4            = 4,     /*!< x4 : Prescaler DTG                                                        */
  MDR_TIMER1_CH2_DTG_DTG_x5            = 5,     /*!< x5 : Prescaler DTG                                                        */
  MDR_TIMER1_CH2_DTG_DTG_x6            = 6,     /*!< x6 : Prescaler DTG                                                        */
  MDR_TIMER1_CH2_DTG_DTG_x7            = 7,     /*!< x7 : Prescaler DTG                                                        */
  MDR_TIMER1_CH2_DTG_DTG_x8            = 8,     /*!< x8 : Prescaler DTG                                                        */
  MDR_TIMER1_CH2_DTG_DTG_x9            = 9,     /*!< x9 : Prescaler DTG                                                        */
  MDR_TIMER1_CH2_DTG_DTG_x10           = 10,    /*!< x10 : Prescaler DTG                                                       */
  MDR_TIMER1_CH2_DTG_DTG_x11           = 11,    /*!< x11 : Prescaler DTG                                                       */
  MDR_TIMER1_CH2_DTG_DTG_x12           = 12,    /*!< x12 : Prescaler DTG                                                       */
  MDR_TIMER1_CH2_DTG_DTG_x13           = 13,    /*!< x13 : Prescaler DTG                                                       */
  MDR_TIMER1_CH2_DTG_DTG_x14           = 14,    /*!< x14 : Prescaler DTG                                                       */
  MDR_TIMER1_CH2_DTG_DTG_x15           = 15,    /*!< x15 : Prescaler DTG                                                       */
} MDR_TIMER1_CH2_DTG_DTG_Enum;

/* ============================================  MDR_TIMER1 CH2_DTG EDTS [4..4]  ============================================= */
typedef enum {                                  /*!< MDR_TIMER1_CH2_DTG_EDTS                                                   */
  MDR_TIMER1_CH2_DTG_EDTS_TIM_Clock    = 0,     /*!< TIM_Clock : Pin IN                                                        */
  MDR_TIMER1_CH2_DTG_EDTS_FDTS         = 1,     /*!< FDTS : Pin OUT                                                            */
} MDR_TIMER1_CH2_DTG_EDTS_Enum;

/* ========================================================  CH3_DTG  ======================================================== */
/* =============================================  MDR_TIMER1 CH3_DTG DTG [0..3]  ============================================= */
typedef enum {                                  /*!< MDR_TIMER1_CH3_DTG_DTG                                                    */
  MDR_TIMER1_CH3_DTG_DTG_x0            = 0,     /*!< x0 : Prescaler DTG                                                        */
  MDR_TIMER1_CH3_DTG_DTG_x1            = 1,     /*!< x1 : Prescaler DTG                                                        */
  MDR_TIMER1_CH3_DTG_DTG_x2            = 2,     /*!< x2 : Prescaler DTG                                                        */
  MDR_TIMER1_CH3_DTG_DTG_x3            = 3,     /*!< x3 : Prescaler DTG                                                        */
  MDR_TIMER1_CH3_DTG_DTG_x4            = 4,     /*!< x4 : Prescaler DTG                                                        */
  MDR_TIMER1_CH3_DTG_DTG_x5            = 5,     /*!< x5 : Prescaler DTG                                                        */
  MDR_TIMER1_CH3_DTG_DTG_x6            = 6,     /*!< x6 : Prescaler DTG                                                        */
  MDR_TIMER1_CH3_DTG_DTG_x7            = 7,     /*!< x7 : Prescaler DTG                                                        */
  MDR_TIMER1_CH3_DTG_DTG_x8            = 8,     /*!< x8 : Prescaler DTG                                                        */
  MDR_TIMER1_CH3_DTG_DTG_x9            = 9,     /*!< x9 : Prescaler DTG                                                        */
  MDR_TIMER1_CH3_DTG_DTG_x10           = 10,    /*!< x10 : Prescaler DTG                                                       */
  MDR_TIMER1_CH3_DTG_DTG_x11           = 11,    /*!< x11 : Prescaler DTG                                                       */
  MDR_TIMER1_CH3_DTG_DTG_x12           = 12,    /*!< x12 : Prescaler DTG                                                       */
  MDR_TIMER1_CH3_DTG_DTG_x13           = 13,    /*!< x13 : Prescaler DTG                                                       */
  MDR_TIMER1_CH3_DTG_DTG_x14           = 14,    /*!< x14 : Prescaler DTG                                                       */
  MDR_TIMER1_CH3_DTG_DTG_x15           = 15,    /*!< x15 : Prescaler DTG                                                       */
} MDR_TIMER1_CH3_DTG_DTG_Enum;

/* ============================================  MDR_TIMER1 CH3_DTG EDTS [4..4]  ============================================= */
typedef enum {                                  /*!< MDR_TIMER1_CH3_DTG_EDTS                                                   */
  MDR_TIMER1_CH3_DTG_EDTS_TIM_Clock    = 0,     /*!< TIM_Clock : Pin IN                                                        */
  MDR_TIMER1_CH3_DTG_EDTS_FDTS         = 1,     /*!< FDTS : Pin OUT                                                            */
} MDR_TIMER1_CH3_DTG_EDTS_Enum;

/* ========================================================  CH4_DTG  ======================================================== */
/* =============================================  MDR_TIMER1 CH4_DTG DTG [0..3]  ============================================= */
typedef enum {                                  /*!< MDR_TIMER1_CH4_DTG_DTG                                                    */
  MDR_TIMER1_CH4_DTG_DTG_x0            = 0,     /*!< x0 : Prescaler DTG                                                        */
  MDR_TIMER1_CH4_DTG_DTG_x1            = 1,     /*!< x1 : Prescaler DTG                                                        */
  MDR_TIMER1_CH4_DTG_DTG_x2            = 2,     /*!< x2 : Prescaler DTG                                                        */
  MDR_TIMER1_CH4_DTG_DTG_x3            = 3,     /*!< x3 : Prescaler DTG                                                        */
  MDR_TIMER1_CH4_DTG_DTG_x4            = 4,     /*!< x4 : Prescaler DTG                                                        */
  MDR_TIMER1_CH4_DTG_DTG_x5            = 5,     /*!< x5 : Prescaler DTG                                                        */
  MDR_TIMER1_CH4_DTG_DTG_x6            = 6,     /*!< x6 : Prescaler DTG                                                        */
  MDR_TIMER1_CH4_DTG_DTG_x7            = 7,     /*!< x7 : Prescaler DTG                                                        */
  MDR_TIMER1_CH4_DTG_DTG_x8            = 8,     /*!< x8 : Prescaler DTG                                                        */
  MDR_TIMER1_CH4_DTG_DTG_x9            = 9,     /*!< x9 : Prescaler DTG                                                        */
  MDR_TIMER1_CH4_DTG_DTG_x10           = 10,    /*!< x10 : Prescaler DTG                                                       */
  MDR_TIMER1_CH4_DTG_DTG_x11           = 11,    /*!< x11 : Prescaler DTG                                                       */
  MDR_TIMER1_CH4_DTG_DTG_x12           = 12,    /*!< x12 : Prescaler DTG                                                       */
  MDR_TIMER1_CH4_DTG_DTG_x13           = 13,    /*!< x13 : Prescaler DTG                                                       */
  MDR_TIMER1_CH4_DTG_DTG_x14           = 14,    /*!< x14 : Prescaler DTG                                                       */
  MDR_TIMER1_CH4_DTG_DTG_x15           = 15,    /*!< x15 : Prescaler DTG                                                       */
} MDR_TIMER1_CH4_DTG_DTG_Enum;

/* ============================================  MDR_TIMER1 CH4_DTG EDTS [4..4]  ============================================= */
typedef enum {                                  /*!< MDR_TIMER1_CH4_DTG_EDTS                                                   */
  MDR_TIMER1_CH4_DTG_EDTS_TIM_Clock    = 0,     /*!< TIM_Clock : Pin IN                                                        */
  MDR_TIMER1_CH4_DTG_EDTS_FDTS         = 1,     /*!< FDTS : Pin OUT                                                            */
} MDR_TIMER1_CH4_DTG_EDTS_Enum;

/* =====================================================  BRKETR_CNTRL  ====================================================== */
/* ========================================  MDR_TIMER1 BRKETR_CNTRL BRK_INV [0..0]  ========================================= */
typedef enum {                                  /*!< MDR_TIMER1_BRKETR_CNTRL_BRK_INV                                           */
  MDR_TIMER1_BRKETR_CNTRL_BRK_INV_Normal = 0,   /*!< Normal : Signal Not Inverted                                              */
  MDR_TIMER1_BRKETR_CNTRL_BRK_INV_Invert = 1,   /*!< Invert : Signal Inverted                                                  */
} MDR_TIMER1_BRKETR_CNTRL_BRK_INV_Enum;

/* ========================================  MDR_TIMER1 BRKETR_CNTRL ETR_INV [1..1]  ========================================= */
typedef enum {                                  /*!< MDR_TIMER1_BRKETR_CNTRL_ETR_INV                                           */
  MDR_TIMER1_BRKETR_CNTRL_ETR_INV_Normal = 0,   /*!< Normal : Signal Not Inverted                                              */
  MDR_TIMER1_BRKETR_CNTRL_ETR_INV_Invert = 1,   /*!< Invert : Signal Inverted                                                  */
} MDR_TIMER1_BRKETR_CNTRL_ETR_INV_Enum;

