StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* ========================================  MDR_TIMER1 BRKETR_CNTRL ETR_PSC [2..3]  ========================================= */
typedef enum {                                  /*!< MDR_TIMER1_BRKETR_CNTRL_ETR_PSC                                           */
  MDR_TIMER1_BRKETR_CNTRL_ETR_PSC_div1 = 0,     /*!< div1 : No prescaler                                                       */
  MDR_TIMER1_BRKETR_CNTRL_ETR_PSC_div2 = 1,     /*!< div2 : Reduce freq by 2                                                   */
  MDR_TIMER1_BRKETR_CNTRL_ETR_PSC_div4 = 2,     /*!< div4 : Reduce freq by 4                                                   */
  MDR_TIMER1_BRKETR_CNTRL_ETR_PSC_div8 = 3,     /*!< div8 : Reduce freq by 8                                                   */
} MDR_TIMER1_BRKETR_CNTRL_ETR_PSC_Enum;

/* =======================================  MDR_TIMER1 BRKETR_CNTRL ETR_Filter [4..7]  ======================================= */
typedef enum {                                  /*!< MDR_TIMER1_BRKETR_CNTRL_ETR_Filter                                        */
  MDR_TIMER1_BRKETR_CNTRL_ETR_Filter_TIM_CLK = 0,/*!< TIM_CLK : Filter Value                                                   */
  MDR_TIMER1_BRKETR_CNTRL_ETR_Filter_2_TIM_CLK = 1,/*!< 2_TIM_CLK : Filter Value                                               */
  MDR_TIMER1_BRKETR_CNTRL_ETR_Filter_4_TIM_CLK = 2,/*!< 4_TIM_CLK : Filter Value                                               */
  MDR_TIMER1_BRKETR_CNTRL_ETR_Filter_8_TIM_CLK = 3,/*!< 8_TIM_CLK : Filter Value                                               */
  MDR_TIMER1_BRKETR_CNTRL_ETR_Filter_6_FDTS_div2 = 4,/*!< 6_FDTS_div2 : Filter Value                                           */
  MDR_TIMER1_BRKETR_CNTRL_ETR_Filter_8_FDTS_div2 = 5,/*!< 8_FDTS_div2 : Filter Value                                           */
  MDR_TIMER1_BRKETR_CNTRL_ETR_Filter_6_FDTS_div4 = 6,/*!< 6_FDTS_div4 : Filter Value                                           */
  MDR_TIMER1_BRKETR_CNTRL_ETR_Filter_8_FDTS_div4 = 7,/*!< 8_FDTS_div4 : Filter Value                                           */
  MDR_TIMER1_BRKETR_CNTRL_ETR_Filter_6_FDTS_div8 = 8,/*!< 6_FDTS_div8 : Filter Value                                           */
  MDR_TIMER1_BRKETR_CNTRL_ETR_Filter_8_FDTS_div8 = 9,/*!< 8_FDTS_div8 : Filter Value                                           */
  MDR_TIMER1_BRKETR_CNTRL_ETR_Filter_5_FDTS_div16 = 10,/*!< 5_FDTS_div16 : Filter Value                                        */
  MDR_TIMER1_BRKETR_CNTRL_ETR_Filter_6_FDTS_div16 = 11,/*!< 6_FDTS_div16 : Filter Value                                        */
  MDR_TIMER1_BRKETR_CNTRL_ETR_Filter_8_FDTS_div16 = 12,/*!< 8_FDTS_div16 : Filter Value                                        */
  MDR_TIMER1_BRKETR_CNTRL_ETR_Filter_5_FDTS_div32 = 13,/*!< 5_FDTS_div32 : Filter Value                                        */
  MDR_TIMER1_BRKETR_CNTRL_ETR_Filter_6_FDTS_div32 = 14,/*!< 6_FDTS_div32 : Filter Value                                        */
  MDR_TIMER1_BRKETR_CNTRL_ETR_Filter_8_FDTS_div32 = 15,/*!< 8_FDTS_div32 : Filter Value                                        */
} MDR_TIMER1_BRKETR_CNTRL_ETR_Filter_Enum;

/* ========================================================  STATUS  ========================================================= */
/* ===========================================  MDR_TIMER1 STATUS CNT_ZERO [0..0]  =========================================== */
typedef enum {                                  /*!< MDR_TIMER1_STATUS_CNT_ZERO                                                */
  MDR_TIMER1_STATUS_CNT_ZERO_Off       = 0,     /*!< Off : Inactive                                                            */
  MDR_TIMER1_STATUS_CNT_ZERO_On        = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_STATUS_CNT_ZERO_Enum;

/* ===========================================  MDR_TIMER1 STATUS CNT_ARR [1..1]  ============================================ */
typedef enum {                                  /*!< MDR_TIMER1_STATUS_CNT_ARR                                                 */
  MDR_TIMER1_STATUS_CNT_ARR_Off        = 0,     /*!< Off : Inactive                                                            */
  MDR_TIMER1_STATUS_CNT_ARR_On         = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_STATUS_CNT_ARR_Enum;

/* ============================================  MDR_TIMER1 STATUS ETR_RE [2..2]  ============================================ */
typedef enum {                                  /*!< MDR_TIMER1_STATUS_ETR_RE                                                  */
  MDR_TIMER1_STATUS_ETR_RE_Off         = 0,     /*!< Off : Inactive                                                            */
  MDR_TIMER1_STATUS_ETR_RE_On          = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_STATUS_ETR_RE_Enum;

/* ============================================  MDR_TIMER1 STATUS ETR_FE [3..3]  ============================================ */
typedef enum {                                  /*!< MDR_TIMER1_STATUS_ETR_FE                                                  */
  MDR_TIMER1_STATUS_ETR_FE_Off         = 0,     /*!< Off : Inactive                                                            */
  MDR_TIMER1_STATUS_ETR_FE_On          = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_STATUS_ETR_FE_Enum;

/* =============================================  MDR_TIMER1 STATUS BRK [4..4]  ============================================== */
typedef enum {                                  /*!< MDR_TIMER1_STATUS_BRK                                                     */
  MDR_TIMER1_STATUS_BRK_Off            = 0,     /*!< Off : Inactive                                                            */
  MDR_TIMER1_STATUS_BRK_On             = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_STATUS_BRK_Enum;

/* =========================================  MDR_TIMER1 STATUS CCR_CAP_CH1 [5..5]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_STATUS_CCR_CAP_CH1                                             */
  MDR_TIMER1_STATUS_CCR_CAP_CH1_Off    = 0,     /*!< Off : Inactive                                                            */
  MDR_TIMER1_STATUS_CCR_CAP_CH1_On     = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_STATUS_CCR_CAP_CH1_Enum;

/* =========================================  MDR_TIMER1 STATUS CCR_CAP_CH2 [6..6]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_STATUS_CCR_CAP_CH2                                             */
  MDR_TIMER1_STATUS_CCR_CAP_CH2_Off    = 0,     /*!< Off : Inactive                                                            */
  MDR_TIMER1_STATUS_CCR_CAP_CH2_On     = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_STATUS_CCR_CAP_CH2_Enum;

/* =========================================  MDR_TIMER1 STATUS CCR_CAP_CH3 [7..7]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_STATUS_CCR_CAP_CH3                                             */
  MDR_TIMER1_STATUS_CCR_CAP_CH3_Off    = 0,     /*!< Off : Inactive                                                            */
  MDR_TIMER1_STATUS_CCR_CAP_CH3_On     = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_STATUS_CCR_CAP_CH3_Enum;

/* =========================================  MDR_TIMER1 STATUS CCR_CAP_CH4 [8..8]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_STATUS_CCR_CAP_CH4                                             */
  MDR_TIMER1_STATUS_CCR_CAP_CH4_Off    = 0,     /*!< Off : Inactive                                                            */
  MDR_TIMER1_STATUS_CCR_CAP_CH4_On     = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_STATUS_CCR_CAP_CH4_Enum;

/* =========================================  MDR_TIMER1 STATUS CCR_REF_CH1 [9..9]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_STATUS_CCR_REF_CH1                                             */
  MDR_TIMER1_STATUS_CCR_REF_CH1_Off    = 0,     /*!< Off : Inactive                                                            */
  MDR_TIMER1_STATUS_CCR_REF_CH1_On     = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_STATUS_CCR_REF_CH1_Enum;

/* ========================================  MDR_TIMER1 STATUS CCR_REF_CH2 [10..10]  ========================================= */
typedef enum {                                  /*!< MDR_TIMER1_STATUS_CCR_REF_CH2                                             */
  MDR_TIMER1_STATUS_CCR_REF_CH2_Off    = 0,     /*!< Off : Inactive                                                            */
  MDR_TIMER1_STATUS_CCR_REF_CH2_On     = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_STATUS_CCR_REF_CH2_Enum;

