StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* ========================================  MDR_TIMER1 STATUS CCR_REF_CH3 [11..11]  ========================================= */
typedef enum {                                  /*!< MDR_TIMER1_STATUS_CCR_REF_CH3                                             */
  MDR_TIMER1_STATUS_CCR_REF_CH3_Off    = 0,     /*!< Off : Inactive                                                            */
  MDR_TIMER1_STATUS_CCR_REF_CH3_On     = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_STATUS_CCR_REF_CH3_Enum;

/* ========================================  MDR_TIMER1 STATUS CCR_REF_CH4 [12..12]  ========================================= */
typedef enum {                                  /*!< MDR_TIMER1_STATUS_CCR_REF_CH4                                             */
  MDR_TIMER1_STATUS_CCR_REF_CH4_Off    = 0,     /*!< Off : Inactive                                                            */
  MDR_TIMER1_STATUS_CCR_REF_CH4_On     = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_STATUS_CCR_REF_CH4_Enum;

/* ========================================  MDR_TIMER1 STATUS CCR1_CAP_CH1 [13..13]  ======================================== */
typedef enum {                                  /*!< MDR_TIMER1_STATUS_CCR1_CAP_CH1                                            */
  MDR_TIMER1_STATUS_CCR1_CAP_CH1_Off   = 0,     /*!< Off : Inactive                                                            */
  MDR_TIMER1_STATUS_CCR1_CAP_CH1_On    = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_STATUS_CCR1_CAP_CH1_Enum;

/* ========================================  MDR_TIMER1 STATUS CCR1_CAP_CH2 [14..14]  ======================================== */
typedef enum {                                  /*!< MDR_TIMER1_STATUS_CCR1_CAP_CH2                                            */
  MDR_TIMER1_STATUS_CCR1_CAP_CH2_Off   = 0,     /*!< Off : Inactive                                                            */
  MDR_TIMER1_STATUS_CCR1_CAP_CH2_On    = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_STATUS_CCR1_CAP_CH2_Enum;

/* ========================================  MDR_TIMER1 STATUS CCR1_CAP_CH3 [15..15]  ======================================== */
typedef enum {                                  /*!< MDR_TIMER1_STATUS_CCR1_CAP_CH3                                            */
  MDR_TIMER1_STATUS_CCR1_CAP_CH3_Off   = 0,     /*!< Off : Inactive                                                            */
  MDR_TIMER1_STATUS_CCR1_CAP_CH3_On    = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_STATUS_CCR1_CAP_CH3_Enum;

/* ========================================  MDR_TIMER1 STATUS CCR1_CAP_CH4 [16..16]  ======================================== */
typedef enum {                                  /*!< MDR_TIMER1_STATUS_CCR1_CAP_CH4                                            */
  MDR_TIMER1_STATUS_CCR1_CAP_CH4_Off   = 0,     /*!< Off : Inactive                                                            */
  MDR_TIMER1_STATUS_CCR1_CAP_CH4_On    = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_STATUS_CCR1_CAP_CH4_Enum;

/* ==========================================================  IE  =========================================================== */
/* ===========================================  MDR_TIMER1 IE CNT_ZERO_IE [0..0]  ============================================ */
typedef enum {                                  /*!< MDR_TIMER1_IE_CNT_ZERO_IE                                                 */
  MDR_TIMER1_IE_CNT_ZERO_IE_Off        = 0,     /*!< Off : Disable                                                             */
  MDR_TIMER1_IE_CNT_ZERO_IE_On         = 1,     /*!< On : ENable                                                               */
} MDR_TIMER1_IE_CNT_ZERO_IE_Enum;

/* ============================================  MDR_TIMER1 IE CNT_ARR_IE [1..1]  ============================================ */
typedef enum {                                  /*!< MDR_TIMER1_IE_CNT_ARR_IE                                                  */
  MDR_TIMER1_IE_CNT_ARR_IE_Off         = 0,     /*!< Off : Disable                                                             */
  MDR_TIMER1_IE_CNT_ARR_IE_On          = 1,     /*!< On : ENable                                                               */
} MDR_TIMER1_IE_CNT_ARR_IE_Enum;

/* ============================================  MDR_TIMER1 IE ETR_RE_IE [2..2]  ============================================= */
typedef enum {                                  /*!< MDR_TIMER1_IE_ETR_RE_IE                                                   */
  MDR_TIMER1_IE_ETR_RE_IE_Off          = 0,     /*!< Off : Disable                                                             */
  MDR_TIMER1_IE_ETR_RE_IE_On           = 1,     /*!< On : ENable                                                               */
} MDR_TIMER1_IE_ETR_RE_IE_Enum;

/* ============================================  MDR_TIMER1 IE ETR_FE_IE [3..3]  ============================================= */
typedef enum {                                  /*!< MDR_TIMER1_IE_ETR_FE_IE                                                   */
  MDR_TIMER1_IE_ETR_FE_IE_Off          = 0,     /*!< Off : Disable                                                             */
  MDR_TIMER1_IE_ETR_FE_IE_On           = 1,     /*!< On : ENable                                                               */
} MDR_TIMER1_IE_ETR_FE_IE_Enum;

/* ==============================================  MDR_TIMER1 IE BRK_IE [4..4]  ============================================== */
typedef enum {                                  /*!< MDR_TIMER1_IE_BRK_IE                                                      */
  MDR_TIMER1_IE_BRK_IE_Off             = 0,     /*!< Off : Disable                                                             */
  MDR_TIMER1_IE_BRK_IE_On              = 1,     /*!< On : ENable                                                               */
} MDR_TIMER1_IE_BRK_IE_Enum;

/* ==========================================  MDR_TIMER1 IE CCR_CAP_CH1_IE [5..5]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_IE_CCR_CAP_CH1_IE                                              */
  MDR_TIMER1_IE_CCR_CAP_CH1_IE_Off     = 0,     /*!< Off : Disable                                                             */
  MDR_TIMER1_IE_CCR_CAP_CH1_IE_On      = 1,     /*!< On : ENable                                                               */
} MDR_TIMER1_IE_CCR_CAP_CH1_IE_Enum;

/* ==========================================  MDR_TIMER1 IE CCR_CAP_CH2_IE [6..6]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_IE_CCR_CAP_CH2_IE                                              */
  MDR_TIMER1_IE_CCR_CAP_CH2_IE_Off     = 0,     /*!< Off : Disable                                                             */
  MDR_TIMER1_IE_CCR_CAP_CH2_IE_On      = 1,     /*!< On : ENable                                                               */
} MDR_TIMER1_IE_CCR_CAP_CH2_IE_Enum;

