StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* =======================================  MDR_TIMER1 CH3_CNTRL2 CAP_CCR_Fix [4..4]  ======================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH3_CNTRL2_CAP_CCR_Fix                                         */
  MDR_TIMER1_CH3_CNTRL2_CAP_CCR_Fix_Off = 0,    /*!< Off : Inactive                                                            */
  MDR_TIMER1_CH3_CNTRL2_CAP_CCR_Fix_On = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_CH3_CNTRL2_CAP_CCR_Fix_Enum;

/* ======================================================  CH4_CNTRL2  ======================================================= */
/* ==========================================  MDR_TIMER1 CH4_CNTRL2 CHSel1 [0..1]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH4_CNTRL2_CHSel1                                              */
  MDR_TIMER1_CH4_CNTRL2_CHSel1_Rise_Pin = 0,    /*!< Rise_Pin : Capture Event Select                                           */
  MDR_TIMER1_CH4_CNTRL2_CHSel1_Fall_Pin = 1,    /*!< Fall_Pin : Capture Event Select                                           */
  MDR_TIMER1_CH4_CNTRL2_CHSel1_Fall_NextCH = 2, /*!< Fall_NextCH : Capture Event Select                                        */
  MDR_TIMER1_CH4_CNTRL2_CHSel1_Fall_NextNextCH = 3,/*!< Fall_NextNextCH : Capture Event Select                                 */
} MDR_TIMER1_CH4_CNTRL2_CHSel1_Enum;

/* =========================================  MDR_TIMER1 CH4_CNTRL2 CCR1_En [2..2]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH4_CNTRL2_CCR1_En                                             */
  MDR_TIMER1_CH4_CNTRL2_CCR1_En_Off    = 0,     /*!< Off : Disable                                                             */
  MDR_TIMER1_CH4_CNTRL2_CCR1_En_On     = 1,     /*!< On : Enable                                                               */
} MDR_TIMER1_CH4_CNTRL2_CCR1_En_Enum;

/* ==========================================  MDR_TIMER1 CH4_CNTRL2 CCRRLD [3..3]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH4_CNTRL2_CCRRLD                                              */
  MDR_TIMER1_CH4_CNTRL2_CCRRLD_Immediately = 0, /*!< Immediately : Immediately update CCR and CCR1                             */
  MDR_TIMER1_CH4_CNTRL2_CCRRLD_byPreriodCNT = 1,/*!< byPreriodCNT : Update on period completed                                 */
} MDR_TIMER1_CH4_CNTRL2_CCRRLD_Enum;

/* =======================================  MDR_TIMER1 CH4_CNTRL2 CAP_CCR_Fix [4..4]  ======================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH4_CNTRL2_CAP_CCR_Fix                                         */
  MDR_TIMER1_CH4_CNTRL2_CAP_CCR_Fix_Off = 0,    /*!< Off : Inactive                                                            */
  MDR_TIMER1_CH4_CNTRL2_CAP_CCR_Fix_On = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_CH4_CNTRL2_CAP_CCR_Fix_Enum;

/* =========================================================  CCR11  ========================================================= */
/* =========================================================  CCR21  ========================================================= */
/* =========================================================  CCR31  ========================================================= */
/* =========================================================  CCR41  ========================================================= */
/* ========================================================  DMA_RE1  ======================================================== */
/* ========================================  MDR_TIMER1 DMA_RE1 CNT_ZERO_DMAE [0..0]  ======================================== */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE1_CNT_ZERO_DMAE                                          */
  MDR_TIMER1_DMA_RE1_CNT_ZERO_DMAE_Off = 0,     /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE1_CNT_ZERO_DMAE_On  = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE1_CNT_ZERO_DMAE_Enum;

/* ========================================  MDR_TIMER1 DMA_RE1 CNT_ARR_DMAE [1..1]  ========================================= */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE1_CNT_ARR_DMAE                                           */
  MDR_TIMER1_DMA_RE1_CNT_ARR_DMAE_Off  = 0,     /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE1_CNT_ARR_DMAE_On   = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE1_CNT_ARR_DMAE_Enum;

/* =========================================  MDR_TIMER1 DMA_RE1 ETR_RE_DMAE [2..2]  ========================================= */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE1_ETR_RE_DMAE                                            */
  MDR_TIMER1_DMA_RE1_ETR_RE_DMAE_Off   = 0,     /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE1_ETR_RE_DMAE_On    = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE1_ETR_RE_DMAE_Enum;

/* =========================================  MDR_TIMER1 DMA_RE1 ETR_FE_DMAE [3..3]  ========================================= */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE1_ETR_FE_DMAE                                            */
  MDR_TIMER1_DMA_RE1_ETR_FE_DMAE_Off   = 0,     /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE1_ETR_FE_DMAE_On    = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE1_ETR_FE_DMAE_Enum;

/* ==========================================  MDR_TIMER1 DMA_RE1 BRK_DMAE [4..4]  =========================================== */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE1_BRK_DMAE                                               */
  MDR_TIMER1_DMA_RE1_BRK_DMAE_Off      = 0,     /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE1_BRK_DMAE_On       = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE1_BRK_DMAE_Enum;

/* ======================================  MDR_TIMER1 DMA_RE1 CCR_CAP_CH1_DMAE [5..5]  ======================================= */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE1_CCR_CAP_CH1_DMAE                                       */
  MDR_TIMER1_DMA_RE1_CCR_CAP_CH1_DMAE_Off = 0,  /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE1_CCR_CAP_CH1_DMAE_On = 1,   /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE1_CCR_CAP_CH1_DMAE_Enum;

/* ======================================  MDR_TIMER1 DMA_RE1 CCR_CAP_CH2_DMAE [6..6]  ======================================= */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE1_CCR_CAP_CH2_DMAE                                       */
  MDR_TIMER1_DMA_RE1_CCR_CAP_CH2_DMAE_Off = 0,  /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE1_CCR_CAP_CH2_DMAE_On = 1,   /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE1_CCR_CAP_CH2_DMAE_Enum;

/* ======================================  MDR_TIMER1 DMA_RE1 CCR_CAP_CH3_DMAE [7..7]  ======================================= */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE1_CCR_CAP_CH3_DMAE                                       */
  MDR_TIMER1_DMA_RE1_CCR_CAP_CH3_DMAE_Off = 0,  /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE1_CCR_CAP_CH3_DMAE_On = 1,   /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE1_CCR_CAP_CH3_DMAE_Enum;

