StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* ======================================  MDR_TIMER1 DMA_RE1 CCR_CAP_CH4_DMAE [8..8]  ======================================= */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE1_CCR_CAP_CH4_DMAE                                       */
  MDR_TIMER1_DMA_RE1_CCR_CAP_CH4_DMAE_Off = 0,  /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE1_CCR_CAP_CH4_DMAE_On = 1,   /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE1_CCR_CAP_CH4_DMAE_Enum;

/* ======================================  MDR_TIMER1 DMA_RE1 CCR_REF_CH1_DMAE [9..9]  ======================================= */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE1_CCR_REF_CH1_DMAE                                       */
  MDR_TIMER1_DMA_RE1_CCR_REF_CH1_DMAE_Off = 0,  /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE1_CCR_REF_CH1_DMAE_On = 1,   /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE1_CCR_REF_CH1_DMAE_Enum;

/* =====================================  MDR_TIMER1 DMA_RE1 CCR_REF_CH2_DMAE [10..10]  ====================================== */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE1_CCR_REF_CH2_DMAE                                       */
  MDR_TIMER1_DMA_RE1_CCR_REF_CH2_DMAE_Off = 0,  /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE1_CCR_REF_CH2_DMAE_On = 1,   /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE1_CCR_REF_CH2_DMAE_Enum;

/* =====================================  MDR_TIMER1 DMA_RE1 CCR_REF_CH3_DMAE [11..11]  ====================================== */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE1_CCR_REF_CH3_DMAE                                       */
  MDR_TIMER1_DMA_RE1_CCR_REF_CH3_DMAE_Off = 0,  /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE1_CCR_REF_CH3_DMAE_On = 1,   /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE1_CCR_REF_CH3_DMAE_Enum;

/* =====================================  MDR_TIMER1 DMA_RE1 CCR_REF_CH4_DMAE [12..12]  ====================================== */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE1_CCR_REF_CH4_DMAE                                       */
  MDR_TIMER1_DMA_RE1_CCR_REF_CH4_DMAE_Off = 0,  /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE1_CCR_REF_CH4_DMAE_On = 1,   /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE1_CCR_REF_CH4_DMAE_Enum;

/* =====================================  MDR_TIMER1 DMA_RE1 CCR1_CAP_CH1_DMAE [13..13]  ===================================== */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE1_CCR1_CAP_CH1_DMAE                                      */
  MDR_TIMER1_DMA_RE1_CCR1_CAP_CH1_DMAE_Off = 0, /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE1_CCR1_CAP_CH1_DMAE_On = 1,  /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE1_CCR1_CAP_CH1_DMAE_Enum;

/* =====================================  MDR_TIMER1 DMA_RE1 CCR1_CAP_CH2_DMAE [14..14]  ===================================== */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE1_CCR1_CAP_CH2_DMAE                                      */
  MDR_TIMER1_DMA_RE1_CCR1_CAP_CH2_DMAE_Off = 0, /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE1_CCR1_CAP_CH2_DMAE_On = 1,  /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE1_CCR1_CAP_CH2_DMAE_Enum;

/* =====================================  MDR_TIMER1 DMA_RE1 CCR1_CAP_CH3_DMAE [15..15]  ===================================== */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE1_CCR1_CAP_CH3_DMAE                                      */
  MDR_TIMER1_DMA_RE1_CCR1_CAP_CH3_DMAE_Off = 0, /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE1_CCR1_CAP_CH3_DMAE_On = 1,  /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE1_CCR1_CAP_CH3_DMAE_Enum;

/* =====================================  MDR_TIMER1 DMA_RE1 CCR1_CAP_CH4_DMAE [16..16]  ===================================== */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE1_CCR1_CAP_CH4_DMAE                                      */
  MDR_TIMER1_DMA_RE1_CCR1_CAP_CH4_DMAE_Off = 0, /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE1_CCR1_CAP_CH4_DMAE_On = 1,  /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE1_CCR1_CAP_CH4_DMAE_Enum;

/* ========================================================  DMA_RE2  ======================================================== */
/* ========================================  MDR_TIMER1 DMA_RE2 CNT_ZERO_DMAE [0..0]  ======================================== */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE2_CNT_ZERO_DMAE                                          */
  MDR_TIMER1_DMA_RE2_CNT_ZERO_DMAE_Off = 0,     /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE2_CNT_ZERO_DMAE_On  = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE2_CNT_ZERO_DMAE_Enum;

/* ========================================  MDR_TIMER1 DMA_RE2 CNT_ARR_DMAE [1..1]  ========================================= */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE2_CNT_ARR_DMAE                                           */
  MDR_TIMER1_DMA_RE2_CNT_ARR_DMAE_Off  = 0,     /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE2_CNT_ARR_DMAE_On   = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE2_CNT_ARR_DMAE_Enum;

