StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* =========================================  MDR_TIMER1 DMA_RE2 ETR_RE_DMAE [2..2]  ========================================= */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE2_ETR_RE_DMAE                                            */
  MDR_TIMER1_DMA_RE2_ETR_RE_DMAE_Off   = 0,     /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE2_ETR_RE_DMAE_On    = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE2_ETR_RE_DMAE_Enum;

/* =========================================  MDR_TIMER1 DMA_RE2 ETR_FE_DMAE [3..3]  ========================================= */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE2_ETR_FE_DMAE                                            */
  MDR_TIMER1_DMA_RE2_ETR_FE_DMAE_Off   = 0,     /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE2_ETR_FE_DMAE_On    = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE2_ETR_FE_DMAE_Enum;

/* ==========================================  MDR_TIMER1 DMA_RE2 BRK_DMAE [4..4]  =========================================== */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE2_BRK_DMAE                                               */
  MDR_TIMER1_DMA_RE2_BRK_DMAE_Off      = 0,     /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE2_BRK_DMAE_On       = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE2_BRK_DMAE_Enum;

/* ======================================  MDR_TIMER1 DMA_RE2 CCR_CAP_CH1_DMAE [5..5]  ======================================= */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE2_CCR_CAP_CH1_DMAE                                       */
  MDR_TIMER1_DMA_RE2_CCR_CAP_CH1_DMAE_Off = 0,  /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE2_CCR_CAP_CH1_DMAE_On = 1,   /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE2_CCR_CAP_CH1_DMAE_Enum;

/* ======================================  MDR_TIMER1 DMA_RE2 CCR_CAP_CH2_DMAE [6..6]  ======================================= */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE2_CCR_CAP_CH2_DMAE                                       */
  MDR_TIMER1_DMA_RE2_CCR_CAP_CH2_DMAE_Off = 0,  /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE2_CCR_CAP_CH2_DMAE_On = 1,   /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE2_CCR_CAP_CH2_DMAE_Enum;

/* ======================================  MDR_TIMER1 DMA_RE2 CCR_CAP_CH3_DMAE [7..7]  ======================================= */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE2_CCR_CAP_CH3_DMAE                                       */
  MDR_TIMER1_DMA_RE2_CCR_CAP_CH3_DMAE_Off = 0,  /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE2_CCR_CAP_CH3_DMAE_On = 1,   /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE2_CCR_CAP_CH3_DMAE_Enum;

/* ======================================  MDR_TIMER1 DMA_RE2 CCR_CAP_CH4_DMAE [8..8]  ======================================= */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE2_CCR_CAP_CH4_DMAE                                       */
  MDR_TIMER1_DMA_RE2_CCR_CAP_CH4_DMAE_Off = 0,  /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE2_CCR_CAP_CH4_DMAE_On = 1,   /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE2_CCR_CAP_CH4_DMAE_Enum;

/* ======================================  MDR_TIMER1 DMA_RE2 CCR_REF_CH1_DMAE [9..9]  ======================================= */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE2_CCR_REF_CH1_DMAE                                       */
  MDR_TIMER1_DMA_RE2_CCR_REF_CH1_DMAE_Off = 0,  /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE2_CCR_REF_CH1_DMAE_On = 1,   /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE2_CCR_REF_CH1_DMAE_Enum;

/* =====================================  MDR_TIMER1 DMA_RE2 CCR_REF_CH2_DMAE [10..10]  ====================================== */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE2_CCR_REF_CH2_DMAE                                       */
  MDR_TIMER1_DMA_RE2_CCR_REF_CH2_DMAE_Off = 0,  /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE2_CCR_REF_CH2_DMAE_On = 1,   /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE2_CCR_REF_CH2_DMAE_Enum;

/* =====================================  MDR_TIMER1 DMA_RE2 CCR_REF_CH3_DMAE [11..11]  ====================================== */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE2_CCR_REF_CH3_DMAE                                       */
  MDR_TIMER1_DMA_RE2_CCR_REF_CH3_DMAE_Off = 0,  /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE2_CCR_REF_CH3_DMAE_On = 1,   /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE2_CCR_REF_CH3_DMAE_Enum;

/* =====================================  MDR_TIMER1 DMA_RE2 CCR_REF_CH4_DMAE [12..12]  ====================================== */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE2_CCR_REF_CH4_DMAE                                       */
  MDR_TIMER1_DMA_RE2_CCR_REF_CH4_DMAE_Off = 0,  /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE2_CCR_REF_CH4_DMAE_On = 1,   /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE2_CCR_REF_CH4_DMAE_Enum;

