StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* ===============================================  MDR_SSP1 IMSC RTIM [1..1]  =============================================== */
typedef enum {                                  /*!< MDR_SSP1_IMSC_RTIM                                                        */
  MDR_SSP1_IMSC_RTIM_NoEvent           = 0,     /*!< NoEvent : Flag Inactive                                                   */
  MDR_SSP1_IMSC_RTIM_RX_Timeout        = 1,     /*!< RX_Timeout : Flag Active                                                  */
} MDR_SSP1_IMSC_RTIM_Enum;

/* ===============================================  MDR_SSP1 IMSC RXIM [2..2]  =============================================== */
typedef enum {                                  /*!< MDR_SSP1_IMSC_RXIM                                                        */
  MDR_SSP1_IMSC_RXIM_NoEvent           = 0,     /*!< NoEvent : Flag Inactive                                                   */
  MDR_SSP1_IMSC_RXIM_RX_HalfFull       = 1,     /*!< RX_HalfFull : Flag Active                                                 */
} MDR_SSP1_IMSC_RXIM_Enum;

/* ===============================================  MDR_SSP1 IMSC TXIM [3..3]  =============================================== */
typedef enum {                                  /*!< MDR_SSP1_IMSC_TXIM                                                        */
  MDR_SSP1_IMSC_TXIM_NoEvent           = 0,     /*!< NoEvent : Flag Inactive                                                   */
  MDR_SSP1_IMSC_TXIM_TX_HalfEmpty      = 1,     /*!< TX_HalfEmpty : Flag Active                                                */
} MDR_SSP1_IMSC_TXIM_Enum;

/* ==========================================================  RIS  ========================================================== */
/* ==============================================  MDR_SSP1 RIS RORRIS [0..0]  =============================================== */
typedef enum {                                  /*!< MDR_SSP1_RIS_RORRIS                                                       */
  MDR_SSP1_RIS_RORRIS_NoEvent          = 0,     /*!< NoEvent : Flag Inactive                                                   */
  MDR_SSP1_RIS_RORRIS_RX_Overrun       = 1,     /*!< RX_Overrun : Flag Active                                                  */
} MDR_SSP1_RIS_RORRIS_Enum;

/* ===============================================  MDR_SSP1 RIS RTRIS [1..1]  =============================================== */
typedef enum {                                  /*!< MDR_SSP1_RIS_RTRIS                                                        */
  MDR_SSP1_RIS_RTRIS_NoEvent           = 0,     /*!< NoEvent : Flag Inactive                                                   */
  MDR_SSP1_RIS_RTRIS_RX_Timeout        = 1,     /*!< RX_Timeout : Flag Active                                                  */
} MDR_SSP1_RIS_RTRIS_Enum;

/* ===============================================  MDR_SSP1 RIS RXRIS [2..2]  =============================================== */
typedef enum {                                  /*!< MDR_SSP1_RIS_RXRIS                                                        */
  MDR_SSP1_RIS_RXRIS_NoEvent           = 0,     /*!< NoEvent : Flag Inactive                                                   */
  MDR_SSP1_RIS_RXRIS_RX_HalfFull       = 1,     /*!< RX_HalfFull : Flag Active                                                 */
} MDR_SSP1_RIS_RXRIS_Enum;

/* ===============================================  MDR_SSP1 RIS TXRIS [3..3]  =============================================== */
typedef enum {                                  /*!< MDR_SSP1_RIS_TXRIS                                                        */
  MDR_SSP1_RIS_TXRIS_NoEvent           = 0,     /*!< NoEvent : Flag Inactive                                                   */
  MDR_SSP1_RIS_TXRIS_TX_HalfEmpty      = 1,     /*!< TX_HalfEmpty : Flag Active                                                */
} MDR_SSP1_RIS_TXRIS_Enum;

/* ==========================================================  MIS  ========================================================== */
/* ==============================================  MDR_SSP1 MIS RORMIS [0..0]  =============================================== */
typedef enum {                                  /*!< MDR_SSP1_MIS_RORMIS                                                       */
  MDR_SSP1_MIS_RORMIS_NoEvent          = 0,     /*!< NoEvent : Flag Inactive                                                   */
  MDR_SSP1_MIS_RORMIS_RX_Overrun       = 1,     /*!< RX_Overrun : Flag Active                                                  */
} MDR_SSP1_MIS_RORMIS_Enum;

/* ===============================================  MDR_SSP1 MIS RTMIS [1..1]  =============================================== */
typedef enum {                                  /*!< MDR_SSP1_MIS_RTMIS                                                        */
  MDR_SSP1_MIS_RTMIS_NoEvent           = 0,     /*!< NoEvent : Flag Inactive                                                   */
  MDR_SSP1_MIS_RTMIS_RX_Timeout        = 1,     /*!< RX_Timeout : Flag Active                                                  */
} MDR_SSP1_MIS_RTMIS_Enum;

/* ===============================================  MDR_SSP1 MIS RXMIS [2..2]  =============================================== */
typedef enum {                                  /*!< MDR_SSP1_MIS_RXMIS                                                        */
  MDR_SSP1_MIS_RXMIS_NoEvent           = 0,     /*!< NoEvent : Flag Inactive                                                   */
  MDR_SSP1_MIS_RXMIS_RX_HalfFull       = 1,     /*!< RX_HalfFull : Flag Active                                                 */
} MDR_SSP1_MIS_RXMIS_Enum;

/* ===============================================  MDR_SSP1 MIS TXMIS [3..3]  =============================================== */
typedef enum {                                  /*!< MDR_SSP1_MIS_TXMIS                                                        */
  MDR_SSP1_MIS_TXMIS_NoEvent           = 0,     /*!< NoEvent : Flag Inactive                                                   */
  MDR_SSP1_MIS_TXMIS_TX_HalfEmpty      = 1,     /*!< TX_HalfEmpty : Flag Active                                                */
} MDR_SSP1_MIS_TXMIS_Enum;

/* ==========================================================  ICR  ========================================================== */
/* ===============================================  MDR_SSP1 ICR RORIC [0..0]  =============================================== */
typedef enum {                                  /*!< MDR_SSP1_ICR_RORIC                                                        */
  MDR_SSP1_ICR_RORIC_Inactive          = 0,     /*!< Inactive : No action                                                      */
  MDR_SSP1_ICR_RORIC_Clear             = 1,     /*!< Clear : Clear Flag                                                        */
} MDR_SSP1_ICR_RORIC_Enum;

/* ===============================================  MDR_SSP1 ICR RTIC [1..1]  ================================================ */
typedef enum {                                  /*!< MDR_SSP1_ICR_RTIC                                                         */
  MDR_SSP1_ICR_RTIC_Inactive           = 0,     /*!< Inactive : No action                                                      */
  MDR_SSP1_ICR_RTIC_Clear              = 1,     /*!< Clear : Clear Flag                                                        */
} MDR_SSP1_ICR_RTIC_Enum;

/* =========================================================  DMACR  ========================================================= */
/* =============================================  MDR_SSP1 DMACR RXDMAE [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_SSP1_DMACR_RXDMAE                                                     */
  MDR_SSP1_DMACR_RXDMAE_Disable        = 0,     /*!< Disable : Disable DMA                                                     */
  MDR_SSP1_DMACR_RXDMAE_Enable         = 1,     /*!< Enable : Enable DMA                                                       */
} MDR_SSP1_DMACR_RXDMAE_Enum;

