StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* ================================================  MDR_UART1 FR DCD [2..2]  ================================================ */
typedef enum {                                  /*!< MDR_UART1_FR_DCD                                                          */
  MDR_UART1_FR_DCD_Inactive            = 0,     /*!< Inactive : Modem line is High                                             */
  MDR_UART1_FR_DCD_Active              = 1,     /*!< Active : Modem line is Low                                                */
} MDR_UART1_FR_DCD_Enum;

/* ===============================================  MDR_UART1 FR BUSY [3..3]  ================================================ */
typedef enum {                                  /*!< MDR_UART1_FR_BUSY                                                         */
  MDR_UART1_FR_BUSY_Off                = 0,     /*!< Off : Inactive                                                            */
  MDR_UART1_FR_BUSY_On                 = 1,     /*!< On : Active                                                               */
} MDR_UART1_FR_BUSY_Enum;

/* ===============================================  MDR_UART1 FR RXFE [4..4]  ================================================ */
typedef enum {                                  /*!< MDR_UART1_FR_RXFE                                                         */
  MDR_UART1_FR_RXFE_Inactive           = 0,     /*!< Inactive : FIFO not Empty                                                 */
  MDR_UART1_FR_RXFE_Empty              = 1,     /*!< Empty : FIFO Empty                                                        */
} MDR_UART1_FR_RXFE_Enum;

/* ===============================================  MDR_UART1 FR TXFF [5..5]  ================================================ */
typedef enum {                                  /*!< MDR_UART1_FR_TXFF                                                         */
  MDR_UART1_FR_TXFF_Inactive           = 0,     /*!< Inactive : FIFO not Full                                                  */
  MDR_UART1_FR_TXFF_Full               = 1,     /*!< Full : FIFO Full                                                          */
} MDR_UART1_FR_TXFF_Enum;

/* ===============================================  MDR_UART1 FR RXFF [6..6]  ================================================ */
typedef enum {                                  /*!< MDR_UART1_FR_RXFF                                                         */
  MDR_UART1_FR_RXFF_Inactive           = 0,     /*!< Inactive : FIFO not Full                                                  */
  MDR_UART1_FR_RXFF_Full               = 1,     /*!< Full : FIFO Full                                                          */
} MDR_UART1_FR_RXFF_Enum;

/* ===============================================  MDR_UART1 FR TXFE [7..7]  ================================================ */
typedef enum {                                  /*!< MDR_UART1_FR_TXFE                                                         */
  MDR_UART1_FR_TXFE_Inactive           = 0,     /*!< Inactive : FIFO not Empty                                                 */
  MDR_UART1_FR_TXFE_Empty              = 1,     /*!< Empty : FIFO Empty                                                        */
} MDR_UART1_FR_TXFE_Enum;

/* ================================================  MDR_UART1 FR RI [8..8]  ================================================= */
typedef enum {                                  /*!< MDR_UART1_FR_RI                                                           */
  MDR_UART1_FR_RI_Inactive             = 0,     /*!< Inactive : Modem line is High                                             */
  MDR_UART1_FR_RI_Active               = 1,     /*!< Active : Modem line is Low                                                */
} MDR_UART1_FR_RI_Enum;

/* =========================================================  ILPR  ========================================================== */
/* =========================================================  IBRD  ========================================================== */
/* =========================================================  FBRD  ========================================================== */
/* =========================================================  LCR_H  ========================================================= */
/* ==============================================  MDR_UART1 LCR_H BRK [0..0]  =============================================== */
typedef enum {                                  /*!< MDR_UART1_LCR_H_BRK                                                       */
  MDR_UART1_LCR_H_BRK_Off              = 0,     /*!< Off : Disabled                                                            */
  MDR_UART1_LCR_H_BRK_On               = 1,     /*!< On : Enabled                                                              */
} MDR_UART1_LCR_H_BRK_Enum;

/* ==============================================  MDR_UART1 LCR_H PEN [1..1]  =============================================== */
typedef enum {                                  /*!< MDR_UART1_LCR_H_PEN                                                       */
  MDR_UART1_LCR_H_PEN_Off              = 0,     /*!< Off : Disabled                                                            */
  MDR_UART1_LCR_H_PEN_On               = 1,     /*!< On : Enabled                                                              */
} MDR_UART1_LCR_H_PEN_Enum;

/* ==============================================  MDR_UART1 LCR_H EPS [2..2]  =============================================== */
typedef enum {                                  /*!< MDR_UART1_LCR_H_EPS                                                       */
  MDR_UART1_LCR_H_EPS_Odd              = 0,     /*!< Odd : Odd parity bit                                                      */
  MDR_UART1_LCR_H_EPS_Even             = 1,     /*!< Even : Even parity bit                                                    */
} MDR_UART1_LCR_H_EPS_Enum;

/* ==============================================  MDR_UART1 LCR_H STP2 [3..3]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_LCR_H_STP2                                                      */
  MDR_UART1_LCR_H_STP2_Off             = 0,     /*!< Off : Disabled                                                            */
  MDR_UART1_LCR_H_STP2_On              = 1,     /*!< On : Enabled                                                              */
} MDR_UART1_LCR_H_STP2_Enum;

