StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* ==============================================  MDR_UART1 ICR TX_IC [5..5]  =============================================== */
typedef enum {                                  /*!< MDR_UART1_ICR_TX_IC                                                       */
  MDR_UART1_ICR_TX_IC_Inactive         = 0,     /*!< Inactive : Inactive state                                                 */
  MDR_UART1_ICR_TX_IC_Clear            = 1,     /*!< Clear : Clear event                                                       */
} MDR_UART1_ICR_TX_IC_Enum;

/* ==============================================  MDR_UART1 ICR RT_IC [6..6]  =============================================== */
typedef enum {                                  /*!< MDR_UART1_ICR_RT_IC                                                       */
  MDR_UART1_ICR_RT_IC_Inactive         = 0,     /*!< Inactive : Inactive state                                                 */
  MDR_UART1_ICR_RT_IC_Clear            = 1,     /*!< Clear : Clear event                                                       */
} MDR_UART1_ICR_RT_IC_Enum;

/* ==============================================  MDR_UART1 ICR FE_IC [7..7]  =============================================== */
typedef enum {                                  /*!< MDR_UART1_ICR_FE_IC                                                       */
  MDR_UART1_ICR_FE_IC_Inactive         = 0,     /*!< Inactive : Inactive state                                                 */
  MDR_UART1_ICR_FE_IC_Clear            = 1,     /*!< Clear : Clear event                                                       */
} MDR_UART1_ICR_FE_IC_Enum;

/* ==============================================  MDR_UART1 ICR PE_IC [8..8]  =============================================== */
typedef enum {                                  /*!< MDR_UART1_ICR_PE_IC                                                       */
  MDR_UART1_ICR_PE_IC_Inactive         = 0,     /*!< Inactive : Inactive state                                                 */
  MDR_UART1_ICR_PE_IC_Clear            = 1,     /*!< Clear : Clear event                                                       */
} MDR_UART1_ICR_PE_IC_Enum;

/* ==============================================  MDR_UART1 ICR BE_IC [9..9]  =============================================== */
typedef enum {                                  /*!< MDR_UART1_ICR_BE_IC                                                       */
  MDR_UART1_ICR_BE_IC_Inactive         = 0,     /*!< Inactive : Inactive state                                                 */
  MDR_UART1_ICR_BE_IC_Clear            = 1,     /*!< Clear : Clear event                                                       */
} MDR_UART1_ICR_BE_IC_Enum;

/* =============================================  MDR_UART1 ICR OE_IC [10..10]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_ICR_OE_IC                                                       */
  MDR_UART1_ICR_OE_IC_Inactive         = 0,     /*!< Inactive : Inactive state                                                 */
  MDR_UART1_ICR_OE_IC_Clear            = 1,     /*!< Clear : Clear event                                                       */
} MDR_UART1_ICR_OE_IC_Enum;

/* =========================================================  DMACR  ========================================================= */
/* =============================================  MDR_UART1 DMACR RXDMAE [0..0]  ============================================= */
typedef enum {                                  /*!< MDR_UART1_DMACR_RXDMAE                                                    */
  MDR_UART1_DMACR_RXDMAE_Disabled      = 0,     /*!< Disabled : DMA disabled                                                   */
  MDR_UART1_DMACR_RXDMAE_Enabled       = 1,     /*!< Enabled : DMA enabled                                                     */
} MDR_UART1_DMACR_RXDMAE_Enum;

/* =============================================  MDR_UART1 DMACR TXDMAE [1..1]  ============================================= */
typedef enum {                                  /*!< MDR_UART1_DMACR_TXDMAE                                                    */
  MDR_UART1_DMACR_TXDMAE_Disabled      = 0,     /*!< Disabled : DMA disabled                                                   */
  MDR_UART1_DMACR_TXDMAE_Enabled       = 1,     /*!< Enabled : DMA enabled                                                     */
} MDR_UART1_DMACR_TXDMAE_Enum;

/* ============================================  MDR_UART1 DMACR DMAonErr [2..2]  ============================================ */
typedef enum {                                  /*!< MDR_UART1_DMACR_DMAonErr                                                  */
  MDR_UART1_DMACR_DMAonErr_IgnoreError = 0,     /*!< IgnoreError : Ignore Errors                                               */
  MDR_UART1_DMACR_DMAonErr_StopOnError = 1,     /*!< StopOnError : SReq and Req disable on Error                               */
} MDR_UART1_DMACR_DMAonErr_Enum;

/* ==========================================================  TCR  ========================================================== */
/* ===============================================  MDR_UART1 TCR ITEN [0..0]  =============================================== */
typedef enum {                                  /*!< MDR_UART1_TCR_ITEN                                                        */
  MDR_UART1_TCR_ITEN_Disabled          = 0,     /*!< Disabled : Normal operation                                               */
  MDR_UART1_TCR_ITEN_Enabled           = 1,     /*!< Enabled : Testing Mode                                                    */
} MDR_UART1_TCR_ITEN_Enum;

/* =============================================  MDR_UART1 TCR TestFIFO [1..1]  ============================================= */
typedef enum {                                  /*!< MDR_UART1_TCR_TestFIFO                                                    */
  MDR_UART1_TCR_TestFIFO_Disabled      = 0,     /*!< Disabled : Normal operation                                               */
  MDR_UART1_TCR_TestFIFO_Enabled       = 1,     /*!< Enabled : Testing Mode                                                    */
} MDR_UART1_TCR_TestFIFO_Enum;

/* =============================================  MDR_UART1 TCR SIRTest [2..2]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_TCR_SIRTest                                                     */
  MDR_UART1_TCR_SIRTest_Disabled       = 0,     /*!< Disabled : Normal operation                                               */
  MDR_UART1_TCR_SIRTest_Enabled        = 1,     /*!< Enabled : Testing Mode                                                    */
} MDR_UART1_TCR_SIRTest_Enum;



/* =========================================================================================================================== */
/* ================                                          MDR_DMA                                          ================ */
/* =========================================================================================================================== */

/* ========================================================  STATUS  ========================================================= */
/* =============================================  MDR_DMA STATUS Enable [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_DMA_STATUS_Enable                                                     */
  MDR_DMA_STATUS_Enable_Disabled       = 0,     /*!< Disabled : Block inactive                                                 */
  MDR_DMA_STATUS_Enable_Enabled        = 1,     /*!< Enabled : Block active                                                    */
} MDR_DMA_STATUS_Enable_Enum;

/* ==============================================  MDR_DMA STATUS State [4..7]  ============================================== */
typedef enum {                                  /*!< MDR_DMA_STATUS_State                                                      */
  MDR_DMA_STATUS_State_Idle            = 0,     /*!< Idle : Idle state                                                         */
  MDR_DMA_STATUS_State_RD_Ctrl         = 1,     /*!< RD_Ctrl : Reading channel controller data                                 */
  MDR_DMA_STATUS_State_RD_pSrc         = 2,     /*!< RD_pSrc : Reading source data end pointer                                 */
  MDR_DMA_STATUS_State_RD_pDest        = 3,     /*!< RD_pDest : Reading destination data end pointer                           */
  MDR_DMA_STATUS_State_RD_Data         = 4,     /*!< RD_Data : Reading source data                                             */
  MDR_DMA_STATUS_State_WR_Data         = 5,     /*!< WR_Data : writing destination data                                        */
  MDR_DMA_STATUS_State_Wait_Clr        = 6,     /*!< Wait_Clr : Waiting for DMA request to clear                               */
  MDR_DMA_STATUS_State_WR_Ctrl         = 7,     /*!< WR_Ctrl : Writing channel controller data                                 */
  MDR_DMA_STATUS_State_Stalled         = 8,     /*!< Stalled : Stalled transfer                                                */
  MDR_DMA_STATUS_State_Done            = 9,     /*!< Done : Done transfer                                                      */
  MDR_DMA_STATUS_State_ScatGath        = 10,    /*!< ScatGath : scatter-gather transition                                      */
} MDR_DMA_STATUS_State_Enum;

/* =========================================  MDR_DMA STATUS Chnls_minus1 [16..20]  ========================================== */
typedef enum {                                  /*!< MDR_DMA_STATUS_Chnls_minus1                                               */
  MDR_DMA_STATUS_Chnls_minus1_1_channels = 0,   /*!< 1_channels : Channels Count                                               */
  MDR_DMA_STATUS_Chnls_minus1_2_channels = 1,   /*!< 2_channels : Channels Count                                               */
  MDR_DMA_STATUS_Chnls_minus1_3_channels = 2,   /*!< 3_channels : Channels Count                                               */
  MDR_DMA_STATUS_Chnls_minus1_4_channels = 3,   /*!< 4_channels : Channels Count                                               */
  MDR_DMA_STATUS_Chnls_minus1_5_channels = 4,   /*!< 5_channels : Channels Count                                               */
  MDR_DMA_STATUS_Chnls_minus1_6_channels = 5,   /*!< 6_channels : Channels Count                                               */
  MDR_DMA_STATUS_Chnls_minus1_7_channels = 6,   /*!< 7_channels : Channels Count                                               */
  MDR_DMA_STATUS_Chnls_minus1_8_channels = 7,   /*!< 8_channels : Channels Count                                               */
  MDR_DMA_STATUS_Chnls_minus1_9_channels = 8,   /*!< 9_channels : Channels Count                                               */
  MDR_DMA_STATUS_Chnls_minus1_10_channels = 9,  /*!< 10_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_11_channels = 10, /*!< 11_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_12_channels = 11, /*!< 12_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_13_channels = 12, /*!< 13_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_14_channels = 13, /*!< 14_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_15_channels = 14, /*!< 15_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_16_channels = 15, /*!< 16_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_17_channels = 16, /*!< 17_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_18_channels = 17, /*!< 18_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_19_channels = 18, /*!< 19_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_20_channels = 19, /*!< 20_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_21_channels = 20, /*!< 21_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_22_channels = 21, /*!< 22_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_23_channels = 22, /*!< 23_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_24_channels = 23, /*!< 24_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_25_channels = 24, /*!< 25_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_26_channels = 25, /*!< 26_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_27_channels = 26, /*!< 27_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_28_channels = 27, /*!< 28_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_29_channels = 28, /*!< 29_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_30_channels = 29, /*!< 30_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_31_channels = 30, /*!< 31_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_32_channels = 31, /*!< 32_channels : Channels Count                                              */
} MDR_DMA_STATUS_Chnls_minus1_Enum;

/* ==========================================  MDR_DMA STATUS test_status [28..28]  ========================================== */
typedef enum {                                  /*!< MDR_DMA_STATUS_test_status                                                */
  MDR_DMA_STATUS_test_status_Unavailable = 0,   /*!< Unavailable : Test logic unavailable                                      */
  MDR_DMA_STATUS_test_status_Available = 1,     /*!< Available : Test logic available                                          */
} MDR_DMA_STATUS_test_status_Enum;

/* ==========================================================  CFG  ========================================================== */
/* ===============================================  MDR_DMA CFG Enable [0..0]  =============================================== */
typedef enum {                                  /*!< MDR_DMA_CFG_Enable                                                        */
  MDR_DMA_CFG_Enable_Disabled          = 0,     /*!< Disabled : Block inactive                                                 */
  MDR_DMA_CFG_Enable_Enabled           = 1,     /*!< Enabled : Block active                                                    */
} MDR_DMA_CFG_Enable_Enum;

/* =============================================  MDR_DMA CFG Privileged [5..5]  ============================================= */
typedef enum {                                  /*!< MDR_DMA_CFG_Privileged                                                    */
  MDR_DMA_CFG_Privileged_Off           = 0,     /*!< Off : Inactive                                                            */
  MDR_DMA_CFG_Privileged_On            = 1,     /*!< On : Active                                                               */
} MDR_DMA_CFG_Privileged_Enum;

/* =============================================  MDR_DMA CFG Bufferable [6..6]  ============================================= */
typedef enum {                                  /*!< MDR_DMA_CFG_Bufferable                                                    */
  MDR_DMA_CFG_Bufferable_Off           = 0,     /*!< Off : Inactive                                                            */
  MDR_DMA_CFG_Bufferable_On            = 1,     /*!< On : Active                                                               */
} MDR_DMA_CFG_Bufferable_Enum;

/* ==============================================  MDR_DMA CFG Cachable [7..7]  ============================================== */
typedef enum {                                  /*!< MDR_DMA_CFG_Cachable                                                      */
  MDR_DMA_CFG_Cachable_Off             = 0,     /*!< Off : Inactive                                                            */
  MDR_DMA_CFG_Cachable_On              = 1,     /*!< On : Active                                                               */
} MDR_DMA_CFG_Cachable_Enum;

/* =====================================================  CTRL_BASE_PTR  ===================================================== */
/* ===================================================  ALT_CTRL_BASE_PTR  =================================================== */
/* ===================================================  WAITONREQ_STATUS  ==================================================== */
/* ==========================================  MDR_DMA WAITONREQ_STATUS Ch_ [0..0]  ========================================== */
typedef enum {                                  /*!< MDR_DMA_WAITONREQ_STATUS_Ch_                                              */
  MDR_DMA_WAITONREQ_STATUS_Ch__Off     = 0,     /*!< Off : Inactive                                                            */
  MDR_DMA_WAITONREQ_STATUS_Ch__On      = 1,     /*!< On : Active                                                               */
} MDR_DMA_WAITONREQ_STATUS_Ch__Enum;

/* ====================================================  CHNL_SW_REQUEST  ==================================================== */
/* ==========================================  MDR_DMA CHNL_SW_REQUEST Ch_ [0..0]  =========================================== */
typedef enum {                                  /*!< MDR_DMA_CHNL_SW_REQUEST_Ch_                                               */
  MDR_DMA_CHNL_SW_REQUEST_Ch__Off      = 0,     /*!< Off : Inactive                                                            */
  MDR_DMA_CHNL_SW_REQUEST_Ch__On       = 1,     /*!< On : Active                                                               */
} MDR_DMA_CHNL_SW_REQUEST_Ch__Enum;

