StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE81.h
/* ===================================================  CHNL_PRIORITY_CLR  =================================================== */
/* =========================================  MDR_DMA CHNL_PRIORITY_CLR Ch_ [0..0]  ========================================== */
typedef enum {                                  /*!< MDR_DMA_CHNL_PRIORITY_CLR_Ch_                                             */
  MDR_DMA_CHNL_PRIORITY_CLR_Ch__Off    = 0,     /*!< Off : Inactive                                                            */
  MDR_DMA_CHNL_PRIORITY_CLR_Ch__On     = 1,     /*!< On : Active                                                               */
} MDR_DMA_CHNL_PRIORITY_CLR_Ch__Enum;

/* ========================================================  ERR_CLR  ======================================================== */
/* ==============================================  MDR_DMA ERR_CLR Ch_ [0..0]  =============================================== */
typedef enum {                                  /*!< MDR_DMA_ERR_CLR_Ch_                                                       */
  MDR_DMA_ERR_CLR_Ch__Off              = 0,     /*!< Off : Inactive                                                            */
  MDR_DMA_ERR_CLR_Ch__On               = 1,     /*!< On : Active                                                               */
} MDR_DMA_ERR_CLR_Ch__Enum;

/* ========================================================  CHMUX0  ========================================================= */
/* ========================================================  CHMUX1  ========================================================= */
/* ========================================================  CHMUX2  ========================================================= */
/* ========================================================  CHMUX3  ========================================================= */
/* ========================================================  CHMUX4  ========================================================= */
/* ========================================================  CHMUX5  ========================================================= */
/* ========================================================  CHMUX6  ========================================================= */
/* ========================================================  CHMUX7  ========================================================= */

/** @} */ /* End of group EnumValue_peripherals */


#ifdef __cplusplus
}
#endif

#endif /* MDR1986VE81_H */


/** @} */ /* End of group MDR1986VE81 */

/** @} */ /* End of group Milandr */
